Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x1f91 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 35 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x75f12): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfloat-abi=soft -mthumb -march=armv7e-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x13907): ../Core/Src/app_freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1198a): C:/Users/Valenokks/STM32CubeIDE/workspace_1.15.1/usblora/Debug
    <1a>   DW_AT_ranges      : 0x1b
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 36 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x7371): size_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 12 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

 <1><84>: Abbrev Number: 12 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 2
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x7cd0b): short int
 <1><8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x89a4a): __uint16_t
    <90>   DW_AT_decl_file   : 3
    <91>   DW_AT_decl_line   : 57
    <92>   DW_AT_decl_column : 25
    <93>   DW_AT_type        : <0x97>
 <1><97>: Abbrev Number: 12 (DW_TAG_base_type)
    <98>   DW_AT_byte_size   : 2
    <99>   DW_AT_encoding    : 7	(unsigned)
    <9a>   DW_AT_name        : (indirect string, offset: 0xa25d9): short unsigned int
 <1><9e>: Abbrev Number: 5 (DW_TAG_typedef)
    <9f>   DW_AT_name        : (indirect string, offset: 0x67b3d): __int32_t
    <a3>   DW_AT_decl_file   : 3
    <a4>   DW_AT_decl_line   : 77
    <a5>   DW_AT_decl_column : 24
    <a6>   DW_AT_type        : <0xaa>
 <1><aa>: Abbrev Number: 12 (DW_TAG_base_type)
    <ab>   DW_AT_byte_size   : 4
    <ac>   DW_AT_encoding    : 5	(signed)
    <ad>   DW_AT_name        : (indirect string, offset: 0xe0d1): long int
 <1><b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x6b1fa): __uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 79
    <b8>   DW_AT_decl_column : 25
    <b9>   DW_AT_type        : <0xbd>
 <1><bd>: Abbrev Number: 12 (DW_TAG_base_type)
    <be>   DW_AT_byte_size   : 4
    <bf>   DW_AT_encoding    : 7	(unsigned)
    <c0>   DW_AT_name        : (indirect string, offset: 0x2830e): long unsigned int
 <1><c4>: Abbrev Number: 12 (DW_TAG_base_type)
    <c5>   DW_AT_byte_size   : 8
    <c6>   DW_AT_encoding    : 7	(unsigned)
    <c7>   DW_AT_name        : (indirect string, offset: 0x232c9): long long unsigned int
 <1><cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <cc>   DW_AT_name        : (indirect string, offset: 0x8a54): int8_t
    <d0>   DW_AT_decl_file   : 4
    <d1>   DW_AT_decl_line   : 20
    <d2>   DW_AT_decl_column : 18
    <d3>   DW_AT_type        : <0x52>
 <1><d7>: Abbrev Number: 5 (DW_TAG_typedef)
    <d8>   DW_AT_name        : (indirect string, offset: 0x30b83): uint8_t
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 24
    <de>   DW_AT_decl_column : 19
    <df>   DW_AT_type        : <0x65>
 <1><e3>: Abbrev Number: 19 (DW_TAG_const_type)
    <e4>   DW_AT_type        : <0xd7>
 <1><e8>: Abbrev Number: 5 (DW_TAG_typedef)
    <e9>   DW_AT_name        : (indirect string, offset: 0x60640): int16_t
    <ed>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 32
    <ef>   DW_AT_decl_column : 19
    <f0>   DW_AT_type        : <0x78>
 <1><f4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f5>   DW_AT_name        : (indirect string, offset: 0x7a827): uint16_t
    <f9>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 36
    <fb>   DW_AT_decl_column : 20
    <fc>   DW_AT_type        : <0x8b>
 <1><100>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <101>   DW_AT_type        : <0xf4>
 <1><105>: Abbrev Number: 5 (DW_TAG_typedef)
    <106>   DW_AT_name        : (indirect string, offset: 0x67b3f): int32_t
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 44
    <10c>   DW_AT_decl_column : 19
    <10d>   DW_AT_type        : <0x9e>
 <1><111>: Abbrev Number: 5 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0x79ff2): uint32_t
    <116>   DW_AT_decl_file   : 4
    <117>   DW_AT_decl_line   : 48
    <118>   DW_AT_decl_column : 20
    <119>   DW_AT_type        : <0xb1>
 <1><11d>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <11e>   DW_AT_type        : <0x111>
 <1><122>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <123>   DW_AT_byte_size   : 4
    <123>   DW_AT_type        : <0x127>
 <1><127>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <128>   DW_AT_prototyped  : 1
    <128>   DW_AT_sibling     : <0x132>
 <2><12c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <12d>   DW_AT_type        : <0x132>
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 37 (DW_TAG_pointer_type)
    <133>   DW_AT_byte_size   : 4
 <1><134>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <135>   DW_AT_byte_size   : 4
    <135>   DW_AT_type        : <0xd7>
 <1><139>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <13a>   DW_AT_byte_size   : 4
    <13a>   DW_AT_type        : <0x13e>
 <1><13e>: Abbrev Number: 38 (DW_TAG_subroutine_type)
    <13f>   DW_AT_prototyped  : 1
 <1><13f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <140>   DW_AT_byte_size   : 4
    <140>   DW_AT_type        : <0x144>
 <1><144>: Abbrev Number: 12 (DW_TAG_base_type)
    <145>   DW_AT_byte_size   : 1
    <146>   DW_AT_encoding    : 8	(unsigned char)
    <147>   DW_AT_name        : (indirect string, offset: 0x36419): char
 <1><14b>: Abbrev Number: 19 (DW_TAG_const_type)
    <14c>   DW_AT_type        : <0x144>
 <1><150>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <151>   DW_AT_byte_size   : 4
    <151>   DW_AT_type        : <0x14b>
 <1><155>: Abbrev Number: 5 (DW_TAG_typedef)
    <156>   DW_AT_name        : (indirect string, offset: 0x92fa7): TaskHandle_t
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 70
    <15c>   DW_AT_decl_column : 37
    <15d>   DW_AT_type        : <0x161>
 <1><161>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <162>   DW_AT_byte_size   : 4
    <162>   DW_AT_type        : <0x166>
 <1><166>: Abbrev Number: 39 (DW_TAG_structure_type)
    <167>   DW_AT_name        : (indirect string, offset: 0x8fae4): tskTaskControlBlock
    <16b>   DW_AT_declaration : 1
 <1><16b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 300
    <170>   DW_AT_decl_column : 9
    <170>   DW_AT_sibling     : <0x1ad>
 <2><174>: Abbrev Number: 9 (DW_TAG_member)
    <175>   DW_AT_name        : CCR
    <179>   DW_AT_decl_file   : 6
    <17a>   DW_AT_decl_line   : 302
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0x11d>
    <181>   DW_AT_data_member_location: 0
 <2><182>: Abbrev Number: 4 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x6db58): CNDTR
    <187>   DW_AT_decl_file   : 6
    <188>   DW_AT_decl_line   : 303
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0x11d>
    <18f>   DW_AT_data_member_location: 4
 <2><190>: Abbrev Number: 4 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xa3b35): CPAR
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 304
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0x11d>
    <19d>   DW_AT_data_member_location: 8
 <2><19e>: Abbrev Number: 4 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x5e1cc): CMAR
    <1a3>   DW_AT_decl_file   : 6
    <1a4>   DW_AT_decl_line   : 305
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0x11d>
    <1ab>   DW_AT_data_member_location: 12
 <2><1ac>: Abbrev Number: 0
 <1><1ad>: Abbrev Number: 11 (DW_TAG_typedef)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x89004): DMA_Channel_TypeDef
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 306
    <1b5>   DW_AT_decl_column : 3
    <1b6>   DW_AT_type        : <0x16b>
 <1><1ba>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1bb>   DW_AT_byte_size   : 8
    <1bc>   DW_AT_decl_file   : 6
    <1bd>   DW_AT_decl_line   : 308
    <1bf>   DW_AT_decl_column : 9
    <1bf>   DW_AT_sibling     : <0x1e0>
 <2><1c3>: Abbrev Number: 9 (DW_TAG_member)
    <1c4>   DW_AT_name        : ISR
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 310
    <1cb>   DW_AT_decl_column : 17
    <1cc>   DW_AT_type        : <0x11d>
    <1d0>   DW_AT_data_member_location: 0
 <2><1d1>: Abbrev Number: 4 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x75c26): IFCR
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 311
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0x11d>
    <1de>   DW_AT_data_member_location: 4
 <2><1df>: Abbrev Number: 0
 <1><1e0>: Abbrev Number: 11 (DW_TAG_typedef)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x3db72): DMA_TypeDef
    <1e5>   DW_AT_decl_file   : 6
    <1e6>   DW_AT_decl_line   : 312
    <1e8>   DW_AT_decl_column : 3
    <1e9>   DW_AT_type        : <0x1ba>
 <1><1ed>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 317
    <1f2>   DW_AT_decl_column : 9
    <1f2>   DW_AT_sibling     : <0x205>
 <2><1f6>: Abbrev Number: 9 (DW_TAG_member)
    <1f7>   DW_AT_name        : CCR
    <1fb>   DW_AT_decl_file   : 6
    <1fc>   DW_AT_decl_line   : 319
    <1fe>   DW_AT_decl_column : 19
    <1ff>   DW_AT_type        : <0x11d>
    <203>   DW_AT_data_member_location: 0
 <2><204>: Abbrev Number: 0
 <1><205>: Abbrev Number: 11 (DW_TAG_typedef)
    <206>   DW_AT_name        : (indirect string, offset: 0x13d7f): DMAMUX_Channel_TypeDef
    <20a>   DW_AT_decl_file   : 6
    <20b>   DW_AT_decl_line   : 320
    <20d>   DW_AT_decl_column : 2
    <20e>   DW_AT_type        : <0x1ed>
 <1><212>: Abbrev Number: 15 (DW_TAG_structure_type)
    <213>   DW_AT_byte_size   : 8
    <214>   DW_AT_decl_file   : 6
    <215>   DW_AT_decl_line   : 322
    <217>   DW_AT_decl_column : 9
    <217>   DW_AT_sibling     : <0x238>
 <2><21b>: Abbrev Number: 9 (DW_TAG_member)
    <21c>   DW_AT_name        : CSR
    <220>   DW_AT_decl_file   : 6
    <221>   DW_AT_decl_line   : 324
    <223>   DW_AT_decl_column : 19
    <224>   DW_AT_type        : <0x11d>
    <228>   DW_AT_data_member_location: 0
 <2><229>: Abbrev Number: 9 (DW_TAG_member)
    <22a>   DW_AT_name        : CFR
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 325
    <231>   DW_AT_decl_column : 19
    <232>   DW_AT_type        : <0x11d>
    <236>   DW_AT_data_member_location: 4
 <2><237>: Abbrev Number: 0
 <1><238>: Abbrev Number: 11 (DW_TAG_typedef)
    <239>   DW_AT_name        : (indirect string, offset: 0xa007a): DMAMUX_ChannelStatus_TypeDef
    <23d>   DW_AT_decl_file   : 6
    <23e>   DW_AT_decl_line   : 326
    <240>   DW_AT_decl_column : 2
    <241>   DW_AT_type        : <0x212>
 <1><245>: Abbrev Number: 15 (DW_TAG_structure_type)
    <246>   DW_AT_byte_size   : 4
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 328
    <24a>   DW_AT_decl_column : 9
    <24a>   DW_AT_sibling     : <0x25d>
 <2><24e>: Abbrev Number: 4 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x5329d): RGCR
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 330
    <256>   DW_AT_decl_column : 19
    <257>   DW_AT_type        : <0x11d>
    <25b>   DW_AT_data_member_location: 0
 <2><25c>: Abbrev Number: 0
 <1><25d>: Abbrev Number: 11 (DW_TAG_typedef)
    <25e>   DW_AT_name        : (indirect string, offset: 0x63db7): DMAMUX_RequestGen_TypeDef
    <262>   DW_AT_decl_file   : 6
    <263>   DW_AT_decl_line   : 331
    <265>   DW_AT_decl_column : 2
    <266>   DW_AT_type        : <0x245>
 <1><26a>: Abbrev Number: 15 (DW_TAG_structure_type)
    <26b>   DW_AT_byte_size   : 8
    <26c>   DW_AT_decl_file   : 6
    <26d>   DW_AT_decl_line   : 333
    <26f>   DW_AT_decl_column : 9
    <26f>   DW_AT_sibling     : <0x290>
 <2><273>: Abbrev Number: 4 (DW_TAG_member)
    <274>   DW_AT_name        : (indirect string, offset: 0x5906e): RGSR
    <278>   DW_AT_decl_file   : 6
    <279>   DW_AT_decl_line   : 335
    <27b>   DW_AT_decl_column : 19
    <27c>   DW_AT_type        : <0x11d>
    <280>   DW_AT_data_member_location: 0
 <2><281>: Abbrev Number: 4 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x2c8): RGCFR
    <286>   DW_AT_decl_file   : 6
    <287>   DW_AT_decl_line   : 336
    <289>   DW_AT_decl_column : 19
    <28a>   DW_AT_type        : <0x11d>
    <28e>   DW_AT_data_member_location: 4
 <2><28f>: Abbrev Number: 0
 <1><290>: Abbrev Number: 11 (DW_TAG_typedef)
    <291>   DW_AT_name        : (indirect string, offset: 0x2228f): DMAMUX_RequestGenStatus_TypeDef
    <295>   DW_AT_decl_file   : 6
    <296>   DW_AT_decl_line   : 337
    <298>   DW_AT_decl_column : 2
    <299>   DW_AT_type        : <0x26a>
 <1><29d>: Abbrev Number: 15 (DW_TAG_structure_type)
    <29e>   DW_AT_byte_size   : 48
    <29f>   DW_AT_decl_file   : 6
    <2a0>   DW_AT_decl_line   : 722
    <2a2>   DW_AT_decl_column : 9
    <2a2>   DW_AT_sibling     : <0x34f>
 <2><2a6>: Abbrev Number: 9 (DW_TAG_member)
    <2a7>   DW_AT_name        : CR1
    <2ab>   DW_AT_decl_file   : 6
    <2ac>   DW_AT_decl_line   : 724
    <2ae>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x11d>
    <2b3>   DW_AT_data_member_location: 0
 <2><2b4>: Abbrev Number: 9 (DW_TAG_member)
    <2b5>   DW_AT_name        : CR2
    <2b9>   DW_AT_decl_file   : 6
    <2ba>   DW_AT_decl_line   : 725
    <2bc>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0x11d>
    <2c1>   DW_AT_data_member_location: 4
 <2><2c2>: Abbrev Number: 9 (DW_TAG_member)
    <2c3>   DW_AT_name        : CR3
    <2c7>   DW_AT_decl_file   : 6
    <2c8>   DW_AT_decl_line   : 726
    <2ca>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0x11d>
    <2cf>   DW_AT_data_member_location: 8
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : BRR
    <2d5>   DW_AT_decl_file   : 6
    <2d6>   DW_AT_decl_line   : 727
    <2d8>   DW_AT_decl_column : 17
    <2d9>   DW_AT_type        : <0x11d>
    <2dd>   DW_AT_data_member_location: 12
 <2><2de>: Abbrev Number: 4 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x2ebca): GTPR
    <2e3>   DW_AT_decl_file   : 6
    <2e4>   DW_AT_decl_line   : 728
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0x11d>
    <2eb>   DW_AT_data_member_location: 16
 <2><2ec>: Abbrev Number: 4 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x31ee3): RTOR
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 729
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0x11d>
    <2f9>   DW_AT_data_member_location: 20
 <2><2fa>: Abbrev Number: 9 (DW_TAG_member)
    <2fb>   DW_AT_name        : RQR
    <2ff>   DW_AT_decl_file   : 6
    <300>   DW_AT_decl_line   : 730
    <302>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x11d>
    <307>   DW_AT_data_member_location: 24
 <2><308>: Abbrev Number: 9 (DW_TAG_member)
    <309>   DW_AT_name        : ISR
    <30d>   DW_AT_decl_file   : 6
    <30e>   DW_AT_decl_line   : 731
    <310>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0x11d>
    <315>   DW_AT_data_member_location: 28
 <2><316>: Abbrev Number: 9 (DW_TAG_member)
    <317>   DW_AT_name        : ICR
    <31b>   DW_AT_decl_file   : 6
    <31c>   DW_AT_decl_line   : 732
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0x11d>
    <323>   DW_AT_data_member_location: 32
 <2><324>: Abbrev Number: 9 (DW_TAG_member)
    <325>   DW_AT_name        : RDR
    <329>   DW_AT_decl_file   : 6
    <32a>   DW_AT_decl_line   : 733
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0x11d>
    <331>   DW_AT_data_member_location: 36
 <2><332>: Abbrev Number: 9 (DW_TAG_member)
    <333>   DW_AT_name        : TDR
    <337>   DW_AT_decl_file   : 6
    <338>   DW_AT_decl_line   : 734
    <33a>   DW_AT_decl_column : 17
    <33b>   DW_AT_type        : <0x11d>
    <33f>   DW_AT_data_member_location: 40
 <2><340>: Abbrev Number: 4 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x73297): PRESC
    <345>   DW_AT_decl_file   : 6
    <346>   DW_AT_decl_line   : 735
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0x11d>
    <34d>   DW_AT_data_member_location: 44
 <2><34e>: Abbrev Number: 0
 <1><34f>: Abbrev Number: 11 (DW_TAG_typedef)
    <350>   DW_AT_name        : (indirect string, offset: 0xa7fc8): USART_TypeDef
    <354>   DW_AT_decl_file   : 6
    <355>   DW_AT_decl_line   : 736
    <357>   DW_AT_decl_column : 3
    <358>   DW_AT_type        : <0x29d>
 <1><35c>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <35d>   DW_AT_encoding    : 7	(unsigned)
    <35e>   DW_AT_byte_size   : 1
    <35f>   DW_AT_type        : <0x71>
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 39
    <365>   DW_AT_decl_column : 1
    <366>   DW_AT_sibling     : <0x383>
 <2><36a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <36b>   DW_AT_name        : (indirect string, offset: 0x7e6cb): HAL_OK
    <36f>   DW_AT_const_value : 0
 <2><370>: Abbrev Number: 1 (DW_TAG_enumerator)
    <371>   DW_AT_name        : (indirect string, offset: 0x696ba): HAL_ERROR
    <375>   DW_AT_const_value : 1
 <2><376>: Abbrev Number: 1 (DW_TAG_enumerator)
    <377>   DW_AT_name        : (indirect string, offset: 0x1d664): HAL_BUSY
    <37b>   DW_AT_const_value : 2
 <2><37c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <37d>   DW_AT_name        : (indirect string, offset: 0x31061): HAL_TIMEOUT
    <381>   DW_AT_const_value : 3
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 5 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x97a42): HAL_StatusTypeDef
    <388>   DW_AT_decl_file   : 7
    <389>   DW_AT_decl_line   : 44
    <38a>   DW_AT_decl_column : 3
    <38b>   DW_AT_type        : <0x35c>
 <1><38f>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <390>   DW_AT_encoding    : 7	(unsigned)
    <391>   DW_AT_byte_size   : 1
    <392>   DW_AT_type        : <0x71>
    <396>   DW_AT_decl_file   : 7
    <397>   DW_AT_decl_line   : 50
    <398>   DW_AT_decl_column : 1
    <399>   DW_AT_sibling     : <0x3aa>
 <2><39d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39e>   DW_AT_name        : (indirect string, offset: 0x7c076): HAL_UNLOCKED
    <3a2>   DW_AT_const_value : 0
 <2><3a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a4>   DW_AT_name        : (indirect string, offset: 0xa95d0): HAL_LOCKED
    <3a8>   DW_AT_const_value : 1
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x66e8a): HAL_LockTypeDef
    <3af>   DW_AT_decl_file   : 7
    <3b0>   DW_AT_decl_line   : 53
    <3b1>   DW_AT_decl_column : 3
    <3b2>   DW_AT_type        : <0x38f>
 <1><3b6>: Abbrev Number: 13 (DW_TAG_array_type)
    <3b7>   DW_AT_type        : <0xe3>
    <3bb>   DW_AT_sibling     : <0x3c6>
 <2><3bf>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <3c0>   DW_AT_type        : <0x3d>
    <3c4>   DW_AT_upper_bound : 6
 <2><3c5>: Abbrev Number: 0
 <1><3c6>: Abbrev Number: 19 (DW_TAG_const_type)
    <3c7>   DW_AT_type        : <0x3b6>
 <1><3cb>: Abbrev Number: 10 (DW_TAG_variable)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x3caa6): CHANNEL_OFFSET_TAB
    <3d0>   DW_AT_decl_file   : 18
    <3d1>   DW_AT_decl_line   : 47
    <3d2>   DW_AT_decl_column : 22
    <3d3>   DW_AT_type        : <0x3c6>
    <3d7>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><3dd>: Abbrev Number: 16 (DW_TAG_structure_type)
    <3de>   DW_AT_byte_size   : 32
    <3df>   DW_AT_decl_file   : 8
    <3e0>   DW_AT_decl_line   : 47
    <3e1>   DW_AT_decl_column : 9
    <3e1>   DW_AT_sibling     : <0x44e>
 <2><3e5>: Abbrev Number: 2 (DW_TAG_member)
    <3e6>   DW_AT_name        : (indirect string, offset: 0x3e133): Request
    <3ea>   DW_AT_decl_file   : 8
    <3eb>   DW_AT_decl_line   : 49
    <3ec>   DW_AT_decl_column : 12
    <3ed>   DW_AT_type        : <0x111>
    <3f1>   DW_AT_data_member_location: 0
 <2><3f2>: Abbrev Number: 2 (DW_TAG_member)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x3b221): Direction
    <3f7>   DW_AT_decl_file   : 8
    <3f8>   DW_AT_decl_line   : 52
    <3f9>   DW_AT_decl_column : 12
    <3fa>   DW_AT_type        : <0x111>
    <3fe>   DW_AT_data_member_location: 4
 <2><3ff>: Abbrev Number: 2 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0x38ee1): PeriphInc
    <404>   DW_AT_decl_file   : 8
    <405>   DW_AT_decl_line   : 56
    <406>   DW_AT_decl_column : 12
    <407>   DW_AT_type        : <0x111>
    <40b>   DW_AT_data_member_location: 8
 <2><40c>: Abbrev Number: 2 (DW_TAG_member)
    <40d>   DW_AT_name        : (indirect string, offset: 0x1a2d0): MemInc
    <411>   DW_AT_decl_file   : 8
    <412>   DW_AT_decl_line   : 59
    <413>   DW_AT_decl_column : 12
    <414>   DW_AT_type        : <0x111>
    <418>   DW_AT_data_member_location: 12
 <2><419>: Abbrev Number: 2 (DW_TAG_member)
    <41a>   DW_AT_name        : (indirect string, offset: 0x540ae): PeriphDataAlignment
    <41e>   DW_AT_decl_file   : 8
    <41f>   DW_AT_decl_line   : 62
    <420>   DW_AT_decl_column : 12
    <421>   DW_AT_type        : <0x111>
    <425>   DW_AT_data_member_location: 16
 <2><426>: Abbrev Number: 2 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0x98c15): MemDataAlignment
    <42b>   DW_AT_decl_file   : 8
    <42c>   DW_AT_decl_line   : 65
    <42d>   DW_AT_decl_column : 12
    <42e>   DW_AT_type        : <0x111>
    <432>   DW_AT_data_member_location: 20
 <2><433>: Abbrev Number: 2 (DW_TAG_member)
    <434>   DW_AT_name        : (indirect string, offset: 0xaf81d): Mode
    <438>   DW_AT_decl_file   : 8
    <439>   DW_AT_decl_line   : 68
    <43a>   DW_AT_decl_column : 12
    <43b>   DW_AT_type        : <0x111>
    <43f>   DW_AT_data_member_location: 24
 <2><440>: Abbrev Number: 2 (DW_TAG_member)
    <441>   DW_AT_name        : (indirect string, offset: 0xaebf1): Priority
    <445>   DW_AT_decl_file   : 8
    <446>   DW_AT_decl_line   : 73
    <447>   DW_AT_decl_column : 12
    <448>   DW_AT_type        : <0x111>
    <44c>   DW_AT_data_member_location: 28
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 5 (DW_TAG_typedef)
    <44f>   DW_AT_name        : (indirect string, offset: 0x2d295): DMA_InitTypeDef
    <453>   DW_AT_decl_file   : 8
    <454>   DW_AT_decl_line   : 75
    <455>   DW_AT_decl_column : 3
    <456>   DW_AT_type        : <0x3dd>
 <1><45a>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <45b>   DW_AT_encoding    : 7	(unsigned)
    <45c>   DW_AT_byte_size   : 1
    <45d>   DW_AT_type        : <0x71>
    <461>   DW_AT_decl_file   : 8
    <462>   DW_AT_decl_line   : 81
    <463>   DW_AT_decl_column : 1
    <464>   DW_AT_sibling     : <0x481>
 <2><468>: Abbrev Number: 1 (DW_TAG_enumerator)
    <469>   DW_AT_name        : (indirect string, offset: 0x7cf96): HAL_DMA_STATE_RESET
    <46d>   DW_AT_const_value : 0
 <2><46e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <46f>   DW_AT_name        : (indirect string, offset: 0x2e424): HAL_DMA_STATE_READY
    <473>   DW_AT_const_value : 1
 <2><474>: Abbrev Number: 1 (DW_TAG_enumerator)
    <475>   DW_AT_name        : (indirect string, offset: 0x74a8f): HAL_DMA_STATE_BUSY
    <479>   DW_AT_const_value : 2
 <2><47a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47b>   DW_AT_name        : (indirect string, offset: 0xa6a59): HAL_DMA_STATE_TIMEOUT
    <47f>   DW_AT_const_value : 3
 <2><480>: Abbrev Number: 0
 <1><481>: Abbrev Number: 5 (DW_TAG_typedef)
    <482>   DW_AT_name        : (indirect string, offset: 0x5db32): HAL_DMA_StateTypeDef
    <486>   DW_AT_decl_file   : 8
    <487>   DW_AT_decl_line   : 86
    <488>   DW_AT_decl_column : 3
    <489>   DW_AT_type        : <0x45a>
 <1><48d>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <48e>   DW_AT_type        : <0x481>
 <1><492>: Abbrev Number: 20 (DW_TAG_structure_type)
    <493>   DW_AT_name        : (indirect string, offset: 0x8fd3d): __DMA_HandleTypeDef
    <497>   DW_AT_byte_size   : 96
    <498>   DW_AT_decl_file   : 8
    <499>   DW_AT_decl_line   : 113
    <49a>   DW_AT_decl_column : 16
    <49b>   DW_AT_sibling     : <0x58a>
 <2><49f>: Abbrev Number: 2 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x28b05): Instance
    <4a4>   DW_AT_decl_file   : 8
    <4a5>   DW_AT_decl_line   : 115
    <4a6>   DW_AT_decl_column : 36
    <4a7>   DW_AT_type        : <0x58a>
    <4ab>   DW_AT_data_member_location: 0
 <2><4ac>: Abbrev Number: 2 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0xaf143): Init
    <4b1>   DW_AT_decl_file   : 8
    <4b2>   DW_AT_decl_line   : 117
    <4b3>   DW_AT_decl_column : 35
    <4b4>   DW_AT_type        : <0x44e>
    <4b8>   DW_AT_data_member_location: 4
 <2><4b9>: Abbrev Number: 2 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0x77bdf): Lock
    <4be>   DW_AT_decl_file   : 8
    <4bf>   DW_AT_decl_line   : 119
    <4c0>   DW_AT_decl_column : 35
    <4c1>   DW_AT_type        : <0x3aa>
    <4c5>   DW_AT_data_member_location: 36
 <2><4c6>: Abbrev Number: 2 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0xb2929): State
    <4cb>   DW_AT_decl_file   : 8
    <4cc>   DW_AT_decl_line   : 121
    <4cd>   DW_AT_decl_column : 35
    <4ce>   DW_AT_type        : <0x48d>
    <4d2>   DW_AT_data_member_location: 37
 <2><4d3>: Abbrev Number: 2 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0xa1080): Parent
    <4d8>   DW_AT_decl_file   : 8
    <4d9>   DW_AT_decl_line   : 123
    <4da>   DW_AT_decl_column : 11
    <4db>   DW_AT_type        : <0x132>
    <4df>   DW_AT_data_member_location: 40
 <2><4e0>: Abbrev Number: 2 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xa89c8): XferCpltCallback
    <4e5>   DW_AT_decl_file   : 8
    <4e6>   DW_AT_decl_line   : 125
    <4e7>   DW_AT_decl_column : 11
    <4e8>   DW_AT_type        : <0x59f>
    <4ec>   DW_AT_data_member_location: 44
 <2><4ed>: Abbrev Number: 2 (DW_TAG_member)
    <4ee>   DW_AT_name        : (indirect string, offset: 0x82619): XferHalfCpltCallback
    <4f2>   DW_AT_decl_file   : 8
    <4f3>   DW_AT_decl_line   : 127
    <4f4>   DW_AT_decl_column : 11
    <4f5>   DW_AT_type        : <0x59f>
    <4f9>   DW_AT_data_member_location: 48
 <2><4fa>: Abbrev Number: 2 (DW_TAG_member)
    <4fb>   DW_AT_name        : (indirect string, offset: 0x18011): XferErrorCallback
    <4ff>   DW_AT_decl_file   : 8
    <500>   DW_AT_decl_line   : 129
    <501>   DW_AT_decl_column : 11
    <502>   DW_AT_type        : <0x59f>
    <506>   DW_AT_data_member_location: 52
 <2><507>: Abbrev Number: 2 (DW_TAG_member)
    <508>   DW_AT_name        : (indirect string, offset: 0x9e174): XferAbortCallback
    <50c>   DW_AT_decl_file   : 8
    <50d>   DW_AT_decl_line   : 131
    <50e>   DW_AT_decl_column : 11
    <50f>   DW_AT_type        : <0x59f>
    <513>   DW_AT_data_member_location: 56
 <2><514>: Abbrev Number: 2 (DW_TAG_member)
    <515>   DW_AT_name        : (indirect string, offset: 0xa59f0): ErrorCode
    <519>   DW_AT_decl_file   : 8
    <51a>   DW_AT_decl_line   : 133
    <51b>   DW_AT_decl_column : 35
    <51c>   DW_AT_type        : <0x11d>
    <520>   DW_AT_data_member_location: 60
 <2><521>: Abbrev Number: 2 (DW_TAG_member)
    <522>   DW_AT_name        : (indirect string, offset: 0x4492c): DmaBaseAddress
    <526>   DW_AT_decl_file   : 8
    <527>   DW_AT_decl_line   : 135
    <528>   DW_AT_decl_column : 27
    <529>   DW_AT_type        : <0x5a4>
    <52d>   DW_AT_data_member_location: 64
 <2><52e>: Abbrev Number: 2 (DW_TAG_member)
    <52f>   DW_AT_name        : (indirect string, offset: 0x9c9f3): ChannelIndex
    <533>   DW_AT_decl_file   : 8
    <534>   DW_AT_decl_line   : 137
    <535>   DW_AT_decl_column : 35
    <536>   DW_AT_type        : <0x111>
    <53a>   DW_AT_data_member_location: 68
 <2><53b>: Abbrev Number: 2 (DW_TAG_member)
    <53c>   DW_AT_name        : (indirect string, offset: 0x9fff): DMAmuxChannel
    <540>   DW_AT_decl_file   : 8
    <541>   DW_AT_decl_line   : 139
    <542>   DW_AT_decl_column : 37
    <543>   DW_AT_type        : <0x5a9>
    <547>   DW_AT_data_member_location: 72
 <2><548>: Abbrev Number: 2 (DW_TAG_member)
    <549>   DW_AT_name        : (indirect string, offset: 0x3e397): DMAmuxChannelStatus
    <54d>   DW_AT_decl_file   : 8
    <54e>   DW_AT_decl_line   : 141
    <54f>   DW_AT_decl_column : 37
    <550>   DW_AT_type        : <0x5ae>
    <554>   DW_AT_data_member_location: 76
 <2><555>: Abbrev Number: 2 (DW_TAG_member)
    <556>   DW_AT_name        : (indirect string, offset: 0x802e1): DMAmuxChannelStatusMask
    <55a>   DW_AT_decl_file   : 8
    <55b>   DW_AT_decl_line   : 143
    <55c>   DW_AT_decl_column : 36
    <55d>   DW_AT_type        : <0x111>
    <561>   DW_AT_data_member_location: 80
 <2><562>: Abbrev Number: 2 (DW_TAG_member)
    <563>   DW_AT_name        : (indirect string, offset: 0x31b08): DMAmuxRequestGen
    <567>   DW_AT_decl_file   : 8
    <568>   DW_AT_decl_line   : 145
    <569>   DW_AT_decl_column : 37
    <56a>   DW_AT_type        : <0x5b3>
    <56e>   DW_AT_data_member_location: 84
 <2><56f>: Abbrev Number: 2 (DW_TAG_member)
    <570>   DW_AT_name        : (indirect string, offset: 0x8562c): DMAmuxRequestGenStatus
    <574>   DW_AT_decl_file   : 8
    <575>   DW_AT_decl_line   : 147
    <576>   DW_AT_decl_column : 37
    <577>   DW_AT_type        : <0x5b8>
    <57b>   DW_AT_data_member_location: 88
 <2><57c>: Abbrev Number: 2 (DW_TAG_member)
    <57d>   DW_AT_name        : (indirect string, offset: 0x886ad): DMAmuxRequestGenStatusMask
    <581>   DW_AT_decl_file   : 8
    <582>   DW_AT_decl_line   : 149
    <583>   DW_AT_decl_column : 36
    <584>   DW_AT_type        : <0x111>
    <588>   DW_AT_data_member_location: 92
 <2><589>: Abbrev Number: 0
 <1><58a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <58b>   DW_AT_byte_size   : 4
    <58b>   DW_AT_type        : <0x1ad>
 <1><58f>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <590>   DW_AT_prototyped  : 1
    <590>   DW_AT_sibling     : <0x59a>
 <2><594>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <595>   DW_AT_type        : <0x59a>
 <2><599>: Abbrev Number: 0
 <1><59a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <59b>   DW_AT_byte_size   : 4
    <59b>   DW_AT_type        : <0x492>
 <1><59f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5a0>   DW_AT_byte_size   : 4
    <5a0>   DW_AT_type        : <0x58f>
 <1><5a4>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5a5>   DW_AT_byte_size   : 4
    <5a5>   DW_AT_type        : <0x1e0>
 <1><5a9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5aa>   DW_AT_byte_size   : 4
    <5aa>   DW_AT_type        : <0x205>
 <1><5ae>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5af>   DW_AT_byte_size   : 4
    <5af>   DW_AT_type        : <0x238>
 <1><5b3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b4>   DW_AT_byte_size   : 4
    <5b4>   DW_AT_type        : <0x25d>
 <1><5b8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b9>   DW_AT_byte_size   : 4
    <5b9>   DW_AT_type        : <0x290>
 <1><5bd>: Abbrev Number: 5 (DW_TAG_typedef)
    <5be>   DW_AT_name        : (indirect string, offset: 0x8fd3f): DMA_HandleTypeDef
    <5c2>   DW_AT_decl_file   : 8
    <5c3>   DW_AT_decl_line   : 150
    <5c4>   DW_AT_decl_column : 3
    <5c5>   DW_AT_type        : <0x492>
 <1><5c9>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5ca>   DW_AT_byte_size   : 4
    <5ca>   DW_AT_type        : <0x5bd>
 <1><5ce>: Abbrev Number: 16 (DW_TAG_structure_type)
    <5cf>   DW_AT_byte_size   : 36
    <5d0>   DW_AT_decl_file   : 9
    <5d1>   DW_AT_decl_line   : 46
    <5d2>   DW_AT_decl_column : 9
    <5d2>   DW_AT_sibling     : <0x64c>
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x69a6b): BaudRate
    <5db>   DW_AT_decl_file   : 9
    <5dc>   DW_AT_decl_line   : 48
    <5dd>   DW_AT_decl_column : 12
    <5de>   DW_AT_type        : <0x111>
    <5e2>   DW_AT_data_member_location: 0
 <2><5e3>: Abbrev Number: 2 (DW_TAG_member)
    <5e4>   DW_AT_name        : (indirect string, offset: 0x2ab2e): WordLength
    <5e8>   DW_AT_decl_file   : 9
    <5e9>   DW_AT_decl_line   : 66
    <5ea>   DW_AT_decl_column : 12
    <5eb>   DW_AT_type        : <0x111>
    <5ef>   DW_AT_data_member_location: 4
 <2><5f0>: Abbrev Number: 2 (DW_TAG_member)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x9ade7): StopBits
    <5f5>   DW_AT_decl_file   : 9
    <5f6>   DW_AT_decl_line   : 69
    <5f7>   DW_AT_decl_column : 12
    <5f8>   DW_AT_type        : <0x111>
    <5fc>   DW_AT_data_member_location: 8
 <2><5fd>: Abbrev Number: 2 (DW_TAG_member)
    <5fe>   DW_AT_name        : (indirect string, offset: 0x56086): Parity
    <602>   DW_AT_decl_file   : 9
    <603>   DW_AT_decl_line   : 72
    <604>   DW_AT_decl_column : 12
    <605>   DW_AT_type        : <0x111>
    <609>   DW_AT_data_member_location: 12
 <2><60a>: Abbrev Number: 2 (DW_TAG_member)
    <60b>   DW_AT_name        : (indirect string, offset: 0xaf81d): Mode
    <60f>   DW_AT_decl_file   : 9
    <610>   DW_AT_decl_line   : 79
    <611>   DW_AT_decl_column : 12
    <612>   DW_AT_type        : <0x111>
    <616>   DW_AT_data_member_location: 16
 <2><617>: Abbrev Number: 2 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x64195): HwFlowCtl
    <61c>   DW_AT_decl_file   : 9
    <61d>   DW_AT_decl_line   : 82
    <61e>   DW_AT_decl_column : 12
    <61f>   DW_AT_type        : <0x111>
    <623>   DW_AT_data_member_location: 20
 <2><624>: Abbrev Number: 2 (DW_TAG_member)
    <625>   DW_AT_name        : (indirect string, offset: 0x2702): OverSampling
    <629>   DW_AT_decl_file   : 9
    <62a>   DW_AT_decl_line   : 86
    <62b>   DW_AT_decl_column : 12
    <62c>   DW_AT_type        : <0x111>
    <630>   DW_AT_data_member_location: 24
 <2><631>: Abbrev Number: 2 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x225a2): OneBitSampling
    <636>   DW_AT_decl_file   : 9
    <637>   DW_AT_decl_line   : 90
    <638>   DW_AT_decl_column : 12
    <639>   DW_AT_type        : <0x111>
    <63d>   DW_AT_data_member_location: 28
 <2><63e>: Abbrev Number: 2 (DW_TAG_member)
    <63f>   DW_AT_name        : (indirect string, offset: 0x94ea5): ClockPrescaler
    <643>   DW_AT_decl_file   : 9
    <644>   DW_AT_decl_line   : 94
    <645>   DW_AT_decl_column : 12
    <646>   DW_AT_type        : <0x111>
    <64a>   DW_AT_data_member_location: 32
 <2><64b>: Abbrev Number: 0
 <1><64c>: Abbrev Number: 5 (DW_TAG_typedef)
    <64d>   DW_AT_name        : (indirect string, offset: 0x2f430): UART_InitTypeDef
    <651>   DW_AT_decl_file   : 9
    <652>   DW_AT_decl_line   : 97
    <653>   DW_AT_decl_column : 3
    <654>   DW_AT_type        : <0x5ce>
 <1><658>: Abbrev Number: 16 (DW_TAG_structure_type)
    <659>   DW_AT_byte_size   : 40
    <65a>   DW_AT_decl_file   : 9
    <65b>   DW_AT_decl_line   : 102
    <65c>   DW_AT_decl_column : 9
    <65c>   DW_AT_sibling     : <0x6e3>
 <2><660>: Abbrev Number: 2 (DW_TAG_member)
    <661>   DW_AT_name        : (indirect string, offset: 0x2126a): AdvFeatureInit
    <665>   DW_AT_decl_file   : 9
    <666>   DW_AT_decl_line   : 104
    <667>   DW_AT_decl_column : 12
    <668>   DW_AT_type        : <0x111>
    <66c>   DW_AT_data_member_location: 0
 <2><66d>: Abbrev Number: 2 (DW_TAG_member)
    <66e>   DW_AT_name        : (indirect string, offset: 0xeff7): TxPinLevelInvert
    <672>   DW_AT_decl_file   : 9
    <673>   DW_AT_decl_line   : 109
    <674>   DW_AT_decl_column : 12
    <675>   DW_AT_type        : <0x111>
    <679>   DW_AT_data_member_location: 4
 <2><67a>: Abbrev Number: 2 (DW_TAG_member)
    <67b>   DW_AT_name        : (indirect string, offset: 0x8e147): RxPinLevelInvert
    <67f>   DW_AT_decl_file   : 9
    <680>   DW_AT_decl_line   : 112
    <681>   DW_AT_decl_column : 12
    <682>   DW_AT_type        : <0x111>
    <686>   DW_AT_data_member_location: 8
 <2><687>: Abbrev Number: 2 (DW_TAG_member)
    <688>   DW_AT_name        : (indirect string, offset: 0x71704): DataInvert
    <68c>   DW_AT_decl_file   : 9
    <68d>   DW_AT_decl_line   : 115
    <68e>   DW_AT_decl_column : 12
    <68f>   DW_AT_type        : <0x111>
    <693>   DW_AT_data_member_location: 12
 <2><694>: Abbrev Number: 2 (DW_TAG_member)
    <695>   DW_AT_name        : (indirect string, offset: 0x35786): Swap
    <699>   DW_AT_decl_file   : 9
    <69a>   DW_AT_decl_line   : 119
    <69b>   DW_AT_decl_column : 12
    <69c>   DW_AT_type        : <0x111>
    <6a0>   DW_AT_data_member_location: 16
 <2><6a1>: Abbrev Number: 2 (DW_TAG_member)
    <6a2>   DW_AT_name        : (indirect string, offset: 0x2149a): OverrunDisable
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 122
    <6a8>   DW_AT_decl_column : 12
    <6a9>   DW_AT_type        : <0x111>
    <6ad>   DW_AT_data_member_location: 20
 <2><6ae>: Abbrev Number: 2 (DW_TAG_member)
    <6af>   DW_AT_name        : (indirect string, offset: 0x5e8b): DMADisableonRxError
    <6b3>   DW_AT_decl_file   : 9
    <6b4>   DW_AT_decl_line   : 125
    <6b5>   DW_AT_decl_column : 12
    <6b6>   DW_AT_type        : <0x111>
    <6ba>   DW_AT_data_member_location: 24
 <2><6bb>: Abbrev Number: 2 (DW_TAG_member)
    <6bc>   DW_AT_name        : (indirect string, offset: 0x49cb4): AutoBaudRateEnable
    <6c0>   DW_AT_decl_file   : 9
    <6c1>   DW_AT_decl_line   : 128
    <6c2>   DW_AT_decl_column : 12
    <6c3>   DW_AT_type        : <0x111>
    <6c7>   DW_AT_data_member_location: 28
 <2><6c8>: Abbrev Number: 2 (DW_TAG_member)
    <6c9>   DW_AT_name        : (indirect string, offset: 0x8f830): AutoBaudRateMode
    <6cd>   DW_AT_decl_file   : 9
    <6ce>   DW_AT_decl_line   : 131
    <6cf>   DW_AT_decl_column : 12
    <6d0>   DW_AT_type        : <0x111>
    <6d4>   DW_AT_data_member_location: 32
 <2><6d5>: Abbrev Number: 2 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x4a9eb): MSBFirst
    <6da>   DW_AT_decl_file   : 9
    <6db>   DW_AT_decl_line   : 135
    <6dc>   DW_AT_decl_column : 12
    <6dd>   DW_AT_type        : <0x111>
    <6e1>   DW_AT_data_member_location: 36
 <2><6e2>: Abbrev Number: 0
 <1><6e3>: Abbrev Number: 5 (DW_TAG_typedef)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x7cdeb): UART_AdvFeatureInitTypeDef
    <6e8>   DW_AT_decl_file   : 9
    <6e9>   DW_AT_decl_line   : 137
    <6ea>   DW_AT_decl_column : 3
    <6eb>   DW_AT_type        : <0x658>
 <1><6ef>: Abbrev Number: 5 (DW_TAG_typedef)
    <6f0>   DW_AT_name        : (indirect string, offset: 0x33296): HAL_UART_StateTypeDef
    <6f4>   DW_AT_decl_file   : 9
    <6f5>   DW_AT_decl_line   : 179
    <6f6>   DW_AT_decl_column : 18
    <6f7>   DW_AT_type        : <0x111>
 <1><6fb>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <6fc>   DW_AT_type        : <0x6ef>
 <1><700>: Abbrev Number: 5 (DW_TAG_typedef)
    <701>   DW_AT_name        : (indirect string, offset: 0x8e268): HAL_UART_RxTypeTypeDef
    <705>   DW_AT_decl_file   : 9
    <706>   DW_AT_decl_line   : 203
    <707>   DW_AT_decl_column : 18
    <708>   DW_AT_type        : <0x111>
 <1><70c>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <70d>   DW_AT_type        : <0x700>
 <1><711>: Abbrev Number: 5 (DW_TAG_typedef)
    <712>   DW_AT_name        : (indirect string, offset: 0x14cbe): HAL_UART_RxEventTypeTypeDef
    <716>   DW_AT_decl_file   : 9
    <717>   DW_AT_decl_line   : 214
    <718>   DW_AT_decl_column : 18
    <719>   DW_AT_type        : <0x111>
 <1><71d>: Abbrev Number: 23 (DW_TAG_volatile_type)
    <71e>   DW_AT_type        : <0x711>
 <1><722>: Abbrev Number: 20 (DW_TAG_structure_type)
    <723>   DW_AT_name        : (indirect string, offset: 0x623bc): __UART_HandleTypeDef
    <727>   DW_AT_byte_size   : 148
    <728>   DW_AT_decl_file   : 9
    <729>   DW_AT_decl_line   : 219
    <72a>   DW_AT_decl_column : 16
    <72b>   DW_AT_sibling     : <0x861>
 <2><72f>: Abbrev Number: 2 (DW_TAG_member)
    <730>   DW_AT_name        : (indirect string, offset: 0x28b05): Instance
    <734>   DW_AT_decl_file   : 9
    <735>   DW_AT_decl_line   : 221
    <736>   DW_AT_decl_column : 29
    <737>   DW_AT_type        : <0x861>
    <73b>   DW_AT_data_member_location: 0
 <2><73c>: Abbrev Number: 2 (DW_TAG_member)
    <73d>   DW_AT_name        : (indirect string, offset: 0xaf143): Init
    <741>   DW_AT_decl_file   : 9
    <742>   DW_AT_decl_line   : 223
    <743>   DW_AT_decl_column : 28
    <744>   DW_AT_type        : <0x64c>
    <748>   DW_AT_data_member_location: 4
 <2><749>: Abbrev Number: 2 (DW_TAG_member)
    <74a>   DW_AT_name        : (indirect string, offset: 0x83396): AdvancedInit
    <74e>   DW_AT_decl_file   : 9
    <74f>   DW_AT_decl_line   : 225
    <750>   DW_AT_decl_column : 30
    <751>   DW_AT_type        : <0x6e3>
    <755>   DW_AT_data_member_location: 40
 <2><756>: Abbrev Number: 2 (DW_TAG_member)
    <757>   DW_AT_name        : (indirect string, offset: 0x50bbd): pTxBuffPtr
    <75b>   DW_AT_decl_file   : 9
    <75c>   DW_AT_decl_line   : 227
    <75d>   DW_AT_decl_column : 29
    <75e>   DW_AT_type        : <0x866>
    <762>   DW_AT_data_member_location: 80
 <2><763>: Abbrev Number: 2 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x4fa9): TxXferSize
    <768>   DW_AT_decl_file   : 9
    <769>   DW_AT_decl_line   : 229
    <76a>   DW_AT_decl_column : 28
    <76b>   DW_AT_type        : <0xf4>
    <76f>   DW_AT_data_member_location: 84
 <2><770>: Abbrev Number: 2 (DW_TAG_member)
    <771>   DW_AT_name        : (indirect string, offset: 0x5cffa): TxXferCount
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 231
    <777>   DW_AT_decl_column : 28
    <778>   DW_AT_type        : <0x100>
    <77c>   DW_AT_data_member_location: 86
 <2><77d>: Abbrev Number: 2 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x9cc73): pRxBuffPtr
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 233
    <784>   DW_AT_decl_column : 29
    <785>   DW_AT_type        : <0x134>
    <789>   DW_AT_data_member_location: 88
 <2><78a>: Abbrev Number: 2 (DW_TAG_member)
    <78b>   DW_AT_name        : (indirect string, offset: 0x540f4): RxXferSize
    <78f>   DW_AT_decl_file   : 9
    <790>   DW_AT_decl_line   : 235
    <791>   DW_AT_decl_column : 28
    <792>   DW_AT_type        : <0xf4>
    <796>   DW_AT_data_member_location: 92
 <2><797>: Abbrev Number: 2 (DW_TAG_member)
    <798>   DW_AT_name        : (indirect string, offset: 0x6591e): RxXferCount
    <79c>   DW_AT_decl_file   : 9
    <79d>   DW_AT_decl_line   : 237
    <79e>   DW_AT_decl_column : 28
    <79f>   DW_AT_type        : <0x100>
    <7a3>   DW_AT_data_member_location: 94
 <2><7a4>: Abbrev Number: 2 (DW_TAG_member)
    <7a5>   DW_AT_name        : (indirect string, offset: 0xbb871): Mask
    <7a9>   DW_AT_decl_file   : 9
    <7aa>   DW_AT_decl_line   : 239
    <7ab>   DW_AT_decl_column : 28
    <7ac>   DW_AT_type        : <0xf4>
    <7b0>   DW_AT_data_member_location: 96
 <2><7b1>: Abbrev Number: 2 (DW_TAG_member)
    <7b2>   DW_AT_name        : (indirect string, offset: 0xae2bf): FifoMode
    <7b6>   DW_AT_decl_file   : 9
    <7b7>   DW_AT_decl_line   : 241
    <7b8>   DW_AT_decl_column : 28
    <7b9>   DW_AT_type        : <0x111>
    <7bd>   DW_AT_data_member_location: 100
 <2><7be>: Abbrev Number: 2 (DW_TAG_member)
    <7bf>   DW_AT_name        : (indirect string, offset: 0x4dd76): NbRxDataToProcess
    <7c3>   DW_AT_decl_file   : 9
    <7c4>   DW_AT_decl_line   : 244
    <7c5>   DW_AT_decl_column : 28
    <7c6>   DW_AT_type        : <0xf4>
    <7ca>   DW_AT_data_member_location: 104
 <2><7cb>: Abbrev Number: 2 (DW_TAG_member)
    <7cc>   DW_AT_name        : (indirect string, offset: 0x28f8c): NbTxDataToProcess
    <7d0>   DW_AT_decl_file   : 9
    <7d1>   DW_AT_decl_line   : 246
    <7d2>   DW_AT_decl_column : 28
    <7d3>   DW_AT_type        : <0xf4>
    <7d7>   DW_AT_data_member_location: 106
 <2><7d8>: Abbrev Number: 2 (DW_TAG_member)
    <7d9>   DW_AT_name        : (indirect string, offset: 0x8d397): ReceptionType
    <7dd>   DW_AT_decl_file   : 9
    <7de>   DW_AT_decl_line   : 248
    <7df>   DW_AT_decl_column : 31
    <7e0>   DW_AT_type        : <0x70c>
    <7e4>   DW_AT_data_member_location: 108
 <2><7e5>: Abbrev Number: 2 (DW_TAG_member)
    <7e6>   DW_AT_name        : (indirect string, offset: 0xb3793): RxEventType
    <7ea>   DW_AT_decl_file   : 9
    <7eb>   DW_AT_decl_line   : 250
    <7ec>   DW_AT_decl_column : 36
    <7ed>   DW_AT_type        : <0x71d>
    <7f1>   DW_AT_data_member_location: 112
 <2><7f2>: Abbrev Number: 2 (DW_TAG_member)
    <7f3>   DW_AT_name        : (indirect string, offset: 0x918b5): RxISR
    <7f7>   DW_AT_decl_file   : 9
    <7f8>   DW_AT_decl_line   : 252
    <7f9>   DW_AT_decl_column : 10
    <7fa>   DW_AT_type        : <0x87b>
    <7fe>   DW_AT_data_member_location: 116
 <2><7ff>: Abbrev Number: 2 (DW_TAG_member)
    <800>   DW_AT_name        : (indirect string, offset: 0x54a1c): TxISR
    <804>   DW_AT_decl_file   : 9
    <805>   DW_AT_decl_line   : 254
    <806>   DW_AT_decl_column : 10
    <807>   DW_AT_type        : <0x87b>
    <80b>   DW_AT_data_member_location: 120
 <2><80c>: Abbrev Number: 4 (DW_TAG_member)
    <80d>   DW_AT_name        : (indirect string, offset: 0x8a5eb): hdmatx
    <811>   DW_AT_decl_file   : 9
    <812>   DW_AT_decl_line   : 256
    <814>   DW_AT_decl_column : 29
    <815>   DW_AT_type        : <0x5c9>
    <819>   DW_AT_data_member_location: 124
 <2><81a>: Abbrev Number: 4 (DW_TAG_member)
    <81b>   DW_AT_name        : (indirect string, offset: 0xa4574): hdmarx
    <81f>   DW_AT_decl_file   : 9
    <820>   DW_AT_decl_line   : 258
    <822>   DW_AT_decl_column : 29
    <823>   DW_AT_type        : <0x5c9>
    <827>   DW_AT_data_member_location: 128
 <2><828>: Abbrev Number: 4 (DW_TAG_member)
    <829>   DW_AT_name        : (indirect string, offset: 0x77bdf): Lock
    <82d>   DW_AT_decl_file   : 9
    <82e>   DW_AT_decl_line   : 260
    <830>   DW_AT_decl_column : 29
    <831>   DW_AT_type        : <0x3aa>
    <835>   DW_AT_data_member_location: 132
 <2><836>: Abbrev Number: 4 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x44b5b): gState
    <83b>   DW_AT_decl_file   : 9
    <83c>   DW_AT_decl_line   : 262
    <83e>   DW_AT_decl_column : 33
    <83f>   DW_AT_type        : <0x6fb>
    <843>   DW_AT_data_member_location: 136
 <2><844>: Abbrev Number: 4 (DW_TAG_member)
    <845>   DW_AT_name        : (indirect string, offset: 0x9859b): RxState
    <849>   DW_AT_decl_file   : 9
    <84a>   DW_AT_decl_line   : 266
    <84c>   DW_AT_decl_column : 33
    <84d>   DW_AT_type        : <0x6fb>
    <851>   DW_AT_data_member_location: 140
 <2><852>: Abbrev Number: 4 (DW_TAG_member)
    <853>   DW_AT_name        : (indirect string, offset: 0xa59f0): ErrorCode
    <857>   DW_AT_decl_file   : 9
    <858>   DW_AT_decl_line   : 269
    <85a>   DW_AT_decl_column : 33
    <85b>   DW_AT_type        : <0x11d>
    <85f>   DW_AT_data_member_location: 144
 <2><860>: Abbrev Number: 0
 <1><861>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <862>   DW_AT_byte_size   : 4
    <862>   DW_AT_type        : <0x34f>
 <1><866>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <867>   DW_AT_byte_size   : 4
    <867>   DW_AT_type        : <0xe3>
 <1><86b>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <86c>   DW_AT_prototyped  : 1
    <86c>   DW_AT_sibling     : <0x876>
 <2><870>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <871>   DW_AT_type        : <0x876>
 <2><875>: Abbrev Number: 0
 <1><876>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <877>   DW_AT_byte_size   : 4
    <877>   DW_AT_type        : <0x722>
 <1><87b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <87c>   DW_AT_byte_size   : 4
    <87c>   DW_AT_type        : <0x86b>
 <1><880>: Abbrev Number: 11 (DW_TAG_typedef)
    <881>   DW_AT_name        : (indirect string, offset: 0x623be): UART_HandleTypeDef
    <885>   DW_AT_decl_file   : 9
    <886>   DW_AT_decl_line   : 289
    <888>   DW_AT_decl_column : 3
    <889>   DW_AT_type        : <0x722>
 <1><88d>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <88e>   DW_AT_encoding    : 5	(signed)
    <88f>   DW_AT_byte_size   : 4
    <890>   DW_AT_type        : <0x2a>
    <894>   DW_AT_decl_file   : 10
    <895>   DW_AT_decl_line   : 82
    <896>   DW_AT_decl_column : 14
    <897>   DW_AT_sibling     : <0x9d9>
 <2><89b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <89c>   DW_AT_name        : (indirect string, offset: 0xbbd87): osPriorityNone
    <8a0>   DW_AT_const_value : 0
 <2><8a1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8a2>   DW_AT_name        : (indirect string, offset: 0x92b6d): osPriorityIdle
    <8a6>   DW_AT_const_value : 1
 <2><8a7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8a8>   DW_AT_name        : (indirect string, offset: 0x9bb8c): osPriorityLow
    <8ac>   DW_AT_const_value : 8
 <2><8ad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ae>   DW_AT_name        : (indirect string, offset: 0xa0bbf): osPriorityLow1
    <8b2>   DW_AT_const_value : 9
 <2><8b3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8b4>   DW_AT_name        : (indirect string, offset: 0xa0bce): osPriorityLow2
    <8b8>   DW_AT_const_value : 10
 <2><8b9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ba>   DW_AT_name        : (indirect string, offset: 0xa0bdd): osPriorityLow3
    <8be>   DW_AT_const_value : 11
 <2><8bf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8c0>   DW_AT_name        : (indirect string, offset: 0xa0bec): osPriorityLow4
    <8c4>   DW_AT_const_value : 12
 <2><8c5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8c6>   DW_AT_name        : (indirect string, offset: 0x3ef63): osPriorityLow5
    <8ca>   DW_AT_const_value : 13
 <2><8cb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8cc>   DW_AT_name        : (indirect string, offset: 0xa0c27): osPriorityLow6
    <8d0>   DW_AT_const_value : 14
 <2><8d1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d2>   DW_AT_name        : (indirect string, offset: 0x25ffa): osPriorityLow7
    <8d6>   DW_AT_const_value : 15
 <2><8d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xa2e4c): osPriorityBelowNormal
    <8dc>   DW_AT_const_value : 16
 <2><8dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8de>   DW_AT_name        : (indirect string, offset: 0x8083b): osPriorityBelowNormal1
    <8e2>   DW_AT_const_value : 17
 <2><8e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e4>   DW_AT_name        : (indirect string, offset: 0x8f515): osPriorityBelowNormal2
    <8e8>   DW_AT_const_value : 18
 <2><8e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x8f52c): osPriorityBelowNormal3
    <8ee>   DW_AT_const_value : 19
 <2><8ef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8f0>   DW_AT_name        : (indirect string, offset: 0x808c2): osPriorityBelowNormal4
    <8f4>   DW_AT_const_value : 20
 <2><8f5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8f6>   DW_AT_name        : (indirect string, offset: 0x80901): osPriorityBelowNormal5
    <8fa>   DW_AT_const_value : 21
 <2><8fb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8fc>   DW_AT_name        : (indirect string, offset: 0x8f5b1): osPriorityBelowNormal6
    <900>   DW_AT_const_value : 22
 <2><901>: Abbrev Number: 1 (DW_TAG_enumerator)
    <902>   DW_AT_name        : (indirect string, offset: 0x8093b): osPriorityBelowNormal7
    <906>   DW_AT_const_value : 23
 <2><907>: Abbrev Number: 1 (DW_TAG_enumerator)
    <908>   DW_AT_name        : (indirect string, offset: 0x541c9): osPriorityNormal
    <90c>   DW_AT_const_value : 24
 <2><90d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <90e>   DW_AT_name        : (indirect string, offset: 0x1ae24): osPriorityNormal1
    <912>   DW_AT_const_value : 25
 <2><913>: Abbrev Number: 1 (DW_TAG_enumerator)
    <914>   DW_AT_name        : (indirect string, offset: 0x1ae36): osPriorityNormal2
    <918>   DW_AT_const_value : 26
 <2><919>: Abbrev Number: 1 (DW_TAG_enumerator)
    <91a>   DW_AT_name        : (indirect string, offset: 0x1ae48): osPriorityNormal3
    <91e>   DW_AT_const_value : 27
 <2><91f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <920>   DW_AT_name        : (indirect string, offset: 0x1ae5a): osPriorityNormal4
    <924>   DW_AT_const_value : 28
 <2><925>: Abbrev Number: 1 (DW_TAG_enumerator)
    <926>   DW_AT_name        : (indirect string, offset: 0x1ae6c): osPriorityNormal5
    <92a>   DW_AT_const_value : 29
 <2><92b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <92c>   DW_AT_name        : (indirect string, offset: 0x1ae7e): osPriorityNormal6
    <930>   DW_AT_const_value : 30
 <2><931>: Abbrev Number: 1 (DW_TAG_enumerator)
    <932>   DW_AT_name        : (indirect string, offset: 0x1ae90): osPriorityNormal7
    <936>   DW_AT_const_value : 31
 <2><937>: Abbrev Number: 1 (DW_TAG_enumerator)
    <938>   DW_AT_name        : (indirect string, offset: 0x6bb4d): osPriorityAboveNormal
    <93c>   DW_AT_const_value : 32
 <2><93d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <93e>   DW_AT_name        : (indirect string, offset: 0xa921b): osPriorityAboveNormal1
    <942>   DW_AT_const_value : 33
 <2><943>: Abbrev Number: 1 (DW_TAG_enumerator)
    <944>   DW_AT_name        : (indirect string, offset: 0x9f4eb): osPriorityAboveNormal2
    <948>   DW_AT_const_value : 34
 <2><949>: Abbrev Number: 1 (DW_TAG_enumerator)
    <94a>   DW_AT_name        : (indirect string, offset: 0xa9252): osPriorityAboveNormal3
    <94e>   DW_AT_const_value : 35
 <2><94f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <950>   DW_AT_name        : (indirect string, offset: 0xa9269): osPriorityAboveNormal4
    <954>   DW_AT_const_value : 36
 <2><955>: Abbrev Number: 1 (DW_TAG_enumerator)
    <956>   DW_AT_name        : (indirect string, offset: 0xa9280): osPriorityAboveNormal5
    <95a>   DW_AT_const_value : 37
 <2><95b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <95c>   DW_AT_name        : (indirect string, offset: 0xa9297): osPriorityAboveNormal6
    <960>   DW_AT_const_value : 38
 <2><961>: Abbrev Number: 1 (DW_TAG_enumerator)
    <962>   DW_AT_name        : (indirect string, offset: 0xa92ae): osPriorityAboveNormal7
    <966>   DW_AT_const_value : 39
 <2><967>: Abbrev Number: 1 (DW_TAG_enumerator)
    <968>   DW_AT_name        : (indirect string, offset: 0x3c4df): osPriorityHigh
    <96c>   DW_AT_const_value : 40
 <2><96d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <96e>   DW_AT_name        : (indirect string, offset: 0x6f42d): osPriorityHigh1
    <972>   DW_AT_const_value : 41
 <2><973>: Abbrev Number: 1 (DW_TAG_enumerator)
    <974>   DW_AT_name        : (indirect string, offset: 0x6f43d): osPriorityHigh2
    <978>   DW_AT_const_value : 42
 <2><979>: Abbrev Number: 1 (DW_TAG_enumerator)
    <97a>   DW_AT_name        : (indirect string, offset: 0x6f44d): osPriorityHigh3
    <97e>   DW_AT_const_value : 43
 <2><97f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <980>   DW_AT_name        : (indirect string, offset: 0x6f45d): osPriorityHigh4
    <984>   DW_AT_const_value : 44
 <2><985>: Abbrev Number: 1 (DW_TAG_enumerator)
    <986>   DW_AT_name        : (indirect string, offset: 0x6f46d): osPriorityHigh5
    <98a>   DW_AT_const_value : 45
 <2><98b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <98c>   DW_AT_name        : (indirect string, offset: 0x6f47d): osPriorityHigh6
    <990>   DW_AT_const_value : 46
 <2><991>: Abbrev Number: 1 (DW_TAG_enumerator)
    <992>   DW_AT_name        : (indirect string, offset: 0x6f48d): osPriorityHigh7
    <996>   DW_AT_const_value : 47
 <2><997>: Abbrev Number: 1 (DW_TAG_enumerator)
    <998>   DW_AT_name        : (indirect string, offset: 0x99417): osPriorityRealtime
    <99c>   DW_AT_const_value : 48
 <2><99d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <99e>   DW_AT_name        : (indirect string, offset: 0x69a74): osPriorityRealtime1
    <9a2>   DW_AT_const_value : 49
 <2><9a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a4>   DW_AT_name        : (indirect string, offset: 0x96335): osPriorityRealtime2
    <9a8>   DW_AT_const_value : 50
 <2><9a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9aa>   DW_AT_name        : (indirect string, offset: 0x69ab6): osPriorityRealtime3
    <9ae>   DW_AT_const_value : 51
 <2><9af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x69aca): osPriorityRealtime4
    <9b4>   DW_AT_const_value : 52
 <2><9b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x69ade): osPriorityRealtime5
    <9ba>   DW_AT_const_value : 53
 <2><9bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x96666): osPriorityRealtime6
    <9c0>   DW_AT_const_value : 54
 <2><9c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x69b08): osPriorityRealtime7
    <9c6>   DW_AT_const_value : 55
 <2><9c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c8>   DW_AT_name        : (indirect string, offset: 0xb54): osPriorityISR
    <9cc>   DW_AT_const_value : 56
 <2><9cd>: Abbrev Number: 21 (DW_TAG_enumerator)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x95284): osPriorityError
    <9d2>   DW_AT_const_value : -1
 <2><9d3>: Abbrev Number: 30 (DW_TAG_enumerator)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xa1038): osPriorityReserved
    <9d8>   DW_AT_const_value : 2147483647
 <2><9d8>: Abbrev Number: 0
 <1><9d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <9da>   DW_AT_name        : (indirect string, offset: 0x37e9c): osPriority_t
    <9de>   DW_AT_decl_file   : 10
    <9df>   DW_AT_decl_line   : 136
    <9e0>   DW_AT_decl_column : 3
    <9e1>   DW_AT_type        : <0x88d>
 <1><9e5>: Abbrev Number: 5 (DW_TAG_typedef)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x903ad): osThreadFunc_t
    <9ea>   DW_AT_decl_file   : 10
    <9eb>   DW_AT_decl_line   : 139
    <9ec>   DW_AT_decl_column : 16
    <9ed>   DW_AT_type        : <0x122>
 <1><9f1>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <9f2>   DW_AT_encoding    : 5	(signed)
    <9f3>   DW_AT_byte_size   : 4
    <9f4>   DW_AT_type        : <0x2a>
    <9f8>   DW_AT_decl_file   : 10
    <9f9>   DW_AT_decl_line   : 176
    <9fa>   DW_AT_decl_column : 14
    <9fb>   DW_AT_sibling     : <0xa2f>
 <2><9ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a00>   DW_AT_name        : (indirect string, offset: 0x95094): osOK
    <a04>   DW_AT_const_value : 0
 <2><a05>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a06>   DW_AT_name        : (indirect string, offset: 0x4de37): osError
    <a0a>   DW_AT_const_value : -1
 <2><a0b>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x6e8ec): osErrorTimeout
    <a10>   DW_AT_const_value : -2
 <2><a11>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a12>   DW_AT_name        : (indirect string, offset: 0x6deaa): osErrorResource
    <a16>   DW_AT_const_value : -3
 <2><a17>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0x2bbf0): osErrorParameter
    <a1c>   DW_AT_const_value : -4
 <2><a1d>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a1e>   DW_AT_name        : (indirect string, offset: 0x1d213): osErrorNoMemory
    <a22>   DW_AT_const_value : -5
 <2><a23>: Abbrev Number: 21 (DW_TAG_enumerator)
    <a24>   DW_AT_name        : (indirect string, offset: 0x2d5cc): osErrorISR
    <a28>   DW_AT_const_value : -6
 <2><a29>: Abbrev Number: 30 (DW_TAG_enumerator)
    <a2a>   DW_AT_name        : (indirect string, offset: 0x33a3e): osStatusReserved
    <a2e>   DW_AT_const_value : 2147483647
 <2><a2e>: Abbrev Number: 0
 <1><a2f>: Abbrev Number: 5 (DW_TAG_typedef)
    <a30>   DW_AT_name        : (indirect string, offset: 0x393bc): osStatus_t
    <a34>   DW_AT_decl_file   : 10
    <a35>   DW_AT_decl_line   : 185
    <a36>   DW_AT_decl_column : 3
    <a37>   DW_AT_type        : <0x9f1>
 <1><a3b>: Abbrev Number: 5 (DW_TAG_typedef)
    <a3c>   DW_AT_name        : (indirect string, offset: 0x3c401): osThreadId_t
    <a40>   DW_AT_decl_file   : 10
    <a41>   DW_AT_decl_line   : 189
    <a42>   DW_AT_decl_column : 15
    <a43>   DW_AT_type        : <0x132>
 <1><a47>: Abbrev Number: 5 (DW_TAG_typedef)
    <a48>   DW_AT_name        : (indirect string, offset: 0x4c240): osMessageQueueId_t
    <a4c>   DW_AT_decl_file   : 10
    <a4d>   DW_AT_decl_line   : 207
    <a4e>   DW_AT_decl_column : 15
    <a4f>   DW_AT_type        : <0x132>
 <1><a53>: Abbrev Number: 5 (DW_TAG_typedef)
    <a54>   DW_AT_name        : (indirect string, offset: 0x70f8d): TZ_ModuleId_t
    <a58>   DW_AT_decl_file   : 10
    <a59>   DW_AT_decl_line   : 213
    <a5a>   DW_AT_decl_column : 18
    <a5b>   DW_AT_type        : <0x111>
 <1><a5f>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a60>   DW_AT_byte_size   : 36
    <a61>   DW_AT_decl_file   : 10
    <a62>   DW_AT_decl_line   : 218
    <a63>   DW_AT_decl_column : 9
    <a63>   DW_AT_sibling     : <0xadd>
 <2><a67>: Abbrev Number: 2 (DW_TAG_member)
    <a68>   DW_AT_name        : (indirect string, offset: 0x70117): name
    <a6c>   DW_AT_decl_file   : 10
    <a6d>   DW_AT_decl_line   : 219
    <a6e>   DW_AT_decl_column : 33
    <a6f>   DW_AT_type        : <0x150>
    <a73>   DW_AT_data_member_location: 0
 <2><a74>: Abbrev Number: 2 (DW_TAG_member)
    <a75>   DW_AT_name        : (indirect string, offset: 0x6ca51): attr_bits
    <a79>   DW_AT_decl_file   : 10
    <a7a>   DW_AT_decl_line   : 220
    <a7b>   DW_AT_decl_column : 28
    <a7c>   DW_AT_type        : <0x111>
    <a80>   DW_AT_data_member_location: 4
 <2><a81>: Abbrev Number: 2 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0x21009): cb_mem
    <a86>   DW_AT_decl_file   : 10
    <a87>   DW_AT_decl_line   : 221
    <a88>   DW_AT_decl_column : 30
    <a89>   DW_AT_type        : <0x132>
    <a8d>   DW_AT_data_member_location: 8
 <2><a8e>: Abbrev Number: 2 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0xa04b3): cb_size
    <a93>   DW_AT_decl_file   : 10
    <a94>   DW_AT_decl_line   : 222
    <a95>   DW_AT_decl_column : 30
    <a96>   DW_AT_type        : <0x111>
    <a9a>   DW_AT_data_member_location: 12
 <2><a9b>: Abbrev Number: 2 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x9997f): stack_mem
    <aa0>   DW_AT_decl_file   : 10
    <aa1>   DW_AT_decl_line   : 223
    <aa2>   DW_AT_decl_column : 27
    <aa3>   DW_AT_type        : <0x132>
    <aa7>   DW_AT_data_member_location: 16
 <2><aa8>: Abbrev Number: 2 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x69b77): stack_size
    <aad>   DW_AT_decl_file   : 10
    <aae>   DW_AT_decl_line   : 224
    <aaf>   DW_AT_decl_column : 27
    <ab0>   DW_AT_type        : <0x111>
    <ab4>   DW_AT_data_member_location: 20
 <2><ab5>: Abbrev Number: 2 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x43173): priority
    <aba>   DW_AT_decl_file   : 10
    <abb>   DW_AT_decl_line   : 225
    <abc>   DW_AT_decl_column : 29
    <abd>   DW_AT_type        : <0x9d9>
    <ac1>   DW_AT_data_member_location: 24
 <2><ac2>: Abbrev Number: 2 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0x496da): tz_module
    <ac7>   DW_AT_decl_file   : 10
    <ac8>   DW_AT_decl_line   : 226
    <ac9>   DW_AT_decl_column : 28
    <aca>   DW_AT_type        : <0xa53>
    <ace>   DW_AT_data_member_location: 28
 <2><acf>: Abbrev Number: 2 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x97bde): reserved
    <ad4>   DW_AT_decl_file   : 10
    <ad5>   DW_AT_decl_line   : 227
    <ad6>   DW_AT_decl_column : 29
    <ad7>   DW_AT_type        : <0x111>
    <adb>   DW_AT_data_member_location: 32
 <2><adc>: Abbrev Number: 0
 <1><add>: Abbrev Number: 5 (DW_TAG_typedef)
    <ade>   DW_AT_name        : (indirect string, offset: 0x1acbe): osThreadAttr_t
    <ae2>   DW_AT_decl_file   : 10
    <ae3>   DW_AT_decl_line   : 228
    <ae4>   DW_AT_decl_column : 3
    <ae5>   DW_AT_type        : <0xa5f>
 <1><ae9>: Abbrev Number: 19 (DW_TAG_const_type)
    <aea>   DW_AT_type        : <0xadd>
 <1><aee>: Abbrev Number: 15 (DW_TAG_structure_type)
    <aef>   DW_AT_byte_size   : 24
    <af0>   DW_AT_decl_file   : 10
    <af1>   DW_AT_decl_line   : 273
    <af3>   DW_AT_decl_column : 9
    <af3>   DW_AT_sibling     : <0xb4c>
 <2><af7>: Abbrev Number: 4 (DW_TAG_member)
    <af8>   DW_AT_name        : (indirect string, offset: 0x70117): name
    <afc>   DW_AT_decl_file   : 10
    <afd>   DW_AT_decl_line   : 274
    <aff>   DW_AT_decl_column : 33
    <b00>   DW_AT_type        : <0x150>
    <b04>   DW_AT_data_member_location: 0
 <2><b05>: Abbrev Number: 4 (DW_TAG_member)
    <b06>   DW_AT_name        : (indirect string, offset: 0x6ca51): attr_bits
    <b0a>   DW_AT_decl_file   : 10
    <b0b>   DW_AT_decl_line   : 275
    <b0d>   DW_AT_decl_column : 28
    <b0e>   DW_AT_type        : <0x111>
    <b12>   DW_AT_data_member_location: 4
 <2><b13>: Abbrev Number: 4 (DW_TAG_member)
    <b14>   DW_AT_name        : (indirect string, offset: 0x21009): cb_mem
    <b18>   DW_AT_decl_file   : 10
    <b19>   DW_AT_decl_line   : 276
    <b1b>   DW_AT_decl_column : 30
    <b1c>   DW_AT_type        : <0x132>
    <b20>   DW_AT_data_member_location: 8
 <2><b21>: Abbrev Number: 4 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0xa04b3): cb_size
    <b26>   DW_AT_decl_file   : 10
    <b27>   DW_AT_decl_line   : 277
    <b29>   DW_AT_decl_column : 30
    <b2a>   DW_AT_type        : <0x111>
    <b2e>   DW_AT_data_member_location: 12
 <2><b2f>: Abbrev Number: 4 (DW_TAG_member)
    <b30>   DW_AT_name        : (indirect string, offset: 0x42b84): mq_mem
    <b34>   DW_AT_decl_file   : 10
    <b35>   DW_AT_decl_line   : 278
    <b37>   DW_AT_decl_column : 30
    <b38>   DW_AT_type        : <0x132>
    <b3c>   DW_AT_data_member_location: 16
 <2><b3d>: Abbrev Number: 4 (DW_TAG_member)
    <b3e>   DW_AT_name        : (indirect string, offset: 0x96b12): mq_size
    <b42>   DW_AT_decl_file   : 10
    <b43>   DW_AT_decl_line   : 279
    <b45>   DW_AT_decl_column : 30
    <b46>   DW_AT_type        : <0x111>
    <b4a>   DW_AT_data_member_location: 20
 <2><b4b>: Abbrev Number: 0
 <1><b4c>: Abbrev Number: 11 (DW_TAG_typedef)
    <b4d>   DW_AT_name        : (indirect string, offset: 0x902cf): osMessageQueueAttr_t
    <b51>   DW_AT_decl_file   : 10
    <b52>   DW_AT_decl_line   : 280
    <b54>   DW_AT_decl_column : 3
    <b55>   DW_AT_type        : <0xaee>
 <1><b59>: Abbrev Number: 19 (DW_TAG_const_type)
    <b5a>   DW_AT_type        : <0xb4c>
 <1><b5e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b5f>   DW_AT_byte_size   : 4
    <b5f>   DW_AT_type        : <0xb63>
 <1><b63>: Abbrev Number: 40 (DW_TAG_const_type)
 <1><b64>: Abbrev Number: 41 (DW_TAG_variable)
    <b65>   DW_AT_name        : (indirect string, offset: 0x5b0b1): huart1
    <b69>   DW_AT_decl_file   : 15
    <b6a>   DW_AT_decl_line   : 35
    <b6b>   DW_AT_decl_column : 27
    <b6c>   DW_AT_type        : <0x880>
    <b70>   DW_AT_external    : 1
    <b70>   DW_AT_declaration : 1
 <1><b70>: Abbrev Number: 24 (DW_TAG_enumeration_type)
    <b71>   DW_AT_name        : (indirect string, offset: 0x8d708): radio_status_e
    <b75>   DW_AT_encoding    : 7	(unsigned)
    <b75>   DW_AT_byte_size   : 1
    <b75>   DW_AT_type        : <0x71>
    <b79>   DW_AT_decl_file   : 11
    <b7a>   DW_AT_decl_line   : 52
    <b7b>   DW_AT_decl_column : 14
    <b7b>   DW_AT_sibling     : <0xb98>
 <2><b7f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b80>   DW_AT_name        : (indirect string, offset: 0x67443): RADIO_STATUS_OK
    <b84>   DW_AT_const_value : 0
 <2><b85>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b86>   DW_AT_name        : (indirect string, offset: 0x7a20): RADIO_STATUS_UNSUPPORTED_FEATURE
    <b8a>   DW_AT_const_value : 1
 <2><b8b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b8c>   DW_AT_name        : (indirect string, offset: 0x123a2): RADIO_STATUS_UNKNOWN_VALUE
    <b90>   DW_AT_const_value : 2
 <2><b91>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b92>   DW_AT_name        : (indirect string, offset: 0xa4190): RADIO_STATUS_ERROR
    <b96>   DW_AT_const_value : 3
 <2><b97>: Abbrev Number: 0
 <1><b98>: Abbrev Number: 5 (DW_TAG_typedef)
    <b99>   DW_AT_name        : (indirect string, offset: 0x8d888): radio_status_t
    <b9d>   DW_AT_decl_file   : 11
    <b9e>   DW_AT_decl_line   : 58
    <b9f>   DW_AT_decl_column : 3
    <ba0>   DW_AT_type        : <0xb70>
 <1><ba4>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <ba5>   DW_AT_encoding    : 7	(unsigned)
    <ba6>   DW_AT_byte_size   : 1
    <ba7>   DW_AT_type        : <0x71>
    <bab>   DW_AT_decl_file   : 11
    <bac>   DW_AT_decl_line   : 64
    <bad>   DW_AT_decl_column : 1
    <bae>   DW_AT_sibling     : <0xbd7>
 <2><bb2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x87bab): MODEM_FSK
    <bb7>   DW_AT_const_value : 0
 <2><bb8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x8d5e7): MODEM_LORA
    <bbd>   DW_AT_const_value : 1
 <2><bbe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bbf>   DW_AT_name        : (indirect string, offset: 0x807b6): MODEM_MSK
    <bc3>   DW_AT_const_value : 2
 <2><bc4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc5>   DW_AT_name        : (indirect string, offset: 0x16a73): MODEM_BPSK
    <bc9>   DW_AT_const_value : 3
 <2><bca>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x83be0): MODEM_SIGFOX_TX
    <bcf>   DW_AT_const_value : 4
 <2><bd0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x83293): MODEM_SIGFOX_RX
    <bd5>   DW_AT_const_value : 5
 <2><bd6>: Abbrev Number: 0
 <1><bd7>: Abbrev Number: 5 (DW_TAG_typedef)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x9d417): RadioModems_t
    <bdc>   DW_AT_decl_file   : 11
    <bdd>   DW_AT_decl_line   : 71
    <bde>   DW_AT_decl_column : 2
    <bdf>   DW_AT_type        : <0xba4>
 <1><be3>: Abbrev Number: 16 (DW_TAG_structure_type)
    <be4>   DW_AT_byte_size   : 28
    <be5>   DW_AT_decl_file   : 11
    <be6>   DW_AT_decl_line   : 76
    <be7>   DW_AT_decl_column : 9
    <be7>   DW_AT_sibling     : <0xc47>
 <2><beb>: Abbrev Number: 2 (DW_TAG_member)
    <bec>   DW_AT_name        : (indirect string, offset: 0xbbdae): TxDone
    <bf0>   DW_AT_decl_file   : 11
    <bf1>   DW_AT_decl_line   : 81
    <bf2>   DW_AT_decl_column : 16
    <bf3>   DW_AT_type        : <0x139>
    <bf7>   DW_AT_data_member_location: 0
 <2><bf8>: Abbrev Number: 2 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0xbbdf2): TxTimeout
    <bfd>   DW_AT_decl_file   : 11
    <bfe>   DW_AT_decl_line   : 85
    <bff>   DW_AT_decl_column : 16
    <c00>   DW_AT_type        : <0x139>
    <c04>   DW_AT_data_member_location: 4
 <2><c05>: Abbrev Number: 2 (DW_TAG_member)
    <c06>   DW_AT_name        : (indirect string, offset: 0xbbdb7): RxDone
    <c0a>   DW_AT_decl_file   : 11
    <c0b>   DW_AT_decl_line   : 96
    <c0c>   DW_AT_decl_column : 16
    <c0d>   DW_AT_type        : <0xc61>
    <c11>   DW_AT_data_member_location: 8
 <2><c12>: Abbrev Number: 2 (DW_TAG_member)
    <c13>   DW_AT_name        : (indirect string, offset: 0xbbda2): RxTimeout
    <c17>   DW_AT_decl_file   : 11
    <c18>   DW_AT_decl_line   : 100
    <c19>   DW_AT_decl_column : 16
    <c1a>   DW_AT_type        : <0x139>
    <c1e>   DW_AT_data_member_location: 12
 <2><c1f>: Abbrev Number: 2 (DW_TAG_member)
    <c20>   DW_AT_name        : (indirect string, offset: 0xbbd98): RxError
    <c24>   DW_AT_decl_file   : 11
    <c25>   DW_AT_decl_line   : 104
    <c26>   DW_AT_decl_column : 16
    <c27>   DW_AT_type        : <0x139>
    <c2b>   DW_AT_data_member_location: 16
 <2><c2c>: Abbrev Number: 2 (DW_TAG_member)
    <c2d>   DW_AT_name        : (indirect string, offset: 0x55a26): FhssChangeChannel
    <c31>   DW_AT_decl_file   : 11
    <c32>   DW_AT_decl_line   : 110
    <c33>   DW_AT_decl_column : 13
    <c34>   DW_AT_type        : <0xc71>
    <c38>   DW_AT_data_member_location: 20
 <2><c39>: Abbrev Number: 2 (DW_TAG_member)
    <c3a>   DW_AT_name        : (indirect string, offset: 0x44b09): CadDone
    <c3e>   DW_AT_decl_file   : 11
    <c3f>   DW_AT_decl_line   : 116
    <c40>   DW_AT_decl_column : 13
    <c41>   DW_AT_type        : <0xc88>
    <c45>   DW_AT_data_member_location: 24
 <2><c46>: Abbrev Number: 0
 <1><c47>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <c48>   DW_AT_prototyped  : 1
    <c48>   DW_AT_sibling     : <0xc61>
 <2><c4c>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c4d>   DW_AT_type        : <0x134>
 <2><c51>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c52>   DW_AT_type        : <0xf4>
 <2><c56>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c57>   DW_AT_type        : <0xe8>
 <2><c5b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c5c>   DW_AT_type        : <0xcb>
 <2><c60>: Abbrev Number: 0
 <1><c61>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c62>   DW_AT_byte_size   : 4
    <c62>   DW_AT_type        : <0xc47>
 <1><c66>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <c67>   DW_AT_prototyped  : 1
    <c67>   DW_AT_sibling     : <0xc71>
 <2><c6b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c6c>   DW_AT_type        : <0xd7>
 <2><c70>: Abbrev Number: 0
 <1><c71>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c72>   DW_AT_byte_size   : 4
    <c72>   DW_AT_type        : <0xc66>
 <1><c76>: Abbrev Number: 8 (DW_TAG_subroutine_type)
    <c77>   DW_AT_prototyped  : 1
    <c77>   DW_AT_sibling     : <0xc81>
 <2><c7b>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <c7c>   DW_AT_type        : <0xc81>
 <2><c80>: Abbrev Number: 0
 <1><c81>: Abbrev Number: 12 (DW_TAG_base_type)
    <c82>   DW_AT_byte_size   : 1
    <c83>   DW_AT_encoding    : 2	(boolean)
    <c84>   DW_AT_name        : (indirect string, offset: 0x3b397): _Bool
 <1><c88>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c89>   DW_AT_byte_size   : 4
    <c89>   DW_AT_type        : <0xc76>
 <1><c8d>: Abbrev Number: 5 (DW_TAG_typedef)
    <c8e>   DW_AT_name        : (indirect string, offset: 0x6523e): RadioEvents_t
    <c92>   DW_AT_decl_file   : 11
    <c93>   DW_AT_decl_line   : 117
    <c94>   DW_AT_decl_column : 2
    <c95>   DW_AT_type        : <0xbe3>
 <1><c99>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <c9a>   DW_AT_encoding    : 7	(unsigned)
    <c9b>   DW_AT_byte_size   : 1
    <c9c>   DW_AT_type        : <0x71>
    <ca0>   DW_AT_decl_file   : 12
    <ca1>   DW_AT_decl_line   : 31
    <ca2>   DW_AT_decl_column : 1
    <ca3>   DW_AT_sibling     : <0xcc0>
 <2><ca7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ca8>   DW_AT_name        : (indirect string, offset: 0x30354): GENERIC_FSK
    <cac>   DW_AT_const_value : 0
 <2><cad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cae>   DW_AT_name        : (indirect string, offset: 0x54720): GENERIC_LORA
    <cb2>   DW_AT_const_value : 1
 <2><cb3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cb4>   DW_AT_name        : (indirect string, offset: 0x86cf6): GENERIC_BPSK
    <cb8>   DW_AT_const_value : 2
 <2><cb9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cba>   DW_AT_name        : (indirect string, offset: 0x29eb5): GENERIC_MSK
    <cbe>   DW_AT_const_value : 3
 <2><cbf>: Abbrev Number: 0
 <1><cc0>: Abbrev Number: 5 (DW_TAG_typedef)
    <cc1>   DW_AT_name        : (indirect string, offset: 0x36379): GenericModems_t
    <cc5>   DW_AT_decl_file   : 12
    <cc6>   DW_AT_decl_line   : 36
    <cc7>   DW_AT_decl_column : 2
    <cc8>   DW_AT_type        : <0xc99>
 <1><ccc>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <ccd>   DW_AT_encoding    : 7	(unsigned)
    <cce>   DW_AT_byte_size   : 1
    <ccf>   DW_AT_type        : <0x71>
    <cd3>   DW_AT_decl_file   : 12
    <cd4>   DW_AT_decl_line   : 42
    <cd5>   DW_AT_decl_column : 1
    <cd6>   DW_AT_sibling     : <0xd0b>
 <2><cda>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cdb>   DW_AT_name        : (indirect string, offset: 0x6260f): RADIO_LORA_SF5
    <cdf>   DW_AT_const_value : 5
 <2><ce0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ce1>   DW_AT_name        : (indirect string, offset: 0x675fb): RADIO_LORA_SF6
    <ce5>   DW_AT_const_value : 6
 <2><ce6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x62762): RADIO_LORA_SF7
    <ceb>   DW_AT_const_value : 7
 <2><cec>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ced>   DW_AT_name        : (indirect string, offset: 0x67634): RADIO_LORA_SF8
    <cf1>   DW_AT_const_value : 8
 <2><cf2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cf3>   DW_AT_name        : (indirect string, offset: 0x67643): RADIO_LORA_SF9
    <cf7>   DW_AT_const_value : 9
 <2><cf8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cf9>   DW_AT_name        : (indirect string, offset: 0x79236): RADIO_LORA_SF10
    <cfd>   DW_AT_const_value : 10
 <2><cfe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <cff>   DW_AT_name        : (indirect string, offset: 0x79246): RADIO_LORA_SF11
    <d03>   DW_AT_const_value : 11
 <2><d04>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d05>   DW_AT_name        : (indirect string, offset: 0x981a): RADIO_LORA_SF12
    <d09>   DW_AT_const_value : 12
 <2><d0a>: Abbrev Number: 0
 <1><d0b>: Abbrev Number: 5 (DW_TAG_typedef)
    <d0c>   DW_AT_name        : (indirect string, offset: 0xfbfb): RADIO_LoRaSpreadingFactors_t
    <d10>   DW_AT_decl_file   : 12
    <d11>   DW_AT_decl_line   : 51
    <d12>   DW_AT_decl_column : 2
    <d13>   DW_AT_type        : <0xccc>
 <1><d17>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <d18>   DW_AT_encoding    : 7	(unsigned)
    <d19>   DW_AT_byte_size   : 1
    <d1a>   DW_AT_type        : <0x71>
    <d1e>   DW_AT_decl_file   : 12
    <d1f>   DW_AT_decl_line   : 57
    <d20>   DW_AT_decl_column : 1
    <d21>   DW_AT_sibling     : <0xd3e>
 <2><d25>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d26>   DW_AT_name        : (indirect string, offset: 0x74fe3): RADIO_LORA_CR_4_5
    <d2a>   DW_AT_const_value : 1
 <2><d2b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x74ff5): RADIO_LORA_CR_4_6
    <d30>   DW_AT_const_value : 2
 <2><d31>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d32>   DW_AT_name        : (indirect string, offset: 0x75007): RADIO_LORA_CR_4_7
    <d36>   DW_AT_const_value : 3
 <2><d37>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d38>   DW_AT_name        : (indirect string, offset: 0x75019): RADIO_LORA_CR_4_8
    <d3c>   DW_AT_const_value : 4
 <2><d3d>: Abbrev Number: 0
 <1><d3e>: Abbrev Number: 5 (DW_TAG_typedef)
    <d3f>   DW_AT_name        : (indirect string, offset: 0x4a2b0): RADIO_LoRaCodingRates_t
    <d43>   DW_AT_decl_file   : 12
    <d44>   DW_AT_decl_line   : 62
    <d45>   DW_AT_decl_column : 2
    <d46>   DW_AT_type        : <0xd17>
 <1><d4a>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <d4b>   DW_AT_encoding    : 7	(unsigned)
    <d4c>   DW_AT_byte_size   : 1
    <d4d>   DW_AT_type        : <0x71>
    <d51>   DW_AT_decl_file   : 12
    <d52>   DW_AT_decl_line   : 68
    <d53>   DW_AT_decl_column : 1
    <d54>   DW_AT_sibling     : <0xd95>
 <2><d58>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d59>   DW_AT_name        : (indirect string, offset: 0x9d2b3): RADIO_LORA_BW_500
    <d5d>   DW_AT_const_value : 6
 <2><d5e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d5f>   DW_AT_name        : (indirect string, offset: 0x5957a): RADIO_LORA_BW_250
    <d63>   DW_AT_const_value : 5
 <2><d64>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d65>   DW_AT_name        : (indirect string, offset: 0x410b4): RADIO_LORA_BW_125
    <d69>   DW_AT_const_value : 4
 <2><d6a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x2b02d): RADIO_LORA_BW_062
    <d6f>   DW_AT_const_value : 3
 <2><d70>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d71>   DW_AT_name        : (indirect string, offset: 0xcf24): RADIO_LORA_BW_041
    <d75>   DW_AT_const_value : 10
 <2><d76>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d77>   DW_AT_name        : (indirect string, offset: 0x2a1b7): RADIO_LORA_BW_031
    <d7b>   DW_AT_const_value : 2
 <2><d7c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d7d>   DW_AT_name        : (indirect string, offset: 0x29d04): RADIO_LORA_BW_020
    <d81>   DW_AT_const_value : 9
 <2><d82>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d83>   DW_AT_name        : (indirect string, offset: 0x298ae): RADIO_LORA_BW_015
    <d87>   DW_AT_const_value : 1
 <2><d88>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d89>   DW_AT_name        : (indirect string, offset: 0x29836): RADIO_LORA_BW_010
    <d8d>   DW_AT_const_value : 8
 <2><d8e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d8f>   DW_AT_name        : (indirect string, offset: 0x2930d): RADIO_LORA_BW_007
    <d93>   DW_AT_const_value : 0
 <2><d94>: Abbrev Number: 0
 <1><d95>: Abbrev Number: 5 (DW_TAG_typedef)
    <d96>   DW_AT_name        : (indirect string, offset: 0x78b4e): RADIO_LoRaBandwidths_t
    <d9a>   DW_AT_decl_file   : 12
    <d9b>   DW_AT_decl_line   : 79
    <d9c>   DW_AT_decl_column : 2
    <d9d>   DW_AT_type        : <0xd4a>
 <1><da1>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <da2>   DW_AT_encoding    : 7	(unsigned)
    <da3>   DW_AT_byte_size   : 1
    <da4>   DW_AT_type        : <0x71>
    <da8>   DW_AT_decl_file   : 12
    <da9>   DW_AT_decl_line   : 85
    <daa>   DW_AT_decl_column : 1
    <dab>   DW_AT_sibling     : <0xdc8>
 <2><daf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db0>   DW_AT_name        : (indirect string, offset: 0x98e9b): RADIO_LORA_PACKET_VARIABLE_LENGTH
    <db4>   DW_AT_const_value : 0
 <2><db5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db6>   DW_AT_name        : (indirect string, offset: 0x8f631): RADIO_LORA_PACKET_FIXED_LENGTH
    <dba>   DW_AT_const_value : 1
 <2><dbb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dbc>   DW_AT_name        : (indirect string, offset: 0x45a93): RADIO_LORA_PACKET_EXPLICIT
    <dc0>   DW_AT_const_value : 0
 <2><dc1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dc2>   DW_AT_name        : (indirect string, offset: 0x3c64c): RADIO_LORA_PACKET_IMPLICIT
    <dc6>   DW_AT_const_value : 1
 <2><dc7>: Abbrev Number: 0
 <1><dc8>: Abbrev Number: 5 (DW_TAG_typedef)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x4dfe): RADIO_LoRaPacketLengthsMode_t
    <dcd>   DW_AT_decl_file   : 12
    <dce>   DW_AT_decl_line   : 90
    <dcf>   DW_AT_decl_column : 2
    <dd0>   DW_AT_type        : <0xda1>
 <1><dd4>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <dd5>   DW_AT_encoding    : 7	(unsigned)
    <dd6>   DW_AT_byte_size   : 1
    <dd7>   DW_AT_type        : <0x71>
    <ddb>   DW_AT_decl_file   : 12
    <ddc>   DW_AT_decl_line   : 96
    <ddd>   DW_AT_decl_column : 1
    <dde>   DW_AT_sibling     : <0xdef>
 <2><de2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de3>   DW_AT_name        : (indirect string, offset: 0x4513f): RADIO_LORA_CRC_ON
    <de7>   DW_AT_const_value : 1
 <2><de8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de9>   DW_AT_name        : (indirect string, offset: 0x73a7): RADIO_LORA_CRC_OFF
    <ded>   DW_AT_const_value : 0
 <2><dee>: Abbrev Number: 0
 <1><def>: Abbrev Number: 5 (DW_TAG_typedef)
    <df0>   DW_AT_name        : (indirect string, offset: 0x6ecae): RADIO_LoRaCrcModes_t
    <df4>   DW_AT_decl_file   : 12
    <df5>   DW_AT_decl_line   : 99
    <df6>   DW_AT_decl_column : 2
    <df7>   DW_AT_type        : <0xdd4>
 <1><dfb>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <dfc>   DW_AT_encoding    : 7	(unsigned)
    <dfd>   DW_AT_byte_size   : 1
    <dfe>   DW_AT_type        : <0x71>
    <e02>   DW_AT_decl_file   : 12
    <e03>   DW_AT_decl_line   : 105
    <e04>   DW_AT_decl_column : 1
    <e05>   DW_AT_sibling     : <0xe16>
 <2><e09>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x4551c): RADIO_LORA_IQ_NORMAL
    <e0e>   DW_AT_const_value : 0
 <2><e0f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e10>   DW_AT_name        : (indirect string, offset: 0xa9b46): RADIO_LORA_IQ_INVERTED
    <e14>   DW_AT_const_value : 1
 <2><e15>: Abbrev Number: 0
 <1><e16>: Abbrev Number: 5 (DW_TAG_typedef)
    <e17>   DW_AT_name        : (indirect string, offset: 0xd3ca): RADIO_LoRaIQModes_t
    <e1b>   DW_AT_decl_file   : 12
    <e1c>   DW_AT_decl_line   : 108
    <e1d>   DW_AT_decl_column : 2
    <e1e>   DW_AT_type        : <0xdfb>
 <1><e22>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <e23>   DW_AT_encoding    : 7	(unsigned)
    <e24>   DW_AT_byte_size   : 1
    <e25>   DW_AT_type        : <0x71>
    <e29>   DW_AT_decl_file   : 12
    <e2a>   DW_AT_decl_line   : 114
    <e2b>   DW_AT_decl_column : 1
    <e2c>   DW_AT_sibling     : <0xe43>
 <2><e30>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e31>   DW_AT_name        : (indirect string, offset: 0x3a2da): RADIO_LORA_LOWDR_OPT_OFF
    <e35>   DW_AT_const_value : 0
 <2><e36>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e37>   DW_AT_name        : (indirect string, offset: 0xbfc3): RADIO_LORA_LOWDR_OPT_ON
    <e3b>   DW_AT_const_value : 1
 <2><e3c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x9661): RADIO_LORA_LOWDR_OPT_AUTO
    <e41>   DW_AT_const_value : 2
 <2><e42>: Abbrev Number: 0
 <1><e43>: Abbrev Number: 5 (DW_TAG_typedef)
    <e44>   DW_AT_name        : (indirect string, offset: 0x30ce8): RADIO_Ld_Opt_t
    <e48>   DW_AT_decl_file   : 12
    <e49>   DW_AT_decl_line   : 118
    <e4a>   DW_AT_decl_column : 2
    <e4b>   DW_AT_type        : <0xe22>
 <1><e4f>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <e50>   DW_AT_encoding    : 7	(unsigned)
    <e51>   DW_AT_byte_size   : 1
    <e52>   DW_AT_type        : <0x71>
    <e56>   DW_AT_decl_file   : 12
    <e57>   DW_AT_decl_line   : 126
    <e58>   DW_AT_decl_column : 1
    <e59>   DW_AT_sibling     : <0xe7c>
 <2><e5d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x52f6a): RADIO_FSK_MOD_SHAPING_OFF
    <e62>   DW_AT_const_value : 0
 <2><e63>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e64>   DW_AT_name        : (indirect string, offset: 0x30112): RADIO_FSK_MOD_SHAPING_G_BT_03
    <e68>   DW_AT_const_value : 8
 <2><e69>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x65b91): RADIO_FSK_MOD_SHAPING_G_BT_05
    <e6e>   DW_AT_const_value : 9
 <2><e6f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e70>   DW_AT_name        : (indirect string, offset: 0x301ad): RADIO_FSK_MOD_SHAPING_G_BT_07
    <e74>   DW_AT_const_value : 10
 <2><e75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e76>   DW_AT_name        : (indirect string, offset: 0x49b76): RADIO_FSK_MOD_SHAPING_G_BT_1
    <e7a>   DW_AT_const_value : 11
 <2><e7b>: Abbrev Number: 0
 <1><e7c>: Abbrev Number: 5 (DW_TAG_typedef)
    <e7d>   DW_AT_name        : (indirect string, offset: 0x319ec): RADIO_FSK_ModShapings_t
    <e81>   DW_AT_decl_file   : 12
    <e82>   DW_AT_decl_line   : 132
    <e83>   DW_AT_decl_column : 2
    <e84>   DW_AT_type        : <0xe4f>
 <1><e88>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <e89>   DW_AT_encoding    : 7	(unsigned)
    <e8a>   DW_AT_byte_size   : 1
    <e8b>   DW_AT_type        : <0x71>
    <e8f>   DW_AT_decl_file   : 12
    <e90>   DW_AT_decl_line   : 138
    <e91>   DW_AT_decl_column : 1
    <e92>   DW_AT_sibling     : <0xeb5>
 <2><e96>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e97>   DW_AT_name        : (indirect string, offset: 0x67b81): RADIO_FSK_PREAMBLE_DETECTOR_OFF
    <e9b>   DW_AT_const_value : 0
 <2><e9c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e9d>   DW_AT_name        : (indirect string, offset: 0x8de6d): RADIO_FSK_PREAMBLE_DETECTOR_08_BITS
    <ea1>   DW_AT_const_value : 4
 <2><ea2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x3b6be): RADIO_FSK_PREAMBLE_DETECTOR_16_BITS
    <ea7>   DW_AT_const_value : 5
 <2><ea8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x6f088): RADIO_FSK_PREAMBLE_DETECTOR_24_BITS
    <ead>   DW_AT_const_value : 6
 <2><eae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eaf>   DW_AT_name        : (indirect string, offset: 0x47d24): RADIO_FSK_PREAMBLE_DETECTOR_32_BITS
    <eb3>   DW_AT_const_value : 7
 <2><eb4>: Abbrev Number: 0
 <1><eb5>: Abbrev Number: 5 (DW_TAG_typedef)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x1c3e7): RADIO_FSK_PreambleDetection_t
    <eba>   DW_AT_decl_file   : 12
    <ebb>   DW_AT_decl_line   : 144
    <ebc>   DW_AT_decl_column : 2
    <ebd>   DW_AT_type        : <0xe88>
 <1><ec1>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <ec2>   DW_AT_encoding    : 7	(unsigned)
    <ec3>   DW_AT_byte_size   : 1
    <ec4>   DW_AT_type        : <0x71>
    <ec8>   DW_AT_decl_file   : 12
    <ec9>   DW_AT_decl_line   : 150
    <eca>   DW_AT_decl_column : 1
    <ecb>   DW_AT_sibling     : <0xee2>
 <2><ecf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed0>   DW_AT_name        : (indirect string, offset: 0x369f7): RADIO_FSK_ADDRESSCOMP_FILT_OFF
    <ed4>   DW_AT_const_value : 0
 <2><ed5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ed6>   DW_AT_name        : (indirect string, offset: 0x4416c): RADIO_FSK_ADDRESSCOMP_FILT_NODE
    <eda>   DW_AT_const_value : 1
 <2><edb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <edc>   DW_AT_name        : (indirect string, offset: 0x8d61e): RADIO_FSK_ADDRESSCOMP_FILT_NODE_BROAD
    <ee0>   DW_AT_const_value : 2
 <2><ee1>: Abbrev Number: 0
 <1><ee2>: Abbrev Number: 5 (DW_TAG_typedef)
    <ee3>   DW_AT_name        : (indirect string, offset: 0x36f39): RADIO_FSK_AddressComp_t
    <ee7>   DW_AT_decl_file   : 12
    <ee8>   DW_AT_decl_line   : 154
    <ee9>   DW_AT_decl_column : 2
    <eea>   DW_AT_type        : <0xec1>
 <1><eee>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <eef>   DW_AT_encoding    : 7	(unsigned)
    <ef0>   DW_AT_byte_size   : 1
    <ef1>   DW_AT_type        : <0x71>
    <ef5>   DW_AT_decl_file   : 12
    <ef6>   DW_AT_decl_line   : 160
    <ef7>   DW_AT_decl_column : 1
    <ef8>   DW_AT_sibling     : <0xf0f>
 <2><efc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <efd>   DW_AT_name        : (indirect string, offset: 0x5857c): RADIO_FSK_PACKET_FIXED_LENGTH
    <f01>   DW_AT_const_value : 0
 <2><f02>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f03>   DW_AT_name        : (indirect string, offset: 0x16067): RADIO_FSK_PACKET_VARIABLE_LENGTH
    <f07>   DW_AT_const_value : 1
 <2><f08>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f09>   DW_AT_name        : (indirect string, offset: 0x108a4): RADIO_FSK_PACKET_2BYTES_LENGTH
    <f0d>   DW_AT_const_value : 2
 <2><f0e>: Abbrev Number: 0
 <1><f0f>: Abbrev Number: 5 (DW_TAG_typedef)
    <f10>   DW_AT_name        : (indirect string, offset: 0x22dab): RADIO_FSK_PacketLengthModes_t
    <f14>   DW_AT_decl_file   : 12
    <f15>   DW_AT_decl_line   : 164
    <f16>   DW_AT_decl_column : 2
    <f17>   DW_AT_type        : <0xeee>
 <1><f1b>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <f1c>   DW_AT_encoding    : 7	(unsigned)
    <f1d>   DW_AT_byte_size   : 1
    <f1e>   DW_AT_type        : <0x71>
    <f22>   DW_AT_decl_file   : 12
    <f23>   DW_AT_decl_line   : 170
    <f24>   DW_AT_decl_column : 1
    <f25>   DW_AT_sibling     : <0xf54>
 <2><f29>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f2a>   DW_AT_name        : (indirect string, offset: 0x7214a): RADIO_FSK_CRC_OFF
    <f2e>   DW_AT_const_value : 1
 <2><f2f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f30>   DW_AT_name        : (indirect string, offset: 0xd5a9): RADIO_FSK_CRC_1_BYTES
    <f34>   DW_AT_const_value : 0
 <2><f35>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f36>   DW_AT_name        : (indirect string, offset: 0x549dd): RADIO_FSK_CRC_2_BYTES
    <f3a>   DW_AT_const_value : 2
 <2><f3b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f3c>   DW_AT_name        : (indirect string, offset: 0x3906f): RADIO_FSK_CRC_1_BYTES_INV
    <f40>   DW_AT_const_value : 4
 <2><f41>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f42>   DW_AT_name        : (indirect string, offset: 0x877c0): RADIO_FSK_CRC_2_BYTES_INV
    <f46>   DW_AT_const_value : 6
 <2><f47>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f48>   DW_AT_name        : (indirect string, offset: 0x82c58): RADIO_FSK_CRC_2_BYTES_IBM
    <f4c>   DW_AT_const_value : 241
 <2><f4d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f4e>   DW_AT_name        : (indirect string, offset: 0x66422): RADIO_FSK_CRC_2_BYTES_CCIT
    <f52>   DW_AT_const_value : 242
 <2><f53>: Abbrev Number: 0
 <1><f54>: Abbrev Number: 5 (DW_TAG_typedef)
    <f55>   DW_AT_name        : (indirect string, offset: 0x5e417): RADIO_FSK_CrcTypes_t
    <f59>   DW_AT_decl_file   : 12
    <f5a>   DW_AT_decl_line   : 178
    <f5b>   DW_AT_decl_column : 2
    <f5c>   DW_AT_type        : <0xf1b>
 <1><f60>: Abbrev Number: 7 (DW_TAG_enumeration_type)
    <f61>   DW_AT_encoding    : 7	(unsigned)
    <f62>   DW_AT_byte_size   : 1
    <f63>   DW_AT_type        : <0x71>
    <f67>   DW_AT_decl_file   : 12
    <f68>   DW_AT_decl_line   : 184
    <f69>   DW_AT_decl_column : 1
    <f6a>   DW_AT_sibling     : <0xf81>
 <2><f6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x8a7c5): RADIO_FSK_DC_FREE_OFF
    <f73>   DW_AT_const_value : 0
 <2><f74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f75>   DW_AT_name        : (indirect string, offset: 0x7001b): RADIO_FSK_DC_FREEWHITENING
    <f79>   DW_AT_const_value : 1
 <2><f7a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x7bfd9): RADIO_FSK_DC_IBM_WHITENING
    <f7f>   DW_AT_const_value : 2
 <2><f80>: Abbrev Number: 0
 <1><f81>: Abbrev Number: 5 (DW_TAG_typedef)
    <f82>   DW_AT_name        : (indirect string, offset: 0x6a227): RADIO_FSK_DcFree_t
    <f86>   DW_AT_decl_file   : 12
    <f87>   DW_AT_decl_line   : 188
    <f88>   DW_AT_decl_column : 2
    <f89>   DW_AT_type        : <0xf60>
 <1><f8d>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f8e>   DW_AT_byte_size   : 16
    <f8f>   DW_AT_decl_file   : 12
    <f90>   DW_AT_decl_line   : 193
    <f91>   DW_AT_decl_column : 9
    <f91>   DW_AT_sibling     : <0x1018>
 <2><f95>: Abbrev Number: 2 (DW_TAG_member)
    <f96>   DW_AT_name        : (indirect string, offset: 0x1d7d7): StopTimerOnPreambleDetect
    <f9a>   DW_AT_decl_file   : 12
    <f9b>   DW_AT_decl_line   : 195
    <f9c>   DW_AT_decl_column : 12
    <f9d>   DW_AT_type        : <0x111>
    <fa1>   DW_AT_data_member_location: 0
 <2><fa2>: Abbrev Number: 2 (DW_TAG_member)
    <fa3>   DW_AT_name        : (indirect string, offset: 0x6cee7): SpreadingFactor
    <fa7>   DW_AT_decl_file   : 12
    <fa8>   DW_AT_decl_line   : 196
    <fa9>   DW_AT_decl_column : 32
    <faa>   DW_AT_type        : <0xd0b>
    <fae>   DW_AT_data_member_location: 4
 <2><faf>: Abbrev Number: 2 (DW_TAG_member)
    <fb0>   DW_AT_name        : (indirect string, offset: 0xbae75): Bandwidth
    <fb4>   DW_AT_decl_file   : 12
    <fb5>   DW_AT_decl_line   : 197
    <fb6>   DW_AT_decl_column : 26
    <fb7>   DW_AT_type        : <0xd95>
    <fbb>   DW_AT_data_member_location: 5
 <2><fbc>: Abbrev Number: 2 (DW_TAG_member)
    <fbd>   DW_AT_name        : (indirect string, offset: 0x93ced): Coderate
    <fc1>   DW_AT_decl_file   : 12
    <fc2>   DW_AT_decl_line   : 198
    <fc3>   DW_AT_decl_column : 27
    <fc4>   DW_AT_type        : <0xd3e>
    <fc8>   DW_AT_data_member_location: 6
 <2><fc9>: Abbrev Number: 2 (DW_TAG_member)
    <fca>   DW_AT_name        : (indirect string, offset: 0x2fc8d): LowDatarateOptimize
    <fce>   DW_AT_decl_file   : 12
    <fcf>   DW_AT_decl_line   : 199
    <fd0>   DW_AT_decl_column : 18
    <fd1>   DW_AT_type        : <0xe43>
    <fd5>   DW_AT_data_member_location: 7
 <2><fd6>: Abbrev Number: 2 (DW_TAG_member)
    <fd7>   DW_AT_name        : (indirect string, offset: 0xa4917): PreambleLen
    <fdb>   DW_AT_decl_file   : 12
    <fdc>   DW_AT_decl_line   : 200
    <fdd>   DW_AT_decl_column : 12
    <fde>   DW_AT_type        : <0xf4>
    <fe2>   DW_AT_data_member_location: 8
 <2><fe3>: Abbrev Number: 2 (DW_TAG_member)
    <fe4>   DW_AT_name        : (indirect string, offset: 0xa07c4): LengthMode
    <fe8>   DW_AT_decl_file   : 12
    <fe9>   DW_AT_decl_line   : 201
    <fea>   DW_AT_decl_column : 33
    <feb>   DW_AT_type        : <0xdc8>
    <fef>   DW_AT_data_member_location: 10
 <2><ff0>: Abbrev Number: 2 (DW_TAG_member)
    <ff1>   DW_AT_name        : (indirect string, offset: 0xba97b): MaxPayloadLength
    <ff5>   DW_AT_decl_file   : 12
    <ff6>   DW_AT_decl_line   : 202
    <ff7>   DW_AT_decl_column : 11
    <ff8>   DW_AT_type        : <0xd7>
    <ffc>   DW_AT_data_member_location: 11
 <2><ffd>: Abbrev Number: 2 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0x8f190): CrcMode
    <1002>   DW_AT_decl_file   : 12
    <1003>   DW_AT_decl_line   : 203
    <1004>   DW_AT_decl_column : 24
    <1005>   DW_AT_type        : <0xdef>
    <1009>   DW_AT_data_member_location: 12
 <2><100a>: Abbrev Number: 2 (DW_TAG_member)
    <100b>   DW_AT_name        : (indirect string, offset: 0x3ead2): IqInverted
    <100f>   DW_AT_decl_file   : 12
    <1010>   DW_AT_decl_line   : 204
    <1011>   DW_AT_decl_column : 23
    <1012>   DW_AT_type        : <0xe16>
    <1016>   DW_AT_data_member_location: 13
 <2><1017>: Abbrev Number: 0
 <1><1018>: Abbrev Number: 5 (DW_TAG_typedef)
    <1019>   DW_AT_name        : (indirect string, offset: 0x7f660): generic_param_rx_lora_t
    <101d>   DW_AT_decl_file   : 12
    <101e>   DW_AT_decl_line   : 205
    <101f>   DW_AT_decl_column : 3
    <1020>   DW_AT_type        : <0xf8d>
 <1><1024>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1025>   DW_AT_byte_size   : 40
    <1026>   DW_AT_decl_file   : 12
    <1027>   DW_AT_decl_line   : 210
    <1028>   DW_AT_decl_column : 9
    <1028>   DW_AT_sibling     : <0x10fd>
 <2><102c>: Abbrev Number: 2 (DW_TAG_member)
    <102d>   DW_AT_name        : (indirect string, offset: 0x1d7d7): StopTimerOnPreambleDetect
    <1031>   DW_AT_decl_file   : 12
    <1032>   DW_AT_decl_line   : 212
    <1033>   DW_AT_decl_column : 12
    <1034>   DW_AT_type        : <0x111>
    <1038>   DW_AT_data_member_location: 0
 <2><1039>: Abbrev Number: 2 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0xbae75): Bandwidth
    <103e>   DW_AT_decl_file   : 12
    <103f>   DW_AT_decl_line   : 213
    <1040>   DW_AT_decl_column : 12
    <1041>   DW_AT_type        : <0x111>
    <1045>   DW_AT_data_member_location: 4
 <2><1046>: Abbrev Number: 2 (DW_TAG_member)
    <1047>   DW_AT_name        : (indirect string, offset: 0xa2c8b): BitRate
    <104b>   DW_AT_decl_file   : 12
    <104c>   DW_AT_decl_line   : 214
    <104d>   DW_AT_decl_column : 12
    <104e>   DW_AT_type        : <0x111>
