Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x24e0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x75d03): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfloat-abi=soft -mthumb -march=armv7e-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x13c80): ../Core/Src/app_freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x399c3): C:/Users/Valenokks/Documents/GitHub/USB-LoRa/Firmware/Debug
    <1a>   DW_AT_ranges      : 0x2a
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 41 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x77e1): size_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 214
    <38>   DW_AT_decl_column : 23
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 15 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4
    <3f>   DW_AT_encoding    : 7	(unsigned)

 <1><84>: Abbrev Number: 15 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 2
    <86>   DW_AT_encoding    : 5	(signed)
    <87>   DW_AT_name        : (indirect string, offset: 0x7cb72): short int
 <1><8b>: Abbrev Number: 5 (DW_TAG_typedef)
    <8c>   DW_AT_name        : (indirect string, offset: 0x89772): __uint16_t
    <90>   DW_AT_decl_file   : 3
    <91>   DW_AT_decl_line   : 57
    <92>   DW_AT_decl_column : 25
    <93>   DW_AT_type        : <0x97>
 <1><97>: Abbrev Number: 15 (DW_TAG_base_type)
    <98>   DW_AT_byte_size   : 2
    <99>   DW_AT_encoding    : 7	(unsigned)
    <9a>   DW_AT_name        : (indirect string, offset: 0xa272f): short unsigned int
 <1><9e>: Abbrev Number: 5 (DW_TAG_typedef)
    <9f>   DW_AT_name        : (indirect string, offset: 0x67922): __int32_t
    <a3>   DW_AT_decl_file   : 3
    <a4>   DW_AT_decl_line   : 77
    <a5>   DW_AT_decl_column : 24
    <a6>   DW_AT_type        : <0xaa>
 <1><aa>: Abbrev Number: 15 (DW_TAG_base_type)
    <ab>   DW_AT_byte_size   : 4
    <ac>   DW_AT_encoding    : 5	(signed)
    <ad>   DW_AT_name        : (indirect string, offset: 0xe499): long int
 <1><b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <b2>   DW_AT_name        : (indirect string, offset: 0x6b017): __uint32_t
    <b6>   DW_AT_decl_file   : 3
    <b7>   DW_AT_decl_line   : 79
    <b8>   DW_AT_decl_column : 25
    <b9>   DW_AT_type        : <0xbd>
 <1><bd>: Abbrev Number: 15 (DW_TAG_base_type)
    <be>   DW_AT_byte_size   : 4
    <bf>   DW_AT_encoding    : 7	(unsigned)
    <c0>   DW_AT_name        : (indirect string, offset: 0x287e8): long unsigned int
 <1><c4>: Abbrev Number: 15 (DW_TAG_base_type)
    <c5>   DW_AT_byte_size   : 8
    <c6>   DW_AT_encoding    : 7	(unsigned)
    <c7>   DW_AT_name        : (indirect string, offset: 0x23783): long long unsigned int
 <1><cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <cc>   DW_AT_name        : (indirect string, offset: 0x8e97): int8_t
    <d0>   DW_AT_decl_file   : 4
    <d1>   DW_AT_decl_line   : 20
    <d2>   DW_AT_decl_column : 18
    <d3>   DW_AT_type        : <0x52>
 <1><d7>: Abbrev Number: 5 (DW_TAG_typedef)
    <d8>   DW_AT_name        : (indirect string, offset: 0x31024): uint8_t
    <dc>   DW_AT_decl_file   : 4
    <dd>   DW_AT_decl_line   : 24
    <de>   DW_AT_decl_column : 19
    <df>   DW_AT_type        : <0x65>
 <1><e3>: Abbrev Number: 19 (DW_TAG_const_type)
    <e4>   DW_AT_type        : <0xd7>
 <1><e8>: Abbrev Number: 5 (DW_TAG_typedef)
    <e9>   DW_AT_name        : (indirect string, offset: 0x603ff): int16_t
    <ed>   DW_AT_decl_file   : 4
    <ee>   DW_AT_decl_line   : 32
    <ef>   DW_AT_decl_column : 19
    <f0>   DW_AT_type        : <0x78>
 <1><f4>: Abbrev Number: 5 (DW_TAG_typedef)
    <f5>   DW_AT_name        : (indirect string, offset: 0x7a55a): uint16_t
    <f9>   DW_AT_decl_file   : 4
    <fa>   DW_AT_decl_line   : 36
    <fb>   DW_AT_decl_column : 20
    <fc>   DW_AT_type        : <0x8b>
 <1><100>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <101>   DW_AT_type        : <0xf4>
 <1><105>: Abbrev Number: 5 (DW_TAG_typedef)
    <106>   DW_AT_name        : (indirect string, offset: 0x67924): int32_t
    <10a>   DW_AT_decl_file   : 4
    <10b>   DW_AT_decl_line   : 44
    <10c>   DW_AT_decl_column : 19
    <10d>   DW_AT_type        : <0x9e>
 <1><111>: Abbrev Number: 5 (DW_TAG_typedef)
    <112>   DW_AT_name        : (indirect string, offset: 0x79d12): uint32_t
    <116>   DW_AT_decl_file   : 4
    <117>   DW_AT_decl_line   : 48
    <118>   DW_AT_decl_column : 20
    <119>   DW_AT_type        : <0xb1>
 <1><11d>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <11e>   DW_AT_type        : <0x111>
 <1><122>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <123>   DW_AT_byte_size   : 4
    <123>   DW_AT_type        : <0x127>
 <1><127>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <128>   DW_AT_prototyped  : 1
    <128>   DW_AT_sibling     : <0x132>
 <2><12c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <12d>   DW_AT_type        : <0x132>
 <2><131>: Abbrev Number: 0
 <1><132>: Abbrev Number: 42 (DW_TAG_pointer_type)
    <133>   DW_AT_byte_size   : 4
 <1><134>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <135>   DW_AT_byte_size   : 4
    <135>   DW_AT_type        : <0xd7>
 <1><139>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <13a>   DW_AT_byte_size   : 4
    <13a>   DW_AT_type        : <0x13e>
 <1><13e>: Abbrev Number: 43 (DW_TAG_subroutine_type)
    <13f>   DW_AT_prototyped  : 1
 <1><13f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <140>   DW_AT_byte_size   : 4
    <140>   DW_AT_type        : <0x144>
 <1><144>: Abbrev Number: 15 (DW_TAG_base_type)
    <145>   DW_AT_byte_size   : 1
    <146>   DW_AT_encoding    : 8	(unsigned char)
    <147>   DW_AT_name        : (indirect string, offset: 0x36950): char
 <1><14b>: Abbrev Number: 19 (DW_TAG_const_type)
    <14c>   DW_AT_type        : <0x144>
 <1><150>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <151>   DW_AT_byte_size   : 4
    <151>   DW_AT_type        : <0x14b>
 <1><155>: Abbrev Number: 5 (DW_TAG_typedef)
    <156>   DW_AT_name        : (indirect string, offset: 0x92ca2): TaskHandle_t
    <15a>   DW_AT_decl_file   : 5
    <15b>   DW_AT_decl_line   : 70
    <15c>   DW_AT_decl_column : 37
    <15d>   DW_AT_type        : <0x161>
 <1><161>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <162>   DW_AT_byte_size   : 4
    <162>   DW_AT_type        : <0x166>
 <1><166>: Abbrev Number: 44 (DW_TAG_structure_type)
    <167>   DW_AT_name        : (indirect string, offset: 0x8f7f3): tskTaskControlBlock
    <16b>   DW_AT_declaration : 1
 <1><16b>: Abbrev Number: 20 (DW_TAG_structure_type)
    <16c>   DW_AT_byte_size   : 16
    <16d>   DW_AT_decl_file   : 6
    <16e>   DW_AT_decl_line   : 300
    <170>   DW_AT_decl_column : 9
    <170>   DW_AT_sibling     : <0x1ad>
 <2><174>: Abbrev Number: 12 (DW_TAG_member)
    <175>   DW_AT_name        : CCR
    <179>   DW_AT_decl_file   : 6
    <17a>   DW_AT_decl_line   : 302
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0x11d>
    <181>   DW_AT_data_member_location: 0
 <2><182>: Abbrev Number: 4 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x6d973): CNDTR
    <187>   DW_AT_decl_file   : 6
    <188>   DW_AT_decl_line   : 303
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0x11d>
    <18f>   DW_AT_data_member_location: 4
 <2><190>: Abbrev Number: 4 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xa3c78): CPAR
    <195>   DW_AT_decl_file   : 6
    <196>   DW_AT_decl_line   : 304
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0x11d>
    <19d>   DW_AT_data_member_location: 8
 <2><19e>: Abbrev Number: 4 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0x5df98): CMAR
    <1a3>   DW_AT_decl_file   : 6
    <1a4>   DW_AT_decl_line   : 305
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0x11d>
    <1ab>   DW_AT_data_member_location: 12
 <2><1ac>: Abbrev Number: 0
 <1><1ad>: Abbrev Number: 13 (DW_TAG_typedef)
    <1ae>   DW_AT_name        : (indirect string, offset: 0x88d2c): DMA_Channel_TypeDef
    <1b2>   DW_AT_decl_file   : 6
    <1b3>   DW_AT_decl_line   : 306
    <1b5>   DW_AT_decl_column : 3
    <1b6>   DW_AT_type        : <0x16b>
 <1><1ba>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1bb>   DW_AT_byte_size   : 8
    <1bc>   DW_AT_decl_file   : 6
    <1bd>   DW_AT_decl_line   : 308
    <1bf>   DW_AT_decl_column : 9
    <1bf>   DW_AT_sibling     : <0x1e0>
 <2><1c3>: Abbrev Number: 12 (DW_TAG_member)
    <1c4>   DW_AT_name        : ISR
    <1c8>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 310
    <1cb>   DW_AT_decl_column : 17
    <1cc>   DW_AT_type        : <0x11d>
    <1d0>   DW_AT_data_member_location: 0
 <2><1d1>: Abbrev Number: 4 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x75a00): IFCR
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 311
    <1d9>   DW_AT_decl_column : 17
    <1da>   DW_AT_type        : <0x11d>
    <1de>   DW_AT_data_member_location: 4
 <2><1df>: Abbrev Number: 0
 <1><1e0>: Abbrev Number: 13 (DW_TAG_typedef)
    <1e1>   DW_AT_name        : (indirect string, offset: 0x3e26f): DMA_TypeDef
    <1e5>   DW_AT_decl_file   : 6
    <1e6>   DW_AT_decl_line   : 312
    <1e8>   DW_AT_decl_column : 3
    <1e9>   DW_AT_type        : <0x1ba>
 <1><1ed>: Abbrev Number: 20 (DW_TAG_structure_type)
    <1ee>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_decl_file   : 6
    <1f0>   DW_AT_decl_line   : 317
    <1f2>   DW_AT_decl_column : 9
    <1f2>   DW_AT_sibling     : <0x205>
 <2><1f6>: Abbrev Number: 12 (DW_TAG_member)
    <1f7>   DW_AT_name        : CCR
    <1fb>   DW_AT_decl_file   : 6
    <1fc>   DW_AT_decl_line   : 319
    <1fe>   DW_AT_decl_column : 19
    <1ff>   DW_AT_type        : <0x11d>
    <203>   DW_AT_data_member_location: 0
 <2><204>: Abbrev Number: 0
 <1><205>: Abbrev Number: 13 (DW_TAG_typedef)
    <206>   DW_AT_name        : (indirect string, offset: 0x140f8): DMAMUX_Channel_TypeDef
    <20a>   DW_AT_decl_file   : 6
    <20b>   DW_AT_decl_line   : 320
    <20d>   DW_AT_decl_column : 2
    <20e>   DW_AT_type        : <0x1ed>
 <1><212>: Abbrev Number: 20 (DW_TAG_structure_type)
    <213>   DW_AT_byte_size   : 8
    <214>   DW_AT_decl_file   : 6
    <215>   DW_AT_decl_line   : 322
    <217>   DW_AT_decl_column : 9
    <217>   DW_AT_sibling     : <0x238>
 <2><21b>: Abbrev Number: 12 (DW_TAG_member)
    <21c>   DW_AT_name        : CSR
    <220>   DW_AT_decl_file   : 6
    <221>   DW_AT_decl_line   : 324
    <223>   DW_AT_decl_column : 19
    <224>   DW_AT_type        : <0x11d>
    <228>   DW_AT_data_member_location: 0
 <2><229>: Abbrev Number: 12 (DW_TAG_member)
    <22a>   DW_AT_name        : CFR
    <22e>   DW_AT_decl_file   : 6
    <22f>   DW_AT_decl_line   : 325
    <231>   DW_AT_decl_column : 19
    <232>   DW_AT_type        : <0x11d>
    <236>   DW_AT_data_member_location: 4
 <2><237>: Abbrev Number: 0
 <1><238>: Abbrev Number: 13 (DW_TAG_typedef)
    <239>   DW_AT_name        : (indirect string, offset: 0xa0214): DMAMUX_ChannelStatus_TypeDef
    <23d>   DW_AT_decl_file   : 6
    <23e>   DW_AT_decl_line   : 326
    <240>   DW_AT_decl_column : 2
    <241>   DW_AT_type        : <0x212>
 <1><245>: Abbrev Number: 20 (DW_TAG_structure_type)
    <246>   DW_AT_byte_size   : 4
    <247>   DW_AT_decl_file   : 6
    <248>   DW_AT_decl_line   : 328
    <24a>   DW_AT_decl_column : 9
    <24a>   DW_AT_sibling     : <0x25d>
 <2><24e>: Abbrev Number: 4 (DW_TAG_member)
    <24f>   DW_AT_name        : (indirect string, offset: 0x5385b): RGCR
    <253>   DW_AT_decl_file   : 6
    <254>   DW_AT_decl_line   : 330
    <256>   DW_AT_decl_column : 19
    <257>   DW_AT_type        : <0x11d>
    <25b>   DW_AT_data_member_location: 0
 <2><25c>: Abbrev Number: 0
 <1><25d>: Abbrev Number: 13 (DW_TAG_typedef)
    <25e>   DW_AT_name        : (indirect string, offset: 0x63b9c): DMAMUX_RequestGen_TypeDef
    <262>   DW_AT_decl_file   : 6
    <263>   DW_AT_decl_line   : 331
    <265>   DW_AT_decl_column : 2
    <266>   DW_AT_type        : <0x245>
 <1><26a>: Abbrev Number: 20 (DW_TAG_structure_type)
    <26b>   DW_AT_byte_size   : 8
    <26c>   DW_AT_decl_file   : 6
    <26d>   DW_AT_decl_line   : 333
    <26f>   DW_AT_decl_column : 9
    <26f>   DW_AT_sibling     : <0x290>
 <2><273>: Abbrev Number: 4 (DW_TAG_member)
    <274>   DW_AT_name        : (indirect string, offset: 0x59202): RGSR
    <278>   DW_AT_decl_file   : 6
    <279>   DW_AT_decl_line   : 335
    <27b>   DW_AT_decl_column : 19
    <27c>   DW_AT_type        : <0x11d>
    <280>   DW_AT_data_member_location: 0
 <2><281>: Abbrev Number: 4 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x2c8): RGCFR
    <286>   DW_AT_decl_file   : 6
    <287>   DW_AT_decl_line   : 336
    <289>   DW_AT_decl_column : 19
    <28a>   DW_AT_type        : <0x11d>
    <28e>   DW_AT_data_member_location: 4
 <2><28f>: Abbrev Number: 0
 <1><290>: Abbrev Number: 13 (DW_TAG_typedef)
    <291>   DW_AT_name        : (indirect string, offset: 0x22749): DMAMUX_RequestGenStatus_TypeDef
    <295>   DW_AT_decl_file   : 6
    <296>   DW_AT_decl_line   : 337
    <298>   DW_AT_decl_column : 2
    <299>   DW_AT_type        : <0x26a>
 <1><29d>: Abbrev Number: 20 (DW_TAG_structure_type)
    <29e>   DW_AT_byte_size   : 48
    <29f>   DW_AT_decl_file   : 6
    <2a0>   DW_AT_decl_line   : 722
    <2a2>   DW_AT_decl_column : 9
    <2a2>   DW_AT_sibling     : <0x34f>
 <2><2a6>: Abbrev Number: 12 (DW_TAG_member)
    <2a7>   DW_AT_name        : CR1
    <2ab>   DW_AT_decl_file   : 6
    <2ac>   DW_AT_decl_line   : 724
    <2ae>   DW_AT_decl_column : 17
    <2af>   DW_AT_type        : <0x11d>
    <2b3>   DW_AT_data_member_location: 0
 <2><2b4>: Abbrev Number: 12 (DW_TAG_member)
    <2b5>   DW_AT_name        : CR2
    <2b9>   DW_AT_decl_file   : 6
    <2ba>   DW_AT_decl_line   : 725
    <2bc>   DW_AT_decl_column : 17
    <2bd>   DW_AT_type        : <0x11d>
    <2c1>   DW_AT_data_member_location: 4
 <2><2c2>: Abbrev Number: 12 (DW_TAG_member)
    <2c3>   DW_AT_name        : CR3
    <2c7>   DW_AT_decl_file   : 6
    <2c8>   DW_AT_decl_line   : 726
    <2ca>   DW_AT_decl_column : 17
    <2cb>   DW_AT_type        : <0x11d>
    <2cf>   DW_AT_data_member_location: 8
 <2><2d0>: Abbrev Number: 12 (DW_TAG_member)
    <2d1>   DW_AT_name        : BRR
    <2d5>   DW_AT_decl_file   : 6
    <2d6>   DW_AT_decl_line   : 727
    <2d8>   DW_AT_decl_column : 17
    <2d9>   DW_AT_type        : <0x11d>
    <2dd>   DW_AT_data_member_location: 12
 <2><2de>: Abbrev Number: 4 (DW_TAG_member)
    <2df>   DW_AT_name        : (indirect string, offset: 0x2f089): GTPR
    <2e3>   DW_AT_decl_file   : 6
    <2e4>   DW_AT_decl_line   : 728
    <2e6>   DW_AT_decl_column : 17
    <2e7>   DW_AT_type        : <0x11d>
    <2eb>   DW_AT_data_member_location: 16
 <2><2ec>: Abbrev Number: 4 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0x323cf): RTOR
    <2f1>   DW_AT_decl_file   : 6
    <2f2>   DW_AT_decl_line   : 729
    <2f4>   DW_AT_decl_column : 17
    <2f5>   DW_AT_type        : <0x11d>
    <2f9>   DW_AT_data_member_location: 20
 <2><2fa>: Abbrev Number: 12 (DW_TAG_member)
    <2fb>   DW_AT_name        : RQR
    <2ff>   DW_AT_decl_file   : 6
    <300>   DW_AT_decl_line   : 730
    <302>   DW_AT_decl_column : 17
    <303>   DW_AT_type        : <0x11d>
    <307>   DW_AT_data_member_location: 24
 <2><308>: Abbrev Number: 12 (DW_TAG_member)
    <309>   DW_AT_name        : ISR
    <30d>   DW_AT_decl_file   : 6
    <30e>   DW_AT_decl_line   : 731
    <310>   DW_AT_decl_column : 17
    <311>   DW_AT_type        : <0x11d>
    <315>   DW_AT_data_member_location: 28
 <2><316>: Abbrev Number: 12 (DW_TAG_member)
    <317>   DW_AT_name        : ICR
    <31b>   DW_AT_decl_file   : 6
    <31c>   DW_AT_decl_line   : 732
    <31e>   DW_AT_decl_column : 17
    <31f>   DW_AT_type        : <0x11d>
    <323>   DW_AT_data_member_location: 32
 <2><324>: Abbrev Number: 12 (DW_TAG_member)
    <325>   DW_AT_name        : RDR
    <329>   DW_AT_decl_file   : 6
    <32a>   DW_AT_decl_line   : 733
    <32c>   DW_AT_decl_column : 17
    <32d>   DW_AT_type        : <0x11d>
    <331>   DW_AT_data_member_location: 36
 <2><332>: Abbrev Number: 12 (DW_TAG_member)
    <333>   DW_AT_name        : TDR
    <337>   DW_AT_decl_file   : 6
    <338>   DW_AT_decl_line   : 734
    <33a>   DW_AT_decl_column : 17
    <33b>   DW_AT_type        : <0x11d>
    <33f>   DW_AT_data_member_location: 40
 <2><340>: Abbrev Number: 4 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x73071): PRESC
    <345>   DW_AT_decl_file   : 6
    <346>   DW_AT_decl_line   : 735
    <348>   DW_AT_decl_column : 17
    <349>   DW_AT_type        : <0x11d>
    <34d>   DW_AT_data_member_location: 44
 <2><34e>: Abbrev Number: 0
 <1><34f>: Abbrev Number: 13 (DW_TAG_typedef)
    <350>   DW_AT_name        : (indirect string, offset: 0xa81ad): USART_TypeDef
    <354>   DW_AT_decl_file   : 6
    <355>   DW_AT_decl_line   : 736
    <357>   DW_AT_decl_column : 3
    <358>   DW_AT_type        : <0x29d>
 <1><35c>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <35d>   DW_AT_encoding    : 7	(unsigned)
    <35e>   DW_AT_byte_size   : 1
    <35f>   DW_AT_type        : <0x71>
    <363>   DW_AT_decl_file   : 7
    <364>   DW_AT_decl_line   : 39
    <365>   DW_AT_decl_column : 1
    <366>   DW_AT_sibling     : <0x383>
 <2><36a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <36b>   DW_AT_name        : (indirect string, offset: 0x7e532): HAL_OK
    <36f>   DW_AT_const_value : 0
 <2><370>: Abbrev Number: 1 (DW_TAG_enumerator)
    <371>   DW_AT_name        : (indirect string, offset: 0x694ba): HAL_ERROR
    <375>   DW_AT_const_value : 1
 <2><376>: Abbrev Number: 1 (DW_TAG_enumerator)
    <377>   DW_AT_name        : (indirect string, offset: 0x1db76): HAL_BUSY
    <37b>   DW_AT_const_value : 2
 <2><37c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <37d>   DW_AT_name        : (indirect string, offset: 0x31502): HAL_TIMEOUT
    <381>   DW_AT_const_value : 3
 <2><382>: Abbrev Number: 0
 <1><383>: Abbrev Number: 5 (DW_TAG_typedef)
    <384>   DW_AT_name        : (indirect string, offset: 0x97c18): HAL_StatusTypeDef
    <388>   DW_AT_decl_file   : 7
    <389>   DW_AT_decl_line   : 44
    <38a>   DW_AT_decl_column : 3
    <38b>   DW_AT_type        : <0x35c>
 <1><38f>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <390>   DW_AT_encoding    : 7	(unsigned)
    <391>   DW_AT_byte_size   : 1
    <392>   DW_AT_type        : <0x71>
    <396>   DW_AT_decl_file   : 7
    <397>   DW_AT_decl_line   : 50
    <398>   DW_AT_decl_column : 1
    <399>   DW_AT_sibling     : <0x3aa>
 <2><39d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39e>   DW_AT_name        : (indirect string, offset: 0x7bedd): HAL_UNLOCKED
    <3a2>   DW_AT_const_value : 0
 <2><3a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a4>   DW_AT_name        : (indirect string, offset: 0xa97b5): HAL_LOCKED
    <3a8>   DW_AT_const_value : 1
 <2><3a9>: Abbrev Number: 0
 <1><3aa>: Abbrev Number: 5 (DW_TAG_typedef)
    <3ab>   DW_AT_name        : (indirect string, offset: 0x66c6f): HAL_LockTypeDef
    <3af>   DW_AT_decl_file   : 7
    <3b0>   DW_AT_decl_line   : 53
    <3b1>   DW_AT_decl_column : 3
    <3b2>   DW_AT_type        : <0x38f>
 <1><3b6>: Abbrev Number: 11 (DW_TAG_array_type)
    <3b7>   DW_AT_type        : <0xe3>
    <3bb>   DW_AT_sibling     : <0x3c6>
 <2><3bf>: Abbrev Number: 16 (DW_TAG_subrange_type)
    <3c0>   DW_AT_type        : <0x3d>
    <3c4>   DW_AT_upper_bound : 6
 <2><3c5>: Abbrev Number: 0
 <1><3c6>: Abbrev Number: 19 (DW_TAG_const_type)
    <3c7>   DW_AT_type        : <0x3b6>
 <1><3cb>: Abbrev Number: 33 (DW_TAG_variable)
    <3cc>   DW_AT_name        : (indirect string, offset: 0x3d1a3): CHANNEL_OFFSET_TAB
    <3d0>   DW_AT_decl_file   : 16
    <3d1>   DW_AT_decl_line   : 47
    <3d2>   DW_AT_decl_column : 22
    <3d2>   DW_AT_type        : <0x3c6>
    <3d6>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><3dc>: Abbrev Number: 17 (DW_TAG_structure_type)
    <3dd>   DW_AT_byte_size   : 32
    <3de>   DW_AT_decl_file   : 8
    <3df>   DW_AT_decl_line   : 47
    <3e0>   DW_AT_decl_column : 9
    <3e0>   DW_AT_sibling     : <0x44d>
 <2><3e4>: Abbrev Number: 3 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x3e830): Request
    <3e9>   DW_AT_decl_file   : 8
    <3ea>   DW_AT_decl_line   : 49
    <3eb>   DW_AT_decl_column : 12
    <3ec>   DW_AT_type        : <0x111>
    <3f0>   DW_AT_data_member_location: 0
 <2><3f1>: Abbrev Number: 3 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x3b8fc): Direction
    <3f6>   DW_AT_decl_file   : 8
    <3f7>   DW_AT_decl_line   : 52
    <3f8>   DW_AT_decl_column : 12
    <3f9>   DW_AT_type        : <0x111>
    <3fd>   DW_AT_data_member_location: 4
 <2><3fe>: Abbrev Number: 3 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x395d2): PeriphInc
    <403>   DW_AT_decl_file   : 8
    <404>   DW_AT_decl_line   : 56
    <405>   DW_AT_decl_column : 12
    <406>   DW_AT_type        : <0x111>
    <40a>   DW_AT_data_member_location: 8
 <2><40b>: Abbrev Number: 3 (DW_TAG_member)
    <40c>   DW_AT_name        : (indirect string, offset: 0x1a7cd): MemInc
    <410>   DW_AT_decl_file   : 8
    <411>   DW_AT_decl_line   : 59
    <412>   DW_AT_decl_column : 12
    <413>   DW_AT_type        : <0x111>
    <417>   DW_AT_data_member_location: 12
 <2><418>: Abbrev Number: 3 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0x54638): PeriphDataAlignment
    <41d>   DW_AT_decl_file   : 8
    <41e>   DW_AT_decl_line   : 62
    <41f>   DW_AT_decl_column : 12
    <420>   DW_AT_type        : <0x111>
    <424>   DW_AT_data_member_location: 16
 <2><425>: Abbrev Number: 3 (DW_TAG_member)
    <426>   DW_AT_name        : (indirect string, offset: 0x98dcc): MemDataAlignment
    <42a>   DW_AT_decl_file   : 8
    <42b>   DW_AT_decl_line   : 65
    <42c>   DW_AT_decl_column : 12
    <42d>   DW_AT_type        : <0x111>
    <431>   DW_AT_data_member_location: 20
 <2><432>: Abbrev Number: 3 (DW_TAG_member)
    <433>   DW_AT_name        : (indirect string, offset: 0xafa62): Mode
    <437>   DW_AT_decl_file   : 8
    <438>   DW_AT_decl_line   : 68
    <439>   DW_AT_decl_column : 12
    <43a>   DW_AT_type        : <0x111>
    <43e>   DW_AT_data_member_location: 24
 <2><43f>: Abbrev Number: 3 (DW_TAG_member)
    <440>   DW_AT_name        : (indirect string, offset: 0xaee36): Priority
    <444>   DW_AT_decl_file   : 8
    <445>   DW_AT_decl_line   : 73
    <446>   DW_AT_decl_column : 12
    <447>   DW_AT_type        : <0x111>
    <44b>   DW_AT_data_member_location: 28
 <2><44c>: Abbrev Number: 0
 <1><44d>: Abbrev Number: 5 (DW_TAG_typedef)
    <44e>   DW_AT_name        : (indirect string, offset: 0x2d754): DMA_InitTypeDef
    <452>   DW_AT_decl_file   : 8
    <453>   DW_AT_decl_line   : 75
    <454>   DW_AT_decl_column : 3
    <455>   DW_AT_type        : <0x3dc>
 <1><459>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <45a>   DW_AT_encoding    : 7	(unsigned)
    <45b>   DW_AT_byte_size   : 1
    <45c>   DW_AT_type        : <0x71>
    <460>   DW_AT_decl_file   : 8
    <461>   DW_AT_decl_line   : 81
    <462>   DW_AT_decl_column : 1
    <463>   DW_AT_sibling     : <0x480>
 <2><467>: Abbrev Number: 1 (DW_TAG_enumerator)
    <468>   DW_AT_name        : (indirect string, offset: 0x7cdfd): HAL_DMA_STATE_RESET
    <46c>   DW_AT_const_value : 0
 <2><46d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <46e>   DW_AT_name        : (indirect string, offset: 0x2e8e3): HAL_DMA_STATE_READY
    <472>   DW_AT_const_value : 1
 <2><473>: Abbrev Number: 1 (DW_TAG_enumerator)
    <474>   DW_AT_name        : (indirect string, offset: 0x74869): HAL_DMA_STATE_BUSY
    <478>   DW_AT_const_value : 2
 <2><479>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47a>   DW_AT_name        : (indirect string, offset: 0xa6c3e): HAL_DMA_STATE_TIMEOUT
    <47e>   DW_AT_const_value : 3
 <2><47f>: Abbrev Number: 0
 <1><480>: Abbrev Number: 5 (DW_TAG_typedef)
    <481>   DW_AT_name        : (indirect string, offset: 0x5dcda): HAL_DMA_StateTypeDef
    <485>   DW_AT_decl_file   : 8
    <486>   DW_AT_decl_line   : 86
    <487>   DW_AT_decl_column : 3
    <488>   DW_AT_type        : <0x459>
 <1><48c>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <48d>   DW_AT_type        : <0x480>
 <1><491>: Abbrev Number: 22 (DW_TAG_structure_type)
    <492>   DW_AT_name        : (indirect string, offset: 0x8fa4c): __DMA_HandleTypeDef
    <496>   DW_AT_byte_size   : 96
    <497>   DW_AT_decl_file   : 8
    <498>   DW_AT_decl_line   : 113
    <499>   DW_AT_decl_column : 16
    <49a>   DW_AT_sibling     : <0x589>
 <2><49e>: Abbrev Number: 3 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x42608): Instance
    <4a3>   DW_AT_decl_file   : 8
    <4a4>   DW_AT_decl_line   : 115
    <4a5>   DW_AT_decl_column : 36
    <4a6>   DW_AT_type        : <0x589>
    <4aa>   DW_AT_data_member_location: 0
 <2><4ab>: Abbrev Number: 3 (DW_TAG_member)
    <4ac>   DW_AT_name        : (indirect string, offset: 0xaf388): Init
    <4b0>   DW_AT_decl_file   : 8
    <4b1>   DW_AT_decl_line   : 117
    <4b2>   DW_AT_decl_column : 35
    <4b3>   DW_AT_type        : <0x44d>
    <4b7>   DW_AT_data_member_location: 4
 <2><4b8>: Abbrev Number: 3 (DW_TAG_member)
    <4b9>   DW_AT_name        : (indirect string, offset: 0x77995): Lock
    <4bd>   DW_AT_decl_file   : 8
    <4be>   DW_AT_decl_line   : 119
    <4bf>   DW_AT_decl_column : 35
    <4c0>   DW_AT_type        : <0x3aa>
    <4c4>   DW_AT_data_member_location: 36
 <2><4c5>: Abbrev Number: 3 (DW_TAG_member)
    <4c6>   DW_AT_name        : (indirect string, offset: 0xb2b66): State
    <4ca>   DW_AT_decl_file   : 8
    <4cb>   DW_AT_decl_line   : 121
    <4cc>   DW_AT_decl_column : 35
    <4cd>   DW_AT_type        : <0x48c>
    <4d1>   DW_AT_data_member_location: 37
 <2><4d2>: Abbrev Number: 3 (DW_TAG_member)
    <4d3>   DW_AT_name        : (indirect string, offset: 0xa11c7): Parent
    <4d7>   DW_AT_decl_file   : 8
    <4d8>   DW_AT_decl_line   : 123
    <4d9>   DW_AT_decl_column : 11
    <4da>   DW_AT_type        : <0x132>
    <4de>   DW_AT_data_member_location: 40
 <2><4df>: Abbrev Number: 3 (DW_TAG_member)
    <4e0>   DW_AT_name        : (indirect string, offset: 0xa8bad): XferCpltCallback
    <4e4>   DW_AT_decl_file   : 8
    <4e5>   DW_AT_decl_line   : 125
    <4e6>   DW_AT_decl_column : 11
    <4e7>   DW_AT_type        : <0x59e>
    <4eb>   DW_AT_data_member_location: 44
 <2><4ec>: Abbrev Number: 3 (DW_TAG_member)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x82400): XferHalfCpltCallback
    <4f1>   DW_AT_decl_file   : 8
    <4f2>   DW_AT_decl_line   : 127
    <4f3>   DW_AT_decl_column : 11
    <4f4>   DW_AT_type        : <0x59e>
    <4f8>   DW_AT_data_member_location: 48
 <2><4f9>: Abbrev Number: 3 (DW_TAG_member)
    <4fa>   DW_AT_name        : (indirect string, offset: 0x18387): XferErrorCallback
    <4fe>   DW_AT_decl_file   : 8
    <4ff>   DW_AT_decl_line   : 129
    <500>   DW_AT_decl_column : 11
    <501>   DW_AT_type        : <0x59e>
    <505>   DW_AT_data_member_location: 52
 <2><506>: Abbrev Number: 3 (DW_TAG_member)
    <507>   DW_AT_name        : (indirect string, offset: 0x9e341): XferAbortCallback
    <50b>   DW_AT_decl_file   : 8
    <50c>   DW_AT_decl_line   : 131
    <50d>   DW_AT_decl_column : 11
    <50e>   DW_AT_type        : <0x59e>
    <512>   DW_AT_data_member_location: 56
 <2><513>: Abbrev Number: 3 (DW_TAG_member)
    <514>   DW_AT_name        : (indirect string, offset: 0xa5ba0): ErrorCode
    <518>   DW_AT_decl_file   : 8
    <519>   DW_AT_decl_line   : 133
    <51a>   DW_AT_decl_column : 35
    <51b>   DW_AT_type        : <0x11d>
    <51f>   DW_AT_data_member_location: 60
 <2><520>: Abbrev Number: 3 (DW_TAG_member)
    <521>   DW_AT_name        : (indirect string, offset: 0x44e37): DmaBaseAddress
    <525>   DW_AT_decl_file   : 8
    <526>   DW_AT_decl_line   : 135
    <527>   DW_AT_decl_column : 27
    <528>   DW_AT_type        : <0x5a3>
    <52c>   DW_AT_data_member_location: 64
 <2><52d>: Abbrev Number: 3 (DW_TAG_member)
    <52e>   DW_AT_name        : (indirect string, offset: 0x9cbad): ChannelIndex
    <532>   DW_AT_decl_file   : 8
    <533>   DW_AT_decl_line   : 137
    <534>   DW_AT_decl_column : 35
    <535>   DW_AT_type        : <0x111>
    <539>   DW_AT_data_member_location: 68
 <2><53a>: Abbrev Number: 3 (DW_TAG_member)
    <53b>   DW_AT_name        : (indirect string, offset: 0xa3d9): DMAmuxChannel
    <53f>   DW_AT_decl_file   : 8
    <540>   DW_AT_decl_line   : 139
    <541>   DW_AT_decl_column : 37
    <542>   DW_AT_type        : <0x5a8>
    <546>   DW_AT_data_member_location: 72
 <2><547>: Abbrev Number: 3 (DW_TAG_member)
    <548>   DW_AT_name        : (indirect string, offset: 0x3ea94): DMAmuxChannelStatus
    <54c>   DW_AT_decl_file   : 8
    <54d>   DW_AT_decl_line   : 141
    <54e>   DW_AT_decl_column : 37
    <54f>   DW_AT_type        : <0x5ad>
    <553>   DW_AT_data_member_location: 76
 <2><554>: Abbrev Number: 3 (DW_TAG_member)
    <555>   DW_AT_name        : (indirect string, offset: 0x80107): DMAmuxChannelStatusMask
    <559>   DW_AT_decl_file   : 8
    <55a>   DW_AT_decl_line   : 143
    <55b>   DW_AT_decl_column : 36
    <55c>   DW_AT_type        : <0x111>
    <560>   DW_AT_data_member_location: 80
 <2><561>: Abbrev Number: 3 (DW_TAG_member)
    <562>   DW_AT_name        : (indirect string, offset: 0x31fe5): DMAmuxRequestGen
    <566>   DW_AT_decl_file   : 8
    <567>   DW_AT_decl_line   : 145
    <568>   DW_AT_decl_column : 37
    <569>   DW_AT_type        : <0x5b2>
    <56d>   DW_AT_data_member_location: 84
 <2><56e>: Abbrev Number: 3 (DW_TAG_member)
    <56f>   DW_AT_name        : (indirect string, offset: 0x8534d): DMAmuxRequestGenStatus
    <573>   DW_AT_decl_file   : 8
    <574>   DW_AT_decl_line   : 147
    <575>   DW_AT_decl_column : 37
    <576>   DW_AT_type        : <0x5b7>
    <57a>   DW_AT_data_member_location: 88
 <2><57b>: Abbrev Number: 3 (DW_TAG_member)
    <57c>   DW_AT_name        : (indirect string, offset: 0x883d5): DMAmuxRequestGenStatusMask
    <580>   DW_AT_decl_file   : 8
    <581>   DW_AT_decl_line   : 149
    <582>   DW_AT_decl_column : 36
    <583>   DW_AT_type        : <0x111>
    <587>   DW_AT_data_member_location: 92
 <2><588>: Abbrev Number: 0
 <1><589>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <58a>   DW_AT_byte_size   : 4
    <58a>   DW_AT_type        : <0x1ad>
 <1><58e>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <58f>   DW_AT_prototyped  : 1
    <58f>   DW_AT_sibling     : <0x599>
 <2><593>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0x599>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x491>
 <1><59e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <59f>   DW_AT_byte_size   : 4
    <59f>   DW_AT_type        : <0x58e>
 <1><5a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5a4>   DW_AT_byte_size   : 4
    <5a4>   DW_AT_type        : <0x1e0>
 <1><5a8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5a9>   DW_AT_byte_size   : 4
    <5a9>   DW_AT_type        : <0x205>
 <1><5ad>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5ae>   DW_AT_byte_size   : 4
    <5ae>   DW_AT_type        : <0x238>
 <1><5b2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b3>   DW_AT_byte_size   : 4
    <5b3>   DW_AT_type        : <0x25d>
 <1><5b7>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5b8>   DW_AT_byte_size   : 4
    <5b8>   DW_AT_type        : <0x290>
 <1><5bc>: Abbrev Number: 5 (DW_TAG_typedef)
    <5bd>   DW_AT_name        : (indirect string, offset: 0x8fa4e): DMA_HandleTypeDef
    <5c1>   DW_AT_decl_file   : 8
    <5c2>   DW_AT_decl_line   : 150
    <5c3>   DW_AT_decl_column : 3
    <5c4>   DW_AT_type        : <0x491>
 <1><5c8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <5c9>   DW_AT_byte_size   : 4
    <5c9>   DW_AT_type        : <0x5bc>
 <1><5cd>: Abbrev Number: 17 (DW_TAG_structure_type)
    <5ce>   DW_AT_byte_size   : 36
    <5cf>   DW_AT_decl_file   : 9
    <5d0>   DW_AT_decl_line   : 46
    <5d1>   DW_AT_decl_column : 9
    <5d1>   DW_AT_sibling     : <0x64b>
 <2><5d5>: Abbrev Number: 3 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x69879): BaudRate
    <5da>   DW_AT_decl_file   : 9
    <5db>   DW_AT_decl_line   : 48
    <5dc>   DW_AT_decl_column : 12
    <5dd>   DW_AT_type        : <0x111>
    <5e1>   DW_AT_data_member_location: 0
 <2><5e2>: Abbrev Number: 3 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x2afcb): WordLength
    <5e7>   DW_AT_decl_file   : 9
    <5e8>   DW_AT_decl_line   : 66
    <5e9>   DW_AT_decl_column : 12
    <5ea>   DW_AT_type        : <0x111>
    <5ee>   DW_AT_data_member_location: 4
 <2><5ef>: Abbrev Number: 3 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0x9af6b): StopBits
    <5f4>   DW_AT_decl_file   : 9
    <5f5>   DW_AT_decl_line   : 69
    <5f6>   DW_AT_decl_column : 12
    <5f7>   DW_AT_type        : <0x111>
    <5fb>   DW_AT_data_member_location: 8
 <2><5fc>: Abbrev Number: 3 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0x565f8): Parity
    <601>   DW_AT_decl_file   : 9
    <602>   DW_AT_decl_line   : 72
    <603>   DW_AT_decl_column : 12
    <604>   DW_AT_type        : <0x111>
    <608>   DW_AT_data_member_location: 12
 <2><609>: Abbrev Number: 3 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xafa62): Mode
    <60e>   DW_AT_decl_file   : 9
    <60f>   DW_AT_decl_line   : 79
    <610>   DW_AT_decl_column : 12
    <611>   DW_AT_type        : <0x111>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 3 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0x63f7a): HwFlowCtl
    <61b>   DW_AT_decl_file   : 9
    <61c>   DW_AT_decl_line   : 82
    <61d>   DW_AT_decl_column : 12
    <61e>   DW_AT_type        : <0x111>
    <622>   DW_AT_data_member_location: 20
 <2><623>: Abbrev Number: 3 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0x2718): OverSampling
    <628>   DW_AT_decl_file   : 9
    <629>   DW_AT_decl_line   : 86
    <62a>   DW_AT_decl_column : 12
    <62b>   DW_AT_type        : <0x111>
    <62f>   DW_AT_data_member_location: 24
 <2><630>: Abbrev Number: 3 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0x22a5c): OneBitSampling
    <635>   DW_AT_decl_file   : 9
    <636>   DW_AT_decl_line   : 90
    <637>   DW_AT_decl_column : 12
    <638>   DW_AT_type        : <0x111>
    <63c>   DW_AT_data_member_location: 28
 <2><63d>: Abbrev Number: 3 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0x94fe0): ClockPrescaler
    <642>   DW_AT_decl_file   : 9
    <643>   DW_AT_decl_line   : 94
    <644>   DW_AT_decl_column : 12
    <645>   DW_AT_type        : <0x111>
    <649>   DW_AT_data_member_location: 32
 <2><64a>: Abbrev Number: 0
 <1><64b>: Abbrev Number: 5 (DW_TAG_typedef)
    <64c>   DW_AT_name        : (indirect string, offset: 0x2f8ef): UART_InitTypeDef
    <650>   DW_AT_decl_file   : 9
    <651>   DW_AT_decl_line   : 97
    <652>   DW_AT_decl_column : 3
    <653>   DW_AT_type        : <0x5cd>
 <1><657>: Abbrev Number: 17 (DW_TAG_structure_type)
    <658>   DW_AT_byte_size   : 40
    <659>   DW_AT_decl_file   : 9
    <65a>   DW_AT_decl_line   : 102
    <65b>   DW_AT_decl_column : 9
    <65b>   DW_AT_sibling     : <0x6e2>
 <2><65f>: Abbrev Number: 3 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x21724): AdvFeatureInit
    <664>   DW_AT_decl_file   : 9
    <665>   DW_AT_decl_line   : 104
    <666>   DW_AT_decl_column : 12
    <667>   DW_AT_type        : <0x111>
    <66b>   DW_AT_data_member_location: 0
 <2><66c>: Abbrev Number: 3 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0xf3ce): TxPinLevelInvert
    <671>   DW_AT_decl_file   : 9
    <672>   DW_AT_decl_line   : 109
    <673>   DW_AT_decl_column : 12
    <674>   DW_AT_type        : <0x111>
    <678>   DW_AT_data_member_location: 4
 <2><679>: Abbrev Number: 3 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0x8de56): RxPinLevelInvert
    <67e>   DW_AT_decl_file   : 9
    <67f>   DW_AT_decl_line   : 112
    <680>   DW_AT_decl_column : 12
    <681>   DW_AT_type        : <0x111>
    <685>   DW_AT_data_member_location: 8
 <2><686>: Abbrev Number: 3 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0x714de): DataInvert
    <68b>   DW_AT_decl_file   : 9
    <68c>   DW_AT_decl_line   : 115
    <68d>   DW_AT_decl_column : 12
    <68e>   DW_AT_type        : <0x111>
    <692>   DW_AT_data_member_location: 12
 <2><693>: Abbrev Number: 3 (DW_TAG_member)
    <694>   DW_AT_name        : (indirect string, offset: 0x35cbd): Swap
    <698>   DW_AT_decl_file   : 9
    <699>   DW_AT_decl_line   : 119
    <69a>   DW_AT_decl_column : 12
    <69b>   DW_AT_type        : <0x111>
    <69f>   DW_AT_data_member_location: 16
 <2><6a0>: Abbrev Number: 3 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x21954): OverrunDisable
    <6a5>   DW_AT_decl_file   : 9
    <6a6>   DW_AT_decl_line   : 122
    <6a7>   DW_AT_decl_column : 12
    <6a8>   DW_AT_type        : <0x111>
    <6ac>   DW_AT_data_member_location: 20
 <2><6ad>: Abbrev Number: 3 (DW_TAG_member)
    <6ae>   DW_AT_name        : (indirect string, offset: 0x62fb): DMADisableonRxError
    <6b2>   DW_AT_decl_file   : 9
    <6b3>   DW_AT_decl_line   : 125
    <6b4>   DW_AT_decl_column : 12
    <6b5>   DW_AT_type        : <0x111>
    <6b9>   DW_AT_data_member_location: 24
 <2><6ba>: Abbrev Number: 3 (DW_TAG_member)
    <6bb>   DW_AT_name        : (indirect string, offset: 0x4a266): AutoBaudRateEnable
    <6bf>   DW_AT_decl_file   : 9
    <6c0>   DW_AT_decl_line   : 128
    <6c1>   DW_AT_decl_column : 12
    <6c2>   DW_AT_type        : <0x111>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 3 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x8f53f): AutoBaudRateMode
    <6cc>   DW_AT_decl_file   : 9
    <6cd>   DW_AT_decl_line   : 131
    <6ce>   DW_AT_decl_column : 12
    <6cf>   DW_AT_type        : <0x111>
    <6d3>   DW_AT_data_member_location: 32
 <2><6d4>: Abbrev Number: 3 (DW_TAG_member)
    <6d5>   DW_AT_name        : (indirect string, offset: 0x4af92): MSBFirst
    <6d9>   DW_AT_decl_file   : 9
    <6da>   DW_AT_decl_line   : 135
    <6db>   DW_AT_decl_column : 12
    <6dc>   DW_AT_type        : <0x111>
    <6e0>   DW_AT_data_member_location: 36
 <2><6e1>: Abbrev Number: 0
 <1><6e2>: Abbrev Number: 5 (DW_TAG_typedef)
    <6e3>   DW_AT_name        : (indirect string, offset: 0x7cc52): UART_AdvFeatureInitTypeDef
    <6e7>   DW_AT_decl_file   : 9
    <6e8>   DW_AT_decl_line   : 137
    <6e9>   DW_AT_decl_column : 3
    <6ea>   DW_AT_type        : <0x657>
 <1><6ee>: Abbrev Number: 5 (DW_TAG_typedef)
    <6ef>   DW_AT_name        : (indirect string, offset: 0x3379d): HAL_UART_StateTypeDef
    <6f3>   DW_AT_decl_file   : 9
    <6f4>   DW_AT_decl_line   : 179
    <6f5>   DW_AT_decl_column : 18
    <6f6>   DW_AT_type        : <0x111>
 <1><6fa>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <6fb>   DW_AT_type        : <0x6ee>
 <1><6ff>: Abbrev Number: 5 (DW_TAG_typedef)
    <700>   DW_AT_name        : (indirect string, offset: 0x8df77): HAL_UART_RxTypeTypeDef
    <704>   DW_AT_decl_file   : 9
    <705>   DW_AT_decl_line   : 203
    <706>   DW_AT_decl_column : 18
    <707>   DW_AT_type        : <0x111>
 <1><70b>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <70c>   DW_AT_type        : <0x6ff>
 <1><710>: Abbrev Number: 5 (DW_TAG_typedef)
    <711>   DW_AT_name        : (indirect string, offset: 0x1502d): HAL_UART_RxEventTypeTypeDef
    <715>   DW_AT_decl_file   : 9
    <716>   DW_AT_decl_line   : 214
    <717>   DW_AT_decl_column : 18
    <718>   DW_AT_type        : <0x111>
 <1><71c>: Abbrev Number: 25 (DW_TAG_volatile_type)
    <71d>   DW_AT_type        : <0x710>
 <1><721>: Abbrev Number: 22 (DW_TAG_structure_type)
    <722>   DW_AT_name        : (indirect string, offset: 0x62170): __UART_HandleTypeDef
    <726>   DW_AT_byte_size   : 148
    <727>   DW_AT_decl_file   : 9
    <728>   DW_AT_decl_line   : 219
    <729>   DW_AT_decl_column : 16
    <72a>   DW_AT_sibling     : <0x860>
 <2><72e>: Abbrev Number: 3 (DW_TAG_member)
    <72f>   DW_AT_name        : (indirect string, offset: 0x42608): Instance
    <733>   DW_AT_decl_file   : 9
    <734>   DW_AT_decl_line   : 221
    <735>   DW_AT_decl_column : 29
    <736>   DW_AT_type        : <0x860>
    <73a>   DW_AT_data_member_location: 0
 <2><73b>: Abbrev Number: 3 (DW_TAG_member)
    <73c>   DW_AT_name        : (indirect string, offset: 0xaf388): Init
    <740>   DW_AT_decl_file   : 9
    <741>   DW_AT_decl_line   : 223
    <742>   DW_AT_decl_column : 28
    <743>   DW_AT_type        : <0x64b>
    <747>   DW_AT_data_member_location: 4
 <2><748>: Abbrev Number: 3 (DW_TAG_member)
    <749>   DW_AT_name        : (indirect string, offset: 0x83123): AdvancedInit
    <74d>   DW_AT_decl_file   : 9
    <74e>   DW_AT_decl_line   : 225
    <74f>   DW_AT_decl_column : 30
    <750>   DW_AT_type        : <0x6e2>
    <754>   DW_AT_data_member_location: 40
 <2><755>: Abbrev Number: 3 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0x5114f): pTxBuffPtr
    <75a>   DW_AT_decl_file   : 9
    <75b>   DW_AT_decl_line   : 227
    <75c>   DW_AT_decl_column : 29
    <75d>   DW_AT_type        : <0x865>
    <761>   DW_AT_data_member_location: 80
 <2><762>: Abbrev Number: 3 (DW_TAG_member)
    <763>   DW_AT_name        : (indirect string, offset: 0x5419): TxXferSize
    <767>   DW_AT_decl_file   : 9
    <768>   DW_AT_decl_line   : 229
    <769>   DW_AT_decl_column : 28
    <76a>   DW_AT_type        : <0xf4>
    <76e>   DW_AT_data_member_location: 84
 <2><76f>: Abbrev Number: 3 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x5d180): TxXferCount
    <774>   DW_AT_decl_file   : 9
    <775>   DW_AT_decl_line   : 231
    <776>   DW_AT_decl_column : 28
    <777>   DW_AT_type        : <0x100>
    <77b>   DW_AT_data_member_location: 86
 <2><77c>: Abbrev Number: 3 (DW_TAG_member)
    <77d>   DW_AT_name        : (indirect string, offset: 0x9ce2d): pRxBuffPtr
    <781>   DW_AT_decl_file   : 9
    <782>   DW_AT_decl_line   : 233
    <783>   DW_AT_decl_column : 29
    <784>   DW_AT_type        : <0x134>
    <788>   DW_AT_data_member_location: 88
 <2><789>: Abbrev Number: 3 (DW_TAG_member)
    <78a>   DW_AT_name        : (indirect string, offset: 0x5467e): RxXferSize
    <78e>   DW_AT_decl_file   : 9
    <78f>   DW_AT_decl_line   : 235
    <790>   DW_AT_decl_column : 28
    <791>   DW_AT_type        : <0xf4>
    <795>   DW_AT_data_member_location: 92
 <2><796>: Abbrev Number: 3 (DW_TAG_member)
    <797>   DW_AT_name        : (indirect string, offset: 0x65703): RxXferCount
    <79b>   DW_AT_decl_file   : 9
    <79c>   DW_AT_decl_line   : 237
    <79d>   DW_AT_decl_column : 28
    <79e>   DW_AT_type        : <0x100>
    <7a2>   DW_AT_data_member_location: 94
 <2><7a3>: Abbrev Number: 3 (DW_TAG_member)
    <7a4>   DW_AT_name        : (indirect string, offset: 0xbbce1): Mask
    <7a8>   DW_AT_decl_file   : 9
    <7a9>   DW_AT_decl_line   : 239
    <7aa>   DW_AT_decl_column : 28
    <7ab>   DW_AT_type        : <0xf4>
    <7af>   DW_AT_data_member_location: 96
 <2><7b0>: Abbrev Number: 3 (DW_TAG_member)
    <7b1>   DW_AT_name        : (indirect string, offset: 0xae504): FifoMode
    <7b5>   DW_AT_decl_file   : 9
    <7b6>   DW_AT_decl_line   : 241
    <7b7>   DW_AT_decl_column : 28
    <7b8>   DW_AT_type        : <0x111>
    <7bc>   DW_AT_data_member_location: 100
 <2><7bd>: Abbrev Number: 3 (DW_TAG_member)
    <7be>   DW_AT_name        : (indirect string, offset: 0x4e34d): NbRxDataToProcess
    <7c2>   DW_AT_decl_file   : 9
    <7c3>   DW_AT_decl_line   : 244
    <7c4>   DW_AT_decl_column : 28
    <7c5>   DW_AT_type        : <0xf4>
    <7c9>   DW_AT_data_member_location: 104
 <2><7ca>: Abbrev Number: 3 (DW_TAG_member)
    <7cb>   DW_AT_name        : (indirect string, offset: 0x2942c): NbTxDataToProcess
    <7cf>   DW_AT_decl_file   : 9
    <7d0>   DW_AT_decl_line   : 246
    <7d1>   DW_AT_decl_column : 28
    <7d2>   DW_AT_type        : <0xf4>
    <7d6>   DW_AT_data_member_location: 106
 <2><7d7>: Abbrev Number: 3 (DW_TAG_member)
    <7d8>   DW_AT_name        : (indirect string, offset: 0x8d0a6): ReceptionType
    <7dc>   DW_AT_decl_file   : 9
    <7dd>   DW_AT_decl_line   : 248
    <7de>   DW_AT_decl_column : 31
    <7df>   DW_AT_type        : <0x70b>
    <7e3>   DW_AT_data_member_location: 108
 <2><7e4>: Abbrev Number: 3 (DW_TAG_member)
    <7e5>   DW_AT_name        : (indirect string, offset: 0xb39d0): RxEventType
    <7e9>   DW_AT_decl_file   : 9
    <7ea>   DW_AT_decl_line   : 250
    <7eb>   DW_AT_decl_column : 36
    <7ec>   DW_AT_type        : <0x71c>
    <7f0>   DW_AT_data_member_location: 112
 <2><7f1>: Abbrev Number: 3 (DW_TAG_member)
    <7f2>   DW_AT_name        : (indirect string, offset: 0x9159a): RxISR
    <7f6>   DW_AT_decl_file   : 9
    <7f7>   DW_AT_decl_line   : 252
    <7f8>   DW_AT_decl_column : 10
    <7f9>   DW_AT_type        : <0x87a>
    <7fd>   DW_AT_data_member_location: 116
 <2><7fe>: Abbrev Number: 3 (DW_TAG_member)
    <7ff>   DW_AT_name        : (indirect string, offset: 0x54f8e): TxISR
    <803>   DW_AT_decl_file   : 9
    <804>   DW_AT_decl_line   : 254
    <805>   DW_AT_decl_column : 10
    <806>   DW_AT_type        : <0x87a>
    <80a>   DW_AT_data_member_location: 120
 <2><80b>: Abbrev Number: 4 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x8a313): hdmatx
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 256
    <813>   DW_AT_decl_column : 29
    <814>   DW_AT_type        : <0x5c8>
    <818>   DW_AT_data_member_location: 124
 <2><819>: Abbrev Number: 4 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0xa46b7): hdmarx
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 258
    <821>   DW_AT_decl_column : 29
    <822>   DW_AT_type        : <0x5c8>
    <826>   DW_AT_data_member_location: 128
 <2><827>: Abbrev Number: 4 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x77995): Lock
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 260
    <82f>   DW_AT_decl_column : 29
    <830>   DW_AT_type        : <0x3aa>
    <834>   DW_AT_data_member_location: 132
 <2><835>: Abbrev Number: 4 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x45066): gState
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 262
    <83d>   DW_AT_decl_column : 33
    <83e>   DW_AT_type        : <0x6fa>
    <842>   DW_AT_data_member_location: 136
 <2><843>: Abbrev Number: 4 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x98752): RxState
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 266
    <84b>   DW_AT_decl_column : 33
    <84c>   DW_AT_type        : <0x6fa>
    <850>   DW_AT_data_member_location: 140
 <2><851>: Abbrev Number: 4 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0xa5ba0): ErrorCode
    <856>   DW_AT_decl_file   : 9
    <857>   DW_AT_decl_line   : 269
    <859>   DW_AT_decl_column : 33
    <85a>   DW_AT_type        : <0x11d>
    <85e>   DW_AT_data_member_location: 144
 <2><85f>: Abbrev Number: 0
 <1><860>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <861>   DW_AT_byte_size   : 4
    <861>   DW_AT_type        : <0x34f>
 <1><865>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <866>   DW_AT_byte_size   : 4
    <866>   DW_AT_type        : <0xe3>
 <1><86a>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <86b>   DW_AT_prototyped  : 1
    <86b>   DW_AT_sibling     : <0x875>
 <2><86f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <870>   DW_AT_type        : <0x875>
 <2><874>: Abbrev Number: 0
 <1><875>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <876>   DW_AT_byte_size   : 4
    <876>   DW_AT_type        : <0x721>
 <1><87a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <87b>   DW_AT_byte_size   : 4
    <87b>   DW_AT_type        : <0x86a>
 <1><87f>: Abbrev Number: 13 (DW_TAG_typedef)
    <880>   DW_AT_name        : (indirect string, offset: 0x62172): UART_HandleTypeDef
    <884>   DW_AT_decl_file   : 9
    <885>   DW_AT_decl_line   : 289
    <887>   DW_AT_decl_column : 3
    <888>   DW_AT_type        : <0x721>
 <1><88c>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <88d>   DW_AT_encoding    : 5	(signed)
    <88e>   DW_AT_byte_size   : 4
    <88f>   DW_AT_type        : <0x2a>
    <893>   DW_AT_decl_file   : 10
    <894>   DW_AT_decl_line   : 82
    <895>   DW_AT_decl_column : 14
    <896>   DW_AT_sibling     : <0x9d8>
 <2><89a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <89b>   DW_AT_name        : (indirect string, offset: 0x320f4): osPriorityNone
    <89f>   DW_AT_const_value : 0
 <2><8a0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8a1>   DW_AT_name        : (indirect string, offset: 0x92868): osPriorityIdle
    <8a5>   DW_AT_const_value : 1
 <2><8a6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x9bd10): osPriorityLow
    <8ab>   DW_AT_const_value : 8
 <2><8ac>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ad>   DW_AT_name        : (indirect string, offset: 0xa0d06): osPriorityLow1
    <8b1>   DW_AT_const_value : 9
 <2><8b2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8b3>   DW_AT_name        : (indirect string, offset: 0xa0d15): osPriorityLow2
    <8b7>   DW_AT_const_value : 10
 <2><8b8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8b9>   DW_AT_name        : (indirect string, offset: 0xa0d24): osPriorityLow3
    <8bd>   DW_AT_const_value : 11
 <2><8be>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8bf>   DW_AT_name        : (indirect string, offset: 0xa0d33): osPriorityLow4
    <8c3>   DW_AT_const_value : 12
 <2><8c4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8c5>   DW_AT_name        : (indirect string, offset: 0x3f689): osPriorityLow5
    <8c9>   DW_AT_const_value : 13
 <2><8ca>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xa0d6e): osPriorityLow6
    <8cf>   DW_AT_const_value : 14
 <2><8d0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x264c0): osPriorityLow7
    <8d5>   DW_AT_const_value : 15
 <2><8d6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8d7>   DW_AT_name        : (indirect string, offset: 0xa2f94): osPriorityBelowNormal
    <8db>   DW_AT_const_value : 16
 <2><8dc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x80661): osPriorityBelowNormal1
    <8e1>   DW_AT_const_value : 17
 <2><8e2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e3>   DW_AT_name        : (indirect string, offset: 0x8f224): osPriorityBelowNormal2
    <8e7>   DW_AT_const_value : 18
 <2><8e8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e9>   DW_AT_name        : (indirect string, offset: 0x8f23b): osPriorityBelowNormal3
    <8ed>   DW_AT_const_value : 19
 <2><8ee>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8ef>   DW_AT_name        : (indirect string, offset: 0x806e8): osPriorityBelowNormal4
    <8f3>   DW_AT_const_value : 20
 <2><8f4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x80727): osPriorityBelowNormal5
    <8f9>   DW_AT_const_value : 21
 <2><8fa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8fb>   DW_AT_name        : (indirect string, offset: 0x8f2c0): osPriorityBelowNormal6
    <8ff>   DW_AT_const_value : 22
 <2><900>: Abbrev Number: 1 (DW_TAG_enumerator)
    <901>   DW_AT_name        : (indirect string, offset: 0x80761): osPriorityBelowNormal7
    <905>   DW_AT_const_value : 23
 <2><906>: Abbrev Number: 1 (DW_TAG_enumerator)
    <907>   DW_AT_name        : (indirect string, offset: 0x54753): osPriorityNormal
    <90b>   DW_AT_const_value : 24
 <2><90c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <90d>   DW_AT_name        : (indirect string, offset: 0x1b2fc): osPriorityNormal1
    <911>   DW_AT_const_value : 25
 <2><912>: Abbrev Number: 1 (DW_TAG_enumerator)
    <913>   DW_AT_name        : (indirect string, offset: 0x1b30e): osPriorityNormal2
    <917>   DW_AT_const_value : 26
 <2><918>: Abbrev Number: 1 (DW_TAG_enumerator)
    <919>   DW_AT_name        : (indirect string, offset: 0x1b320): osPriorityNormal3
    <91d>   DW_AT_const_value : 27
 <2><91e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <91f>   DW_AT_name        : (indirect string, offset: 0x1b332): osPriorityNormal4
    <923>   DW_AT_const_value : 28
 <2><924>: Abbrev Number: 1 (DW_TAG_enumerator)
    <925>   DW_AT_name        : (indirect string, offset: 0x1b344): osPriorityNormal5
    <929>   DW_AT_const_value : 29
 <2><92a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <92b>   DW_AT_name        : (indirect string, offset: 0x1b356): osPriorityNormal6
    <92f>   DW_AT_const_value : 30
 <2><930>: Abbrev Number: 1 (DW_TAG_enumerator)
    <931>   DW_AT_name        : (indirect string, offset: 0x1b368): osPriorityNormal7
    <935>   DW_AT_const_value : 31
 <2><936>: Abbrev Number: 1 (DW_TAG_enumerator)
    <937>   DW_AT_name        : (indirect string, offset: 0x6b96a): osPriorityAboveNormal
    <93b>   DW_AT_const_value : 32
 <2><93c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <93d>   DW_AT_name        : (indirect string, offset: 0xa9400): osPriorityAboveNormal1
    <941>   DW_AT_const_value : 33
 <2><942>: Abbrev Number: 1 (DW_TAG_enumerator)
    <943>   DW_AT_name        : (indirect string, offset: 0x9f685): osPriorityAboveNormal2
    <947>   DW_AT_const_value : 34
 <2><948>: Abbrev Number: 1 (DW_TAG_enumerator)
    <949>   DW_AT_name        : (indirect string, offset: 0xa9437): osPriorityAboveNormal3
    <94d>   DW_AT_const_value : 35
 <2><94e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <94f>   DW_AT_name        : (indirect string, offset: 0xa944e): osPriorityAboveNormal4
    <953>   DW_AT_const_value : 36
 <2><954>: Abbrev Number: 1 (DW_TAG_enumerator)
    <955>   DW_AT_name        : (indirect string, offset: 0xa9465): osPriorityAboveNormal5
    <959>   DW_AT_const_value : 37
 <2><95a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <95b>   DW_AT_name        : (indirect string, offset: 0xa947c): osPriorityAboveNormal6
    <95f>   DW_AT_const_value : 38
 <2><960>: Abbrev Number: 1 (DW_TAG_enumerator)
    <961>   DW_AT_name        : (indirect string, offset: 0xa9493): osPriorityAboveNormal7
    <965>   DW_AT_const_value : 39
 <2><966>: Abbrev Number: 1 (DW_TAG_enumerator)
    <967>   DW_AT_name        : (indirect string, offset: 0x3cbdc): osPriorityHigh
    <96b>   DW_AT_const_value : 40
 <2><96c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <96d>   DW_AT_name        : (indirect string, offset: 0x6f248): osPriorityHigh1
    <971>   DW_AT_const_value : 41
 <2><972>: Abbrev Number: 1 (DW_TAG_enumerator)
    <973>   DW_AT_name        : (indirect string, offset: 0x6f258): osPriorityHigh2
    <977>   DW_AT_const_value : 42
 <2><978>: Abbrev Number: 1 (DW_TAG_enumerator)
    <979>   DW_AT_name        : (indirect string, offset: 0x6f268): osPriorityHigh3
    <97d>   DW_AT_const_value : 43
 <2><97e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <97f>   DW_AT_name        : (indirect string, offset: 0x6f278): osPriorityHigh4
    <983>   DW_AT_const_value : 44
 <2><984>: Abbrev Number: 1 (DW_TAG_enumerator)
    <985>   DW_AT_name        : (indirect string, offset: 0x6f288): osPriorityHigh5
    <989>   DW_AT_const_value : 45
 <2><98a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <98b>   DW_AT_name        : (indirect string, offset: 0x6f298): osPriorityHigh6
    <98f>   DW_AT_const_value : 46
 <2><990>: Abbrev Number: 1 (DW_TAG_enumerator)
    <991>   DW_AT_name        : (indirect string, offset: 0x6f2a8): osPriorityHigh7
    <995>   DW_AT_const_value : 47
 <2><996>: Abbrev Number: 1 (DW_TAG_enumerator)
    <997>   DW_AT_name        : (indirect string, offset: 0x995ce): osPriorityRealtime
    <99b>   DW_AT_const_value : 48
 <2><99c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <99d>   DW_AT_name        : (indirect string, offset: 0x69882): osPriorityRealtime1
    <9a1>   DW_AT_const_value : 49
 <2><9a2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a3>   DW_AT_name        : (indirect string, offset: 0x96481): osPriorityRealtime2
    <9a7>   DW_AT_const_value : 50
 <2><9a8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x698c4): osPriorityRealtime3
    <9ad>   DW_AT_const_value : 51
 <2><9ae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9af>   DW_AT_name        : (indirect string, offset: 0x698d8): osPriorityRealtime4
    <9b3>   DW_AT_const_value : 52
 <2><9b4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b5>   DW_AT_name        : (indirect string, offset: 0x698ec): osPriorityRealtime5
    <9b9>   DW_AT_const_value : 53
 <2><9ba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9bb>   DW_AT_name        : (indirect string, offset: 0x967b2): osPriorityRealtime6
    <9bf>   DW_AT_const_value : 54
 <2><9c0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c1>   DW_AT_name        : (indirect string, offset: 0x69916): osPriorityRealtime7
    <9c5>   DW_AT_const_value : 55
 <2><9c6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c7>   DW_AT_name        : (indirect string, offset: 0xb54): osPriorityISR
    <9cb>   DW_AT_const_value : 56
 <2><9cc>: Abbrev Number: 23 (DW_TAG_enumerator)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x953d0): osPriorityError
    <9d1>   DW_AT_const_value : -1
 <2><9d2>: Abbrev Number: 34 (DW_TAG_enumerator)
    <9d3>   DW_AT_name        : (indirect string, offset: 0xa117f): osPriorityReserved
    <9d7>   DW_AT_const_value : 2147483647
 <2><9d7>: Abbrev Number: 0
 <1><9d8>: Abbrev Number: 5 (DW_TAG_typedef)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x38327): osPriority_t
    <9dd>   DW_AT_decl_file   : 10
    <9de>   DW_AT_decl_line   : 136
    <9df>   DW_AT_decl_column : 3
    <9e0>   DW_AT_type        : <0x88c>
 <1><9e4>: Abbrev Number: 5 (DW_TAG_typedef)
    <9e5>   DW_AT_name        : (indirect string, offset: 0x90092): osThreadFunc_t
    <9e9>   DW_AT_decl_file   : 10
    <9ea>   DW_AT_decl_line   : 139
    <9eb>   DW_AT_decl_column : 16
    <9ec>   DW_AT_type        : <0x122>
 <1><9f0>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <9f1>   DW_AT_encoding    : 5	(signed)
    <9f2>   DW_AT_byte_size   : 4
    <9f3>   DW_AT_type        : <0x2a>
    <9f7>   DW_AT_decl_file   : 10
    <9f8>   DW_AT_decl_line   : 176
    <9f9>   DW_AT_decl_column : 14
    <9fa>   DW_AT_sibling     : <0xa2e>
 <2><9fe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x951e0): osOK
    <a03>   DW_AT_const_value : 0
 <2><a04>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a05>   DW_AT_name        : (indirect string, offset: 0x4e40e): osError
    <a09>   DW_AT_const_value : -1
 <2><a0a>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x6e707): osErrorTimeout
    <a0f>   DW_AT_const_value : -2
 <2><a10>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a11>   DW_AT_name        : (indirect string, offset: 0x6dcc5): osErrorResource
    <a15>   DW_AT_const_value : -3
 <2><a16>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a17>   DW_AT_name        : (indirect string, offset: 0x2c08f): osErrorParameter
    <a1b>   DW_AT_const_value : -4
 <2><a1c>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a1d>   DW_AT_name        : (indirect string, offset: 0x1d725): osErrorNoMemory
    <a21>   DW_AT_const_value : -5
 <2><a22>: Abbrev Number: 23 (DW_TAG_enumerator)
    <a23>   DW_AT_name        : (indirect string, offset: 0x2da8b): osErrorISR
    <a27>   DW_AT_const_value : -6
 <2><a28>: Abbrev Number: 34 (DW_TAG_enumerator)
    <a29>   DW_AT_name        : (indirect string, offset: 0x33f6a): osStatusReserved
    <a2d>   DW_AT_const_value : 2147483647
 <2><a2d>: Abbrev Number: 0
 <1><a2e>: Abbrev Number: 5 (DW_TAG_typedef)
    <a2f>   DW_AT_name        : (indirect string, offset: 0x39b11): osStatus_t
    <a33>   DW_AT_decl_file   : 10
    <a34>   DW_AT_decl_line   : 185
    <a35>   DW_AT_decl_column : 3
    <a36>   DW_AT_type        : <0x9f0>
 <1><a3a>: Abbrev Number: 5 (DW_TAG_typedef)
    <a3b>   DW_AT_name        : (indirect string, offset: 0x3cafe): osThreadId_t
    <a3f>   DW_AT_decl_file   : 10
    <a40>   DW_AT_decl_line   : 189
    <a41>   DW_AT_decl_column : 15
    <a42>   DW_AT_type        : <0x132>
 <1><a46>: Abbrev Number: 5 (DW_TAG_typedef)
    <a47>   DW_AT_name        : (indirect string, offset: 0x950a4): osEventFlagsId_t
    <a4b>   DW_AT_decl_file   : 10
    <a4c>   DW_AT_decl_line   : 195
    <a4d>   DW_AT_decl_column : 15
    <a4e>   DW_AT_type        : <0x132>
 <1><a52>: Abbrev Number: 5 (DW_TAG_typedef)
    <a53>   DW_AT_name        : (indirect string, offset: 0xa7fae): osMutexId_t
    <a57>   DW_AT_decl_file   : 10
    <a58>   DW_AT_decl_line   : 198
    <a59>   DW_AT_decl_column : 15
    <a5a>   DW_AT_type        : <0x132>
 <1><a5e>: Abbrev Number: 5 (DW_TAG_typedef)
    <a5f>   DW_AT_name        : (indirect string, offset: 0x4c806): osMessageQueueId_t
    <a63>   DW_AT_decl_file   : 10
    <a64>   DW_AT_decl_line   : 207
    <a65>   DW_AT_decl_column : 15
    <a66>   DW_AT_type        : <0x132>
 <1><a6a>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6b>   DW_AT_name        : (indirect string, offset: 0x70d67): TZ_ModuleId_t
    <a6f>   DW_AT_decl_file   : 10
    <a70>   DW_AT_decl_line   : 213
    <a71>   DW_AT_decl_column : 18
    <a72>   DW_AT_type        : <0x111>
 <1><a76>: Abbrev Number: 17 (DW_TAG_structure_type)
    <a77>   DW_AT_byte_size   : 36
    <a78>   DW_AT_decl_file   : 10
    <a79>   DW_AT_decl_line   : 218
    <a7a>   DW_AT_decl_column : 9
    <a7a>   DW_AT_sibling     : <0xaf4>
 <2><a7e>: Abbrev Number: 3 (DW_TAG_member)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x6fef1): name
    <a83>   DW_AT_decl_file   : 10
    <a84>   DW_AT_decl_line   : 219
    <a85>   DW_AT_decl_column : 33
    <a86>   DW_AT_type        : <0x150>
    <a8a>   DW_AT_data_member_location: 0
 <2><a8b>: Abbrev Number: 3 (DW_TAG_member)
    <a8c>   DW_AT_name        : (indirect string, offset: 0x6c852): attr_bits
    <a90>   DW_AT_decl_file   : 10
    <a91>   DW_AT_decl_line   : 220
    <a92>   DW_AT_decl_column : 28
    <a93>   DW_AT_type        : <0x111>
    <a97>   DW_AT_data_member_location: 4
 <2><a98>: Abbrev Number: 3 (DW_TAG_member)
    <a99>   DW_AT_name        : (indirect string, offset: 0x214c3): cb_mem
    <a9d>   DW_AT_decl_file   : 10
    <a9e>   DW_AT_decl_line   : 221
    <a9f>   DW_AT_decl_column : 30
    <aa0>   DW_AT_type        : <0x132>
    <aa4>   DW_AT_data_member_location: 8
 <2><aa5>: Abbrev Number: 3 (DW_TAG_member)
    <aa6>   DW_AT_name        : (indirect string, offset: 0xa064d): cb_size
    <aaa>   DW_AT_decl_file   : 10
    <aab>   DW_AT_decl_line   : 222
    <aac>   DW_AT_decl_column : 30
    <aad>   DW_AT_type        : <0x111>
    <ab1>   DW_AT_data_member_location: 12
 <2><ab2>: Abbrev Number: 3 (DW_TAG_member)
    <ab3>   DW_AT_name        : (indirect string, offset: 0x99b36): stack_mem
    <ab7>   DW_AT_decl_file   : 10
    <ab8>   DW_AT_decl_line   : 223
    <ab9>   DW_AT_decl_column : 27
    <aba>   DW_AT_type        : <0x132>
    <abe>   DW_AT_data_member_location: 16
 <2><abf>: Abbrev Number: 3 (DW_TAG_member)
    <ac0>   DW_AT_name        : (indirect string, offset: 0x69985): stack_size
    <ac4>   DW_AT_decl_file   : 10
    <ac5>   DW_AT_decl_line   : 224
    <ac6>   DW_AT_decl_column : 27
    <ac7>   DW_AT_type        : <0x111>
    <acb>   DW_AT_data_member_location: 20
 <2><acc>: Abbrev Number: 3 (DW_TAG_member)
    <acd>   DW_AT_name        : (indirect string, offset: 0x43632): priority
    <ad1>   DW_AT_decl_file   : 10
    <ad2>   DW_AT_decl_line   : 225
    <ad3>   DW_AT_decl_column : 29
    <ad4>   DW_AT_type        : <0x9d8>
    <ad8>   DW_AT_data_member_location: 24
 <2><ad9>: Abbrev Number: 3 (DW_TAG_member)
    <ada>   DW_AT_name        : (indirect string, offset: 0x49c99): tz_module
    <ade>   DW_AT_decl_file   : 10
    <adf>   DW_AT_decl_line   : 226
    <ae0>   DW_AT_decl_column : 28
    <ae1>   DW_AT_type        : <0xa6a>
    <ae5>   DW_AT_data_member_location: 28
 <2><ae6>: Abbrev Number: 3 (DW_TAG_member)
    <ae7>   DW_AT_name        : (indirect string, offset: 0x97db4): reserved
    <aeb>   DW_AT_decl_file   : 10
    <aec>   DW_AT_decl_line   : 227
    <aed>   DW_AT_decl_column : 29
    <aee>   DW_AT_type        : <0x111>
    <af2>   DW_AT_data_member_location: 32
 <2><af3>: Abbrev Number: 0
 <1><af4>: Abbrev Number: 5 (DW_TAG_typedef)
    <af5>   DW_AT_name        : (indirect string, offset: 0x1b1bb): osThreadAttr_t
    <af9>   DW_AT_decl_file   : 10
    <afa>   DW_AT_decl_line   : 228
    <afb>   DW_AT_decl_column : 3
    <afc>   DW_AT_type        : <0xa76>
 <1><b00>: Abbrev Number: 19 (DW_TAG_const_type)
    <b01>   DW_AT_type        : <0xaf4>
 <1><b05>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b06>   DW_AT_byte_size   : 16
    <b07>   DW_AT_decl_file   : 10
    <b08>   DW_AT_decl_line   : 239
    <b09>   DW_AT_decl_column : 9
    <b09>   DW_AT_sibling     : <0xb42>
 <2><b0d>: Abbrev Number: 3 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x6fef1): name
    <b12>   DW_AT_decl_file   : 10
    <b13>   DW_AT_decl_line   : 240
    <b14>   DW_AT_decl_column : 33
    <b15>   DW_AT_type        : <0x150>
    <b19>   DW_AT_data_member_location: 0
 <2><b1a>: Abbrev Number: 3 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x6c852): attr_bits
    <b1f>   DW_AT_decl_file   : 10
    <b20>   DW_AT_decl_line   : 241
    <b21>   DW_AT_decl_column : 28
    <b22>   DW_AT_type        : <0x111>
    <b26>   DW_AT_data_member_location: 4
 <2><b27>: Abbrev Number: 3 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0x214c3): cb_mem
    <b2c>   DW_AT_decl_file   : 10
    <b2d>   DW_AT_decl_line   : 242
    <b2e>   DW_AT_decl_column : 30
    <b2f>   DW_AT_type        : <0x132>
    <b33>   DW_AT_data_member_location: 8
 <2><b34>: Abbrev Number: 3 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0xa064d): cb_size
    <b39>   DW_AT_decl_file   : 10
    <b3a>   DW_AT_decl_line   : 243
    <b3b>   DW_AT_decl_column : 30
    <b3c>   DW_AT_type        : <0x111>
    <b40>   DW_AT_data_member_location: 12
 <2><b41>: Abbrev Number: 0
 <1><b42>: Abbrev Number: 5 (DW_TAG_typedef)
    <b43>   DW_AT_name        : (indirect string, offset: 0x7a37d): osEventFlagsAttr_t
    <b47>   DW_AT_decl_file   : 10
    <b48>   DW_AT_decl_line   : 244
    <b49>   DW_AT_decl_column : 3
    <b4a>   DW_AT_type        : <0xb05>
 <1><b4e>: Abbrev Number: 19 (DW_TAG_const_type)
    <b4f>   DW_AT_type        : <0xb42>
 <1><b53>: Abbrev Number: 17 (DW_TAG_structure_type)
    <b54>   DW_AT_byte_size   : 16
    <b55>   DW_AT_decl_file   : 10
    <b56>   DW_AT_decl_line   : 247
    <b57>   DW_AT_decl_column : 9
    <b57>   DW_AT_sibling     : <0xb90>
 <2><b5b>: Abbrev Number: 3 (DW_TAG_member)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x6fef1): name
    <b60>   DW_AT_decl_file   : 10
    <b61>   DW_AT_decl_line   : 248
    <b62>   DW_AT_decl_column : 33
    <b63>   DW_AT_type        : <0x150>
    <b67>   DW_AT_data_member_location: 0
 <2><b68>: Abbrev Number: 3 (DW_TAG_member)
    <b69>   DW_AT_name        : (indirect string, offset: 0x6c852): attr_bits
    <b6d>   DW_AT_decl_file   : 10
    <b6e>   DW_AT_decl_line   : 249
    <b6f>   DW_AT_decl_column : 28
    <b70>   DW_AT_type        : <0x111>
    <b74>   DW_AT_data_member_location: 4
 <2><b75>: Abbrev Number: 3 (DW_TAG_member)
    <b76>   DW_AT_name        : (indirect string, offset: 0x214c3): cb_mem
    <b7a>   DW_AT_decl_file   : 10
    <b7b>   DW_AT_decl_line   : 250
    <b7c>   DW_AT_decl_column : 30
    <b7d>   DW_AT_type        : <0x132>
    <b81>   DW_AT_data_member_location: 8
 <2><b82>: Abbrev Number: 3 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xa064d): cb_size
    <b87>   DW_AT_decl_file   : 10
    <b88>   DW_AT_decl_line   : 251
    <b89>   DW_AT_decl_column : 30
    <b8a>   DW_AT_type        : <0x111>
    <b8e>   DW_AT_data_member_location: 12
 <2><b8f>: Abbrev Number: 0
 <1><b90>: Abbrev Number: 5 (DW_TAG_typedef)
    <b91>   DW_AT_name        : (indirect string, offset: 0x5db8a): osMutexAttr_t
    <b95>   DW_AT_decl_file   : 10
    <b96>   DW_AT_decl_line   : 252
    <b97>   DW_AT_decl_column : 3
    <b98>   DW_AT_type        : <0xb53>
 <1><b9c>: Abbrev Number: 19 (DW_TAG_const_type)
    <b9d>   DW_AT_type        : <0xb90>
 <1><ba1>: Abbrev Number: 20 (DW_TAG_structure_type)
    <ba2>   DW_AT_byte_size   : 24
    <ba3>   DW_AT_decl_file   : 10
    <ba4>   DW_AT_decl_line   : 273
    <ba6>   DW_AT_decl_column : 9
    <ba6>   DW_AT_sibling     : <0xbff>
 <2><baa>: Abbrev Number: 4 (DW_TAG_member)
    <bab>   DW_AT_name        : (indirect string, offset: 0x6fef1): name
    <baf>   DW_AT_decl_file   : 10
    <bb0>   DW_AT_decl_line   : 274
    <bb2>   DW_AT_decl_column : 33
    <bb3>   DW_AT_type        : <0x150>
    <bb7>   DW_AT_data_member_location: 0
 <2><bb8>: Abbrev Number: 4 (DW_TAG_member)
    <bb9>   DW_AT_name        : (indirect string, offset: 0x6c852): attr_bits
    <bbd>   DW_AT_decl_file   : 10
    <bbe>   DW_AT_decl_line   : 275
    <bc0>   DW_AT_decl_column : 28
    <bc1>   DW_AT_type        : <0x111>
    <bc5>   DW_AT_data_member_location: 4
 <2><bc6>: Abbrev Number: 4 (DW_TAG_member)
    <bc7>   DW_AT_name        : (indirect string, offset: 0x214c3): cb_mem
    <bcb>   DW_AT_decl_file   : 10
    <bcc>   DW_AT_decl_line   : 276
    <bce>   DW_AT_decl_column : 30
    <bcf>   DW_AT_type        : <0x132>
    <bd3>   DW_AT_data_member_location: 8
 <2><bd4>: Abbrev Number: 4 (DW_TAG_member)
    <bd5>   DW_AT_name        : (indirect string, offset: 0xa064d): cb_size
    <bd9>   DW_AT_decl_file   : 10
    <bda>   DW_AT_decl_line   : 277
    <bdc>   DW_AT_decl_column : 30
    <bdd>   DW_AT_type        : <0x111>
    <be1>   DW_AT_data_member_location: 12
 <2><be2>: Abbrev Number: 4 (DW_TAG_member)
    <be3>   DW_AT_name        : (indirect string, offset: 0x43043): mq_mem
    <be7>   DW_AT_decl_file   : 10
    <be8>   DW_AT_decl_line   : 278
    <bea>   DW_AT_decl_column : 30
    <beb>   DW_AT_type        : <0x132>
    <bef>   DW_AT_data_member_location: 16
 <2><bf0>: Abbrev Number: 4 (DW_TAG_member)
    <bf1>   DW_AT_name        : (indirect string, offset: 0x96c5e): mq_size
    <bf5>   DW_AT_decl_file   : 10
    <bf6>   DW_AT_decl_line   : 279
    <bf8>   DW_AT_decl_column : 30
    <bf9>   DW_AT_type        : <0x111>
    <bfd>   DW_AT_data_member_location: 20
 <2><bfe>: Abbrev Number: 0
 <1><bff>: Abbrev Number: 13 (DW_TAG_typedef)
    <c00>   DW_AT_name        : (indirect string, offset: 0x8ffb4): osMessageQueueAttr_t
    <c04>   DW_AT_decl_file   : 10
    <c05>   DW_AT_decl_line   : 280
    <c07>   DW_AT_decl_column : 3
    <c08>   DW_AT_type        : <0xba1>
 <1><c0c>: Abbrev Number: 19 (DW_TAG_const_type)
    <c0d>   DW_AT_type        : <0xbff>
 <1><c11>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <c12>   DW_AT_byte_size   : 4
    <c12>   DW_AT_type        : <0xc16>
 <1><c16>: Abbrev Number: 45 (DW_TAG_const_type)
 <1><c17>: Abbrev Number: 46 (DW_TAG_variable)
    <c18>   DW_AT_name        : (indirect string, offset: 0x5b238): huart1
    <c1c>   DW_AT_decl_file   : 15
    <c1d>   DW_AT_decl_line   : 35
    <c1e>   DW_AT_decl_column : 27
    <c1f>   DW_AT_type        : <0x87f>
    <c23>   DW_AT_external    : 1
    <c23>   DW_AT_declaration : 1
 <1><c23>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <c24>   DW_AT_name        : (indirect string, offset: 0x8d417): radio_status_e
    <c28>   DW_AT_encoding    : 7	(unsigned)
    <c28>   DW_AT_byte_size   : 1
    <c28>   DW_AT_type        : <0x71>
    <c2c>   DW_AT_decl_file   : 11
    <c2d>   DW_AT_decl_line   : 52
    <c2e>   DW_AT_decl_column : 14
    <c2e>   DW_AT_sibling     : <0xc4b>
 <2><c32>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c33>   DW_AT_name        : (indirect string, offset: 0x67228): RADIO_STATUS_OK
    <c37>   DW_AT_const_value : 0
 <2><c38>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c39>   DW_AT_name        : (indirect string, offset: 0x7e90): RADIO_STATUS_UNSUPPORTED_FEATURE
    <c3d>   DW_AT_const_value : 1
 <2><c3e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x12706): RADIO_STATUS_UNKNOWN_VALUE
    <c43>   DW_AT_const_value : 2
 <2><c44>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c45>   DW_AT_name        : (indirect string, offset: 0xa42d3): RADIO_STATUS_ERROR
    <c49>   DW_AT_const_value : 3
 <2><c4a>: Abbrev Number: 0
 <1><c4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <c4c>   DW_AT_name        : (indirect string, offset: 0x8d597): radio_status_t
    <c50>   DW_AT_decl_file   : 11
    <c51>   DW_AT_decl_line   : 58
    <c52>   DW_AT_decl_column : 3
    <c53>   DW_AT_type        : <0xc23>
 <1><c57>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <c58>   DW_AT_encoding    : 7	(unsigned)
    <c59>   DW_AT_byte_size   : 1
    <c5a>   DW_AT_type        : <0x71>
    <c5e>   DW_AT_decl_file   : 11
    <c5f>   DW_AT_decl_line   : 64
    <c60>   DW_AT_decl_column : 1
    <c61>   DW_AT_sibling     : <0xc8a>
 <2><c65>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c66>   DW_AT_name        : (indirect string, offset: 0x878c9): MODEM_FSK
    <c6a>   DW_AT_const_value : 0
 <2><c6b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c6c>   DW_AT_name        : (indirect string, offset: 0x8d2f6): MODEM_LORA
    <c70>   DW_AT_const_value : 1
 <2><c71>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c72>   DW_AT_name        : (indirect string, offset: 0x805dc): MODEM_MSK
    <c76>   DW_AT_const_value : 2
 <2><c77>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c78>   DW_AT_name        : (indirect string, offset: 0x16de9): MODEM_BPSK
    <c7c>   DW_AT_const_value : 3
 <2><c7d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x83935): MODEM_SIGFOX_TX
    <c82>   DW_AT_const_value : 4
 <2><c83>: Abbrev Number: 1 (DW_TAG_enumerator)
    <c84>   DW_AT_name        : (indirect string, offset: 0x83020): MODEM_SIGFOX_RX
    <c88>   DW_AT_const_value : 5
 <2><c89>: Abbrev Number: 0
 <1><c8a>: Abbrev Number: 5 (DW_TAG_typedef)
    <c8b>   DW_AT_name        : (indirect string, offset: 0x9d5d1): RadioModems_t
    <c8f>   DW_AT_decl_file   : 11
    <c90>   DW_AT_decl_line   : 71
    <c91>   DW_AT_decl_column : 2
    <c92>   DW_AT_type        : <0xc57>
 <1><c96>: Abbrev Number: 17 (DW_TAG_structure_type)
    <c97>   DW_AT_byte_size   : 28
    <c98>   DW_AT_decl_file   : 11
    <c99>   DW_AT_decl_line   : 76
    <c9a>   DW_AT_decl_column : 9
    <c9a>   DW_AT_sibling     : <0xcfa>
 <2><c9e>: Abbrev Number: 3 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x3b713): TxDone
    <ca3>   DW_AT_decl_file   : 11
    <ca4>   DW_AT_decl_line   : 81
    <ca5>   DW_AT_decl_column : 16
    <ca6>   DW_AT_type        : <0x139>
    <caa>   DW_AT_data_member_location: 0
 <2><cab>: Abbrev Number: 3 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0x80014): TxTimeout
    <cb0>   DW_AT_decl_file   : 11
    <cb1>   DW_AT_decl_line   : 85
    <cb2>   DW_AT_decl_column : 16
    <cb3>   DW_AT_type        : <0x139>
    <cb7>   DW_AT_data_member_location: 4
 <2><cb8>: Abbrev Number: 3 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0x4b464): RxDone
    <cbd>   DW_AT_decl_file   : 11
    <cbe>   DW_AT_decl_line   : 96
    <cbf>   DW_AT_decl_column : 16
    <cc0>   DW_AT_type        : <0xd14>
    <cc4>   DW_AT_data_member_location: 8
 <2><cc5>: Abbrev Number: 3 (DW_TAG_member)
    <cc6>   DW_AT_name        : (indirect string, offset: 0x23c68): RxTimeout
    <cca>   DW_AT_decl_file   : 11
    <ccb>   DW_AT_decl_line   : 100
    <ccc>   DW_AT_decl_column : 16
    <ccd>   DW_AT_type        : <0x139>
    <cd1>   DW_AT_data_member_location: 12
 <2><cd2>: Abbrev Number: 3 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0xd089): RxError
    <cd7>   DW_AT_decl_file   : 11
    <cd8>   DW_AT_decl_line   : 104
    <cd9>   DW_AT_decl_column : 16
    <cda>   DW_AT_type        : <0x139>
    <cde>   DW_AT_data_member_location: 16
 <2><cdf>: Abbrev Number: 3 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x55f98): FhssChangeChannel
    <ce4>   DW_AT_decl_file   : 11
    <ce5>   DW_AT_decl_line   : 110
    <ce6>   DW_AT_decl_column : 13
    <ce7>   DW_AT_type        : <0xd24>
    <ceb>   DW_AT_data_member_location: 20
 <2><cec>: Abbrev Number: 3 (DW_TAG_member)
    <ced>   DW_AT_name        : (indirect string, offset: 0x45014): CadDone
    <cf1>   DW_AT_decl_file   : 11
    <cf2>   DW_AT_decl_line   : 116
    <cf3>   DW_AT_decl_column : 13
    <cf4>   DW_AT_type        : <0xd3b>
    <cf8>   DW_AT_data_member_location: 24
 <2><cf9>: Abbrev Number: 0
 <1><cfa>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <cfb>   DW_AT_prototyped  : 1
    <cfb>   DW_AT_sibling     : <0xd14>
 <2><cff>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d00>   DW_AT_type        : <0x134>
 <2><d04>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d05>   DW_AT_type        : <0xf4>
 <2><d09>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d0a>   DW_AT_type        : <0xe8>
 <2><d0e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d0f>   DW_AT_type        : <0xcb>
 <2><d13>: Abbrev Number: 0
 <1><d14>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d15>   DW_AT_byte_size   : 4
    <d15>   DW_AT_type        : <0xcfa>
 <1><d19>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d1a>   DW_AT_prototyped  : 1
    <d1a>   DW_AT_sibling     : <0xd24>
 <2><d1e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d1f>   DW_AT_type        : <0xd7>
 <2><d23>: Abbrev Number: 0
 <1><d24>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d25>   DW_AT_byte_size   : 4
    <d25>   DW_AT_type        : <0xd19>
 <1><d29>: Abbrev Number: 10 (DW_TAG_subroutine_type)
    <d2a>   DW_AT_prototyped  : 1
    <d2a>   DW_AT_sibling     : <0xd34>
 <2><d2e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d2f>   DW_AT_type        : <0xd34>
 <2><d33>: Abbrev Number: 0
 <1><d34>: Abbrev Number: 15 (DW_TAG_base_type)
    <d35>   DW_AT_byte_size   : 1
    <d36>   DW_AT_encoding    : 2	(boolean)
    <d37>   DW_AT_name        : (indirect string, offset: 0x3ba72): _Bool
 <1><d3b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <d3c>   DW_AT_byte_size   : 4
    <d3c>   DW_AT_type        : <0xd29>
 <1><d40>: Abbrev Number: 5 (DW_TAG_typedef)
    <d41>   DW_AT_name        : (indirect string, offset: 0x65023): RadioEvents_t
    <d45>   DW_AT_decl_file   : 11
    <d46>   DW_AT_decl_line   : 117
    <d47>   DW_AT_decl_column : 2
    <d48>   DW_AT_type        : <0xc96>
 <1><d4c>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <d4d>   DW_AT_encoding    : 7	(unsigned)
    <d4e>   DW_AT_byte_size   : 1
    <d4f>   DW_AT_type        : <0x71>
    <d53>   DW_AT_decl_file   : 12
    <d54>   DW_AT_decl_line   : 31
    <d55>   DW_AT_decl_column : 1
    <d56>   DW_AT_sibling     : <0xd73>
 <2><d5a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d5b>   DW_AT_name        : (indirect string, offset: 0x30813): GENERIC_FSK
    <d5f>   DW_AT_const_value : 0
 <2><d60>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d61>   DW_AT_name        : (indirect string, offset: 0x54c92): GENERIC_LORA
    <d65>   DW_AT_const_value : 1
 <2><d66>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d67>   DW_AT_name        : (indirect string, offset: 0x86a03): GENERIC_BPSK
    <d6b>   DW_AT_const_value : 2
 <2><d6c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d6d>   DW_AT_name        : (indirect string, offset: 0x2a355): GENERIC_MSK
    <d71>   DW_AT_const_value : 3
 <2><d72>: Abbrev Number: 0
 <1><d73>: Abbrev Number: 5 (DW_TAG_typedef)
    <d74>   DW_AT_name        : (indirect string, offset: 0x368b0): GenericModems_t
    <d78>   DW_AT_decl_file   : 12
    <d79>   DW_AT_decl_line   : 36
    <d7a>   DW_AT_decl_column : 2
    <d7b>   DW_AT_type        : <0xd4c>
 <1><d7f>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <d80>   DW_AT_encoding    : 7	(unsigned)
    <d81>   DW_AT_byte_size   : 1
    <d82>   DW_AT_type        : <0x71>
    <d86>   DW_AT_decl_file   : 12
    <d87>   DW_AT_decl_line   : 42
    <d88>   DW_AT_decl_column : 1
    <d89>   DW_AT_sibling     : <0xdbe>
 <2><d8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d8e>   DW_AT_name        : (indirect string, offset: 0x623c3): RADIO_LORA_SF5
    <d92>   DW_AT_const_value : 5
 <2><d93>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d94>   DW_AT_name        : (indirect string, offset: 0x673e0): RADIO_LORA_SF6
    <d98>   DW_AT_const_value : 6
 <2><d99>: Abbrev Number: 1 (DW_TAG_enumerator)
    <d9a>   DW_AT_name        : (indirect string, offset: 0x62516): RADIO_LORA_SF7
    <d9e>   DW_AT_const_value : 7
 <2><d9f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da0>   DW_AT_name        : (indirect string, offset: 0x67419): RADIO_LORA_SF8
    <da4>   DW_AT_const_value : 8
 <2><da5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <da6>   DW_AT_name        : (indirect string, offset: 0x67428): RADIO_LORA_SF9
    <daa>   DW_AT_const_value : 9
 <2><dab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dac>   DW_AT_name        : (indirect string, offset: 0x78f68): RADIO_LORA_SF10
    <db0>   DW_AT_const_value : 10
 <2><db1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db2>   DW_AT_name        : (indirect string, offset: 0x78f78): RADIO_LORA_SF11
    <db6>   DW_AT_const_value : 11
 <2><db7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <db8>   DW_AT_name        : (indirect string, offset: 0x78f88): RADIO_LORA_SF12
    <dbc>   DW_AT_const_value : 12
 <2><dbd>: Abbrev Number: 0
 <1><dbe>: Abbrev Number: 5 (DW_TAG_typedef)
    <dbf>   DW_AT_name        : (indirect string, offset: 0xffea): RADIO_LoRaSpreadingFactors_t
    <dc3>   DW_AT_decl_file   : 12
    <dc4>   DW_AT_decl_line   : 51
    <dc5>   DW_AT_decl_column : 2
    <dc6>   DW_AT_type        : <0xd7f>
 <1><dca>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <dcb>   DW_AT_encoding    : 7	(unsigned)
    <dcc>   DW_AT_byte_size   : 1
    <dcd>   DW_AT_type        : <0x71>
    <dd1>   DW_AT_decl_file   : 12
    <dd2>   DW_AT_decl_line   : 57
    <dd3>   DW_AT_decl_column : 1
    <dd4>   DW_AT_sibling     : <0xdf1>
 <2><dd8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <dd9>   DW_AT_name        : (indirect string, offset: 0x74dbd): RADIO_LORA_CR_4_5
    <ddd>   DW_AT_const_value : 1
 <2><dde>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ddf>   DW_AT_name        : (indirect string, offset: 0x74dcf): RADIO_LORA_CR_4_6
    <de3>   DW_AT_const_value : 2
 <2><de4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <de5>   DW_AT_name        : (indirect string, offset: 0x74de1): RADIO_LORA_CR_4_7
    <de9>   DW_AT_const_value : 3
 <2><dea>: Abbrev Number: 1 (DW_TAG_enumerator)
    <deb>   DW_AT_name        : (indirect string, offset: 0x74df3): RADIO_LORA_CR_4_8
    <def>   DW_AT_const_value : 4
 <2><df0>: Abbrev Number: 0
 <1><df1>: Abbrev Number: 5 (DW_TAG_typedef)
    <df2>   DW_AT_name        : (indirect string, offset: 0x4a857): RADIO_LoRaCodingRates_t
    <df6>   DW_AT_decl_file   : 12
    <df7>   DW_AT_decl_line   : 62
    <df8>   DW_AT_decl_column : 2
    <df9>   DW_AT_type        : <0xdca>
 <1><dfd>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <dfe>   DW_AT_encoding    : 7	(unsigned)
    <dff>   DW_AT_byte_size   : 1
    <e00>   DW_AT_type        : <0x71>
    <e04>   DW_AT_decl_file   : 12
    <e05>   DW_AT_decl_line   : 68
    <e06>   DW_AT_decl_column : 1
    <e07>   DW_AT_sibling     : <0xe48>
 <2><e0b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e0c>   DW_AT_name        : (indirect string, offset: 0x9d46d): RADIO_LORA_BW_500
    <e10>   DW_AT_const_value : 6
 <2><e11>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e12>   DW_AT_name        : (indirect string, offset: 0x5970e): RADIO_LORA_BW_250
    <e16>   DW_AT_const_value : 5
 <2><e17>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e18>   DW_AT_name        : (indirect string, offset: 0x417fa): RADIO_LORA_BW_125
    <e1c>   DW_AT_const_value : 4
 <2><e1d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e1e>   DW_AT_name        : (indirect string, offset: 0x2b4cc): RADIO_LORA_BW_062
    <e22>   DW_AT_const_value : 3
 <2><e23>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e24>   DW_AT_name        : (indirect string, offset: 0xd2ec): RADIO_LORA_BW_041
    <e28>   DW_AT_const_value : 10
 <2><e29>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x2a657): RADIO_LORA_BW_031
    <e2e>   DW_AT_const_value : 2
 <2><e2f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e30>   DW_AT_name        : (indirect string, offset: 0x2a1a4): RADIO_LORA_BW_020
    <e34>   DW_AT_const_value : 9
 <2><e35>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e36>   DW_AT_name        : (indirect string, offset: 0x29d4e): RADIO_LORA_BW_015
    <e3a>   DW_AT_const_value : 1
 <2><e3b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e3c>   DW_AT_name        : (indirect string, offset: 0x29cd6): RADIO_LORA_BW_010
    <e40>   DW_AT_const_value : 8
 <2><e41>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e42>   DW_AT_name        : (indirect string, offset: 0x297ad): RADIO_LORA_BW_007
    <e46>   DW_AT_const_value : 0
 <2><e47>: Abbrev Number: 0
 <1><e48>: Abbrev Number: 5 (DW_TAG_typedef)
    <e49>   DW_AT_name        : (indirect string, offset: 0x78880): RADIO_LoRaBandwidths_t
    <e4d>   DW_AT_decl_file   : 12
    <e4e>   DW_AT_decl_line   : 79
    <e4f>   DW_AT_decl_column : 2
    <e50>   DW_AT_type        : <0xdfd>
 <1><e54>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <e55>   DW_AT_encoding    : 7	(unsigned)
    <e56>   DW_AT_byte_size   : 1
    <e57>   DW_AT_type        : <0x71>
    <e5b>   DW_AT_decl_file   : 12
    <e5c>   DW_AT_decl_line   : 85
    <e5d>   DW_AT_decl_column : 1
    <e5e>   DW_AT_sibling     : <0xe7b>
 <2><e62>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e63>   DW_AT_name        : (indirect string, offset: 0x99052): RADIO_LORA_PACKET_VARIABLE_LENGTH
    <e67>   DW_AT_const_value : 0
 <2><e68>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e69>   DW_AT_name        : (indirect string, offset: 0x8f340): RADIO_LORA_PACKET_FIXED_LENGTH
    <e6d>   DW_AT_const_value : 1
 <2><e6e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e6f>   DW_AT_name        : (indirect string, offset: 0x45ff1): RADIO_LORA_PACKET_EXPLICIT
    <e73>   DW_AT_const_value : 0
 <2><e74>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e75>   DW_AT_name        : (indirect string, offset: 0x3cd49): RADIO_LORA_PACKET_IMPLICIT
    <e79>   DW_AT_const_value : 1
 <2><e7a>: Abbrev Number: 0
 <1><e7b>: Abbrev Number: 5 (DW_TAG_typedef)
    <e7c>   DW_AT_name        : (indirect string, offset: 0x526e): RADIO_LoRaPacketLengthsMode_t
    <e80>   DW_AT_decl_file   : 12
    <e81>   DW_AT_decl_line   : 90
    <e82>   DW_AT_decl_column : 2
    <e83>   DW_AT_type        : <0xe54>
 <1><e87>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <e88>   DW_AT_encoding    : 7	(unsigned)
    <e89>   DW_AT_byte_size   : 1
    <e8a>   DW_AT_type        : <0x71>
    <e8e>   DW_AT_decl_file   : 12
    <e8f>   DW_AT_decl_line   : 96
    <e90>   DW_AT_decl_column : 1
    <e91>   DW_AT_sibling     : <0xea2>
 <2><e95>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e96>   DW_AT_name        : (indirect string, offset: 0x4564a): RADIO_LORA_CRC_ON
    <e9a>   DW_AT_const_value : 1
 <2><e9b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <e9c>   DW_AT_name        : (indirect string, offset: 0x7817): RADIO_LORA_CRC_OFF
    <ea0>   DW_AT_const_value : 0
 <2><ea1>: Abbrev Number: 0
 <1><ea2>: Abbrev Number: 5 (DW_TAG_typedef)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x6eac9): RADIO_LoRaCrcModes_t
    <ea7>   DW_AT_decl_file   : 12
    <ea8>   DW_AT_decl_line   : 99
    <ea9>   DW_AT_decl_column : 2
    <eaa>   DW_AT_type        : <0xe87>
 <1><eae>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <eaf>   DW_AT_encoding    : 7	(unsigned)
    <eb0>   DW_AT_byte_size   : 1
    <eb1>   DW_AT_type        : <0x71>
    <eb5>   DW_AT_decl_file   : 12
    <eb6>   DW_AT_decl_line   : 105
    <eb7>   DW_AT_decl_column : 1
    <eb8>   DW_AT_sibling     : <0xec9>
 <2><ebc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ebd>   DW_AT_name        : (indirect string, offset: 0x45a7a): RADIO_LORA_IQ_NORMAL
    <ec1>   DW_AT_const_value : 0
 <2><ec2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ec3>   DW_AT_name        : (indirect string, offset: 0xa9d4c): RADIO_LORA_IQ_INVERTED
    <ec7>   DW_AT_const_value : 1
 <2><ec8>: Abbrev Number: 0
 <1><ec9>: Abbrev Number: 5 (DW_TAG_typedef)
    <eca>   DW_AT_name        : (indirect string, offset: 0xd792): RADIO_LoRaIQModes_t
    <ece>   DW_AT_decl_file   : 12
    <ecf>   DW_AT_decl_line   : 108
    <ed0>   DW_AT_decl_column : 2
    <ed1>   DW_AT_type        : <0xeae>
 <1><ed5>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <ed6>   DW_AT_encoding    : 7	(unsigned)
    <ed7>   DW_AT_byte_size   : 1
    <ed8>   DW_AT_type        : <0x71>
    <edc>   DW_AT_decl_file   : 12
    <edd>   DW_AT_decl_line   : 114
    <ede>   DW_AT_decl_column : 1
    <edf>   DW_AT_sibling     : <0xef6>
 <2><ee3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x3aa2f): RADIO_LORA_LOWDR_OPT_OFF
    <ee8>   DW_AT_const_value : 0
 <2><ee9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eea>   DW_AT_name        : (indirect string, offset: 0xc39b): RADIO_LORA_LOWDR_OPT_ON
    <eee>   DW_AT_const_value : 1
 <2><eef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x9a4b): RADIO_LORA_LOWDR_OPT_AUTO
    <ef4>   DW_AT_const_value : 2
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 5 (DW_TAG_typedef)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x31189): RADIO_Ld_Opt_t
    <efb>   DW_AT_decl_file   : 12
    <efc>   DW_AT_decl_line   : 118
    <efd>   DW_AT_decl_column : 2
    <efe>   DW_AT_type        : <0xed5>
 <1><f02>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <f03>   DW_AT_encoding    : 7	(unsigned)
    <f04>   DW_AT_byte_size   : 1
    <f05>   DW_AT_type        : <0x71>
    <f09>   DW_AT_decl_file   : 12
    <f0a>   DW_AT_decl_line   : 126
    <f0b>   DW_AT_decl_column : 1
    <f0c>   DW_AT_sibling     : <0xf2f>
 <2><f10>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f11>   DW_AT_name        : (indirect string, offset: 0x534fc): RADIO_FSK_MOD_SHAPING_OFF
    <f15>   DW_AT_const_value : 0
 <2><f16>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f17>   DW_AT_name        : (indirect string, offset: 0x305d1): RADIO_FSK_MOD_SHAPING_G_BT_03
    <f1b>   DW_AT_const_value : 8
 <2><f1c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f1d>   DW_AT_name        : (indirect string, offset: 0x65976): RADIO_FSK_MOD_SHAPING_G_BT_05
    <f21>   DW_AT_const_value : 9
 <2><f22>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f23>   DW_AT_name        : (indirect string, offset: 0x3066c): RADIO_FSK_MOD_SHAPING_G_BT_07
    <f27>   DW_AT_const_value : 10
 <2><f28>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f29>   DW_AT_name        : (indirect string, offset: 0x4a128): RADIO_FSK_MOD_SHAPING_G_BT_1
    <f2d>   DW_AT_const_value : 11
 <2><f2e>: Abbrev Number: 0
 <1><f2f>: Abbrev Number: 5 (DW_TAG_typedef)
    <f30>   DW_AT_name        : (indirect string, offset: 0x31ec9): RADIO_FSK_ModShapings_t
    <f34>   DW_AT_decl_file   : 12
    <f35>   DW_AT_decl_line   : 132
    <f36>   DW_AT_decl_column : 2
    <f37>   DW_AT_type        : <0xf02>
 <1><f3b>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <f3c>   DW_AT_encoding    : 7	(unsigned)
    <f3d>   DW_AT_byte_size   : 1
    <f3e>   DW_AT_type        : <0x71>
    <f42>   DW_AT_decl_file   : 12
    <f43>   DW_AT_decl_line   : 138
    <f44>   DW_AT_decl_column : 1
    <f45>   DW_AT_sibling     : <0xf68>
 <2><f49>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x67966): RADIO_FSK_PREAMBLE_DETECTOR_OFF
    <f4e>   DW_AT_const_value : 0
 <2><f4f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f50>   DW_AT_name        : (indirect string, offset: 0x8db7c): RADIO_FSK_PREAMBLE_DETECTOR_08_BITS
    <f54>   DW_AT_const_value : 4
 <2><f55>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f56>   DW_AT_name        : (indirect string, offset: 0x3bd99): RADIO_FSK_PREAMBLE_DETECTOR_16_BITS
    <f5a>   DW_AT_const_value : 5
 <2><f5b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f5c>   DW_AT_name        : (indirect string, offset: 0x6eea3): RADIO_FSK_PREAMBLE_DETECTOR_24_BITS
    <f60>   DW_AT_const_value : 6
 <2><f61>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f62>   DW_AT_name        : (indirect string, offset: 0x4824a): RADIO_FSK_PREAMBLE_DETECTOR_32_BITS
    <f66>   DW_AT_const_value : 7
 <2><f67>: Abbrev Number: 0
 <1><f68>: Abbrev Number: 5 (DW_TAG_typedef)
    <f69>   DW_AT_name        : (indirect string, offset: 0x1c8d3): RADIO_FSK_PreambleDetection_t
    <f6d>   DW_AT_decl_file   : 12
    <f6e>   DW_AT_decl_line   : 144
    <f6f>   DW_AT_decl_column : 2
    <f70>   DW_AT_type        : <0xf3b>
 <1><f74>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <f75>   DW_AT_encoding    : 7	(unsigned)
    <f76>   DW_AT_byte_size   : 1
    <f77>   DW_AT_type        : <0x71>
    <f7b>   DW_AT_decl_file   : 12
    <f7c>   DW_AT_decl_line   : 150
    <f7d>   DW_AT_decl_column : 1
    <f7e>   DW_AT_sibling     : <0xf95>
 <2><f82>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f83>   DW_AT_name        : (indirect string, offset: 0x36f52): RADIO_FSK_ADDRESSCOMP_FILT_OFF
    <f87>   DW_AT_const_value : 0
 <2><f88>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f89>   DW_AT_name        : (indirect string, offset: 0x4466c): RADIO_FSK_ADDRESSCOMP_FILT_NODE
    <f8d>   DW_AT_const_value : 1
 <2><f8e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f8f>   DW_AT_name        : (indirect string, offset: 0x8d32d): RADIO_FSK_ADDRESSCOMP_FILT_NODE_BROAD
    <f93>   DW_AT_const_value : 2
 <2><f94>: Abbrev Number: 0
 <1><f95>: Abbrev Number: 5 (DW_TAG_typedef)
    <f96>   DW_AT_name        : (indirect string, offset: 0x3745d): RADIO_FSK_AddressComp_t
    <f9a>   DW_AT_decl_file   : 12
    <f9b>   DW_AT_decl_line   : 154
    <f9c>   DW_AT_decl_column : 2
    <f9d>   DW_AT_type        : <0xf74>
 <1><fa1>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <fa2>   DW_AT_encoding    : 7	(unsigned)
    <fa3>   DW_AT_byte_size   : 1
    <fa4>   DW_AT_type        : <0x71>
    <fa8>   DW_AT_decl_file   : 12
    <fa9>   DW_AT_decl_line   : 160
    <faa>   DW_AT_decl_column : 1
    <fab>   DW_AT_sibling     : <0xfc2>
 <2><faf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb0>   DW_AT_name        : (indirect string, offset: 0x58710): RADIO_FSK_PACKET_FIXED_LENGTH
    <fb4>   DW_AT_const_value : 0
 <2><fb5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x163dd): RADIO_FSK_PACKET_VARIABLE_LENGTH
    <fba>   DW_AT_const_value : 1
 <2><fbb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fbc>   DW_AT_name        : (indirect string, offset: 0x10c6e): RADIO_FSK_PACKET_2BYTES_LENGTH
    <fc0>   DW_AT_const_value : 2
 <2><fc1>: Abbrev Number: 0
 <1><fc2>: Abbrev Number: 5 (DW_TAG_typedef)
    <fc3>   DW_AT_name        : (indirect string, offset: 0x23265): RADIO_FSK_PacketLengthModes_t
    <fc7>   DW_AT_decl_file   : 12
    <fc8>   DW_AT_decl_line   : 164
    <fc9>   DW_AT_decl_column : 2
    <fca>   DW_AT_type        : <0xfa1>
 <1><fce>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <fcf>   DW_AT_encoding    : 7	(unsigned)
    <fd0>   DW_AT_byte_size   : 1
    <fd1>   DW_AT_type        : <0x71>
    <fd5>   DW_AT_decl_file   : 12
    <fd6>   DW_AT_decl_line   : 170
    <fd7>   DW_AT_decl_column : 1
    <fd8>   DW_AT_sibling     : <0x1007>
 <2><fdc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fdd>   DW_AT_name        : (indirect string, offset: 0x71f24): RADIO_FSK_CRC_OFF
    <fe1>   DW_AT_const_value : 1
 <2><fe2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe3>   DW_AT_name        : (indirect string, offset: 0xd971): RADIO_FSK_CRC_1_BYTES
    <fe7>   DW_AT_const_value : 0
 <2><fe8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fe9>   DW_AT_name        : (indirect string, offset: 0x54f4f): RADIO_FSK_CRC_2_BYTES
    <fed>   DW_AT_const_value : 2
 <2><fee>: Abbrev Number: 1 (DW_TAG_enumerator)
    <fef>   DW_AT_name        : (indirect string, offset: 0x39760): RADIO_FSK_CRC_1_BYTES_INV
    <ff3>   DW_AT_const_value : 4
 <2><ff4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x874cd): RADIO_FSK_CRC_2_BYTES_INV
    <ff9>   DW_AT_const_value : 6
 <2><ffa>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x829e5): RADIO_FSK_CRC_2_BYTES_IBM
    <fff>   DW_AT_const_value : 241
 <2><1000>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1001>   DW_AT_name        : (indirect string, offset: 0x66207): RADIO_FSK_CRC_2_BYTES_CCIT
    <1005>   DW_AT_const_value : 242
 <2><1006>: Abbrev Number: 0
 <1><1007>: Abbrev Number: 5 (DW_TAG_typedef)
    <1008>   DW_AT_name        : (indirect string, offset: 0x5e1ca): RADIO_FSK_CrcTypes_t
    <100c>   DW_AT_decl_file   : 12
    <100d>   DW_AT_decl_line   : 178
    <100e>   DW_AT_decl_column : 2
    <100f>   DW_AT_type        : <0xfce>
 <1><1013>: Abbrev Number: 9 (DW_TAG_enumeration_type)
    <1014>   DW_AT_encoding    : 7	(unsigned)
    <1015>   DW_AT_byte_size   : 1
    <1016>   DW_AT_type        : <0x71>
    <101a>   DW_AT_decl_file   : 12
    <101b>   DW_AT_decl_line   : 184
    <101c>   DW_AT_decl_column : 1
    <101d>   DW_AT_sibling     : <0x1034>
 <2><1021>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1022>   DW_AT_name        : (indirect string, offset: 0x8a4b3): RADIO_FSK_DC_FREE_OFF
    <1026>   DW_AT_const_value : 0
 <2><1027>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1028>   DW_AT_name        : (indirect string, offset: 0x6fdf5): RADIO_FSK_DC_FREEWHITENING
    <102c>   DW_AT_const_value : 1
 <2><102d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <102e>   DW_AT_name        : (indirect string, offset: 0x7be40): RADIO_FSK_DC_IBM_WHITENING
    <1032>   DW_AT_const_value : 2
 <2><1033>: Abbrev Number: 0
 <1><1034>: Abbrev Number: 5 (DW_TAG_typedef)
    <1035>   DW_AT_name        : (indirect string, offset: 0x6a035): RADIO_FSK_DcFree_t
    <1039>   DW_AT_decl_file   : 12
    <103a>   DW_AT_decl_line   : 188
    <103b>   DW_AT_decl_column : 2
    <103c>   DW_AT_type        : <0x1013>
 <1><1040>: Abbrev Number: 17 (DW_TAG_structure_type)
    <1041>   DW_AT_byte_size   : 16
    <1042>   DW_AT_decl_file   : 12
    <1043>   DW_AT_decl_line   : 193
    <1044>   DW_AT_decl_column : 9
    <1044>   DW_AT_sibling     : <0x10cb>
 <2><1048>: Abbrev Number: 3 (DW_TAG_member)
    <1049>   DW_AT_name        : (indirect string, offset: 0x1dce9): StopTimerOnPreambleDetect
    <104d>   DW_AT_decl_file   : 12
    <104e>   DW_AT_decl_line   : 195
    <104f>   DW_AT_decl_column : 12
    <1050>   DW_AT_type        : <0x111>
